/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const SYSTEM_DIMENSIONS: u32 = 1;
pub const HIGHEST_DIMENSIONS: u32 = 5;
pub const _ERRNO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;

pub const TRIGGER_RES_TYPE_JOB: u32 = 1;
pub const TRIGGER_RES_TYPE_NODE: u32 = 2;
pub const TRIGGER_RES_TYPE_SLURMCTLD: u32 = 3;
pub const TRIGGER_RES_TYPE_SLURMDBD: u32 = 4;
pub const TRIGGER_RES_TYPE_DATABASE: u32 = 5;
pub const TRIGGER_RES_TYPE_FRONT_END: u32 = 6;
pub const TRIGGER_RES_TYPE_OTHER: u32 = 7;
pub const ASSOC_MGR_INFO_FLAG_ASSOC: u32 = 1;
pub const ASSOC_MGR_INFO_FLAG_USERS: u32 = 2;
pub const ASSOC_MGR_INFO_FLAG_QOS: u32 = 4;
pub const BB_FLAG_DISABLE_PERSISTENT: u32 = 1;
pub const BB_FLAG_ENABLE_PERSISTENT: u32 = 2;
pub const BB_FLAG_EMULATE_CRAY: u32 = 4;
pub const BB_FLAG_PRIVATE_DATA: u32 = 8;
pub const BB_FLAG_TEARDOWN_FAILURE: u32 = 16;
pub const BB_SIZE_IN_NODES: i64 = -9223372036854775808;
pub const BB_STATE_PENDING: u32 = 0;
pub const BB_STATE_ALLOCATING: u32 = 1;
pub const BB_STATE_ALLOCATED: u32 = 2;
pub const BB_STATE_DELETING: u32 = 5;
pub const BB_STATE_DELETED: u32 = 6;
pub const BB_STATE_STAGING_IN: u32 = 17;
pub const BB_STATE_STAGED_IN: u32 = 18;
pub const BB_STATE_PRE_RUN: u32 = 24;
pub const BB_STATE_ALLOC_REVOKE: u32 = 26;
pub const BB_STATE_RUNNING: u32 = 33;
pub const BB_STATE_SUSPEND: u32 = 34;
pub const BB_STATE_POST_RUN: u32 = 41;
pub const BB_STATE_STAGING_OUT: u32 = 49;
pub const BB_STATE_STAGED_OUT: u32 = 50;
pub const BB_STATE_TEARDOWN: u32 = 65;
pub const BB_STATE_TEARDOWN_FAIL: u32 = 67;
pub const BB_STATE_COMPLETE: u32 = 69;
pub const QOS_FLAG_BASE: u32 = 268435455;
pub const QOS_FLAG_NOTSET: u32 = 268435456;
pub const QOS_FLAG_ADD: u32 = 536870912;
pub const QOS_FLAG_REMOVE: u32 = 1073741824;
pub const SLURMDB_RES_FLAG_BASE: u32 = 268435455;
pub const SLURMDB_RES_FLAG_NOTSET: u32 = 268435456;
pub const SLURMDB_RES_FLAG_ADD: u32 = 536870912;
pub const SLURMDB_RES_FLAG_REMOVE: u32 = 1073741824;
pub const FEDERATION_FLAG_BASE: u32 = 268435455;
pub const FEDERATION_FLAG_NOTSET: u32 = 268435456;
pub const FEDERATION_FLAG_ADD: u32 = 536870912;
pub const FEDERATION_FLAG_REMOVE: u32 = 1073741824;
pub const CLUSTER_FED_STATE_BASE: u32 = 15;
pub const CLUSTER_FED_STATE_FLAGS: u32 = 65520;
pub const CLUSTER_FED_STATE_DRAIN: u32 = 16;
pub const CLUSTER_FED_STATE_REMOVE: u32 = 32;
pub const SLURMDB_JOB_FLAG_NONE: u32 = 0;
pub const SLURMDB_JOB_CLEAR_SCHED: u32 = 15;
pub const SLURMDB_PURGE_BASE: u32 = 65535;
pub const SLURMDB_PURGE_FLAGS: u32 = 4294901760;
pub const SLURMDB_PURGE_HOURS: u32 = 65536;
pub const SLURMDB_PURGE_DAYS: u32 = 131072;
pub const SLURMDB_PURGE_MONTHS: u32 = 262144;
pub const SLURMDB_PURGE_ARCHIVE: u32 = 524288;
pub const SLURMDB_FS_USE_PARENT: u32 = 2147483647;
pub const SLURMDB_CLASSIFIED_FLAG: u32 = 256;
pub const SLURMDB_CLASS_BASE: u32 = 255;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
unsafe extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
pub const slurm_err_t_SLURM_UNEXPECTED_MSG_ERROR: slurm_err_t = 1000;
pub const slurm_err_t_SLURM_COMMUNICATIONS_CONNECTION_ERROR: slurm_err_t = 1001;
pub const slurm_err_t_SLURM_COMMUNICATIONS_SEND_ERROR: slurm_err_t = 1002;
pub const slurm_err_t_SLURM_COMMUNICATIONS_RECEIVE_ERROR: slurm_err_t = 1003;
pub const slurm_err_t_SLURM_COMMUNICATIONS_SHUTDOWN_ERROR: slurm_err_t = 1004;
pub const slurm_err_t_SLURM_PROTOCOL_VERSION_ERROR: slurm_err_t = 1005;
pub const slurm_err_t_SLURM_PROTOCOL_IO_STREAM_VERSION_ERROR: slurm_err_t = 1006;
pub const slurm_err_t_SLURM_PROTOCOL_AUTHENTICATION_ERROR: slurm_err_t = 1007;
pub const slurm_err_t_SLURM_PROTOCOL_INSANE_MSG_LENGTH: slurm_err_t = 1008;
pub const slurm_err_t_SLURM_MPI_PLUGIN_NAME_INVALID: slurm_err_t = 1009;
pub const slurm_err_t_SLURM_MPI_PLUGIN_PRELAUNCH_SETUP_FAILED: slurm_err_t = 1010;
pub const slurm_err_t_SLURM_PLUGIN_NAME_INVALID: slurm_err_t = 1011;
pub const slurm_err_t_SLURM_UNKNOWN_FORWARD_ADDR: slurm_err_t = 1012;
pub const slurm_err_t_SLURM_COMMUNICATIONS_MISSING_SOCKET_ERROR: slurm_err_t = 1013;
pub const slurm_err_t_SLURM_COMMUNICATIONS_INVALID_INCOMING_FD: slurm_err_t = 1014;
pub const slurm_err_t_SLURM_COMMUNICATIONS_INVALID_OUTGOING_FD: slurm_err_t = 1015;
pub const slurm_err_t_SLURM_COMMUNICATIONS_INVALID_FD: slurm_err_t = 1016;
pub const slurm_err_t_SLURMCTLD_COMMUNICATIONS_CONNECTION_ERROR: slurm_err_t = 1800;
pub const slurm_err_t_SLURMCTLD_COMMUNICATIONS_SEND_ERROR: slurm_err_t = 1801;
pub const slurm_err_t_SLURMCTLD_COMMUNICATIONS_RECEIVE_ERROR: slurm_err_t = 1802;
pub const slurm_err_t_SLURMCTLD_COMMUNICATIONS_SHUTDOWN_ERROR: slurm_err_t = 1803;
pub const slurm_err_t_SLURMCTLD_COMMUNICATIONS_BACKOFF: slurm_err_t = 1804;
pub const slurm_err_t_SLURMCTLD_COMMUNICATIONS_HARD_DROP: slurm_err_t = 1805;
pub const slurm_err_t_SLURM_NO_CHANGE_IN_DATA: slurm_err_t = 1900;
pub const slurm_err_t_ESLURM_INVALID_PARTITION_NAME: slurm_err_t = 2000;
pub const slurm_err_t_ESLURM_DEFAULT_PARTITION_NOT_SET: slurm_err_t = 2001;
pub const slurm_err_t_ESLURM_ACCESS_DENIED: slurm_err_t = 2002;
pub const slurm_err_t_ESLURM_JOB_MISSING_REQUIRED_PARTITION_GROUP: slurm_err_t = 2003;
pub const slurm_err_t_ESLURM_REQUESTED_NODES_NOT_IN_PARTITION: slurm_err_t = 2004;
pub const slurm_err_t_ESLURM_TOO_MANY_REQUESTED_CPUS: slurm_err_t = 2005;
pub const slurm_err_t_ESLURM_INVALID_NODE_COUNT: slurm_err_t = 2006;
pub const slurm_err_t_ESLURM_ERROR_ON_DESC_TO_RECORD_COPY: slurm_err_t = 2007;
pub const slurm_err_t_ESLURM_JOB_MISSING_SIZE_SPECIFICATION: slurm_err_t = 2008;
pub const slurm_err_t_ESLURM_JOB_SCRIPT_MISSING: slurm_err_t = 2009;
pub const slurm_err_t_ESLURM_USER_ID_MISSING: slurm_err_t = 2010;
pub const slurm_err_t_ESLURM_DUPLICATE_JOB_ID: slurm_err_t = 2011;
pub const slurm_err_t_ESLURM_PATHNAME_TOO_LONG: slurm_err_t = 2012;
pub const slurm_err_t_ESLURM_NOT_TOP_PRIORITY: slurm_err_t = 2013;
pub const slurm_err_t_ESLURM_REQUESTED_NODE_CONFIG_UNAVAILABLE: slurm_err_t = 2014;
pub const slurm_err_t_ESLURM_REQUESTED_PART_CONFIG_UNAVAILABLE: slurm_err_t = 2015;
pub const slurm_err_t_ESLURM_NODES_BUSY: slurm_err_t = 2016;
pub const slurm_err_t_ESLURM_INVALID_JOB_ID: slurm_err_t = 2017;
pub const slurm_err_t_ESLURM_INVALID_NODE_NAME: slurm_err_t = 2018;
pub const slurm_err_t_ESLURM_WRITING_TO_FILE: slurm_err_t = 2019;
pub const slurm_err_t_ESLURM_TRANSITION_STATE_NO_UPDATE: slurm_err_t = 2020;
pub const slurm_err_t_ESLURM_ALREADY_DONE: slurm_err_t = 2021;
pub const slurm_err_t_ESLURM_INTERCONNECT_FAILURE: slurm_err_t = 2022;
pub const slurm_err_t_ESLURM_BAD_DIST: slurm_err_t = 2023;
pub const slurm_err_t_ESLURM_JOB_PENDING: slurm_err_t = 2024;
pub const slurm_err_t_ESLURM_BAD_TASK_COUNT: slurm_err_t = 2025;
pub const slurm_err_t_ESLURM_INVALID_JOB_CREDENTIAL: slurm_err_t = 2026;
pub const slurm_err_t_ESLURM_IN_STANDBY_MODE: slurm_err_t = 2027;
pub const slurm_err_t_ESLURM_INVALID_NODE_STATE: slurm_err_t = 2028;
pub const slurm_err_t_ESLURM_INVALID_FEATURE: slurm_err_t = 2029;
pub const slurm_err_t_ESLURM_INVALID_AUTHTYPE_CHANGE: slurm_err_t = 2030;
pub const slurm_err_t_ESLURM_ACTIVE_FEATURE_NOT_SUBSET: slurm_err_t = 2031;
pub const slurm_err_t_ESLURM_INVALID_SCHEDTYPE_CHANGE: slurm_err_t = 2032;
pub const slurm_err_t_ESLURM_INVALID_SELECTTYPE_CHANGE: slurm_err_t = 2033;
pub const slurm_err_t_ESLURM_INVALID_SWITCHTYPE_CHANGE: slurm_err_t = 2034;
pub const slurm_err_t_ESLURM_FRAGMENTATION: slurm_err_t = 2035;
pub const slurm_err_t_ESLURM_NOT_SUPPORTED: slurm_err_t = 2036;
pub const slurm_err_t_ESLURM_DISABLED: slurm_err_t = 2037;
pub const slurm_err_t_ESLURM_DEPENDENCY: slurm_err_t = 2038;
pub const slurm_err_t_ESLURM_BATCH_ONLY: slurm_err_t = 2039;
pub const slurm_err_t_ESLURM_LICENSES_UNAVAILABLE: slurm_err_t = 2040;
pub const slurm_err_t_ESLURM_TAKEOVER_NO_HEARTBEAT: slurm_err_t = 2041;
pub const slurm_err_t_ESLURM_JOB_HELD: slurm_err_t = 2042;
pub const slurm_err_t_ESLURM_INVALID_CRED_TYPE_CHANGE: slurm_err_t = 2043;
pub const slurm_err_t_ESLURM_INVALID_TASK_MEMORY: slurm_err_t = 2044;
pub const slurm_err_t_ESLURM_INVALID_ACCOUNT: slurm_err_t = 2045;
pub const slurm_err_t_ESLURM_INVALID_PARENT_ACCOUNT: slurm_err_t = 2046;
pub const slurm_err_t_ESLURM_SAME_PARENT_ACCOUNT: slurm_err_t = 2047;
pub const slurm_err_t_ESLURM_INVALID_LICENSES: slurm_err_t = 2048;
pub const slurm_err_t_ESLURM_NEED_RESTART: slurm_err_t = 2049;
pub const slurm_err_t_ESLURM_ACCOUNTING_POLICY: slurm_err_t = 2050;
pub const slurm_err_t_ESLURM_INVALID_TIME_LIMIT: slurm_err_t = 2051;
pub const slurm_err_t_ESLURM_RESERVATION_ACCESS: slurm_err_t = 2052;
pub const slurm_err_t_ESLURM_RESERVATION_INVALID: slurm_err_t = 2053;
pub const slurm_err_t_ESLURM_INVALID_TIME_VALUE: slurm_err_t = 2054;
pub const slurm_err_t_ESLURM_RESERVATION_BUSY: slurm_err_t = 2055;
pub const slurm_err_t_ESLURM_RESERVATION_NOT_USABLE: slurm_err_t = 2056;
pub const slurm_err_t_ESLURM_INVALID_WCKEY: slurm_err_t = 2057;
pub const slurm_err_t_ESLURM_RESERVATION_OVERLAP: slurm_err_t = 2058;
pub const slurm_err_t_ESLURM_PORTS_BUSY: slurm_err_t = 2059;
pub const slurm_err_t_ESLURM_PORTS_INVALID: slurm_err_t = 2060;
pub const slurm_err_t_ESLURM_PROLOG_RUNNING: slurm_err_t = 2061;
pub const slurm_err_t_ESLURM_NO_STEPS: slurm_err_t = 2062;
pub const slurm_err_t_ESLURM_MISSING_WORK_DIR: slurm_err_t = 2063;
pub const slurm_err_t_ESLURM_INVALID_QOS: slurm_err_t = 2066;
pub const slurm_err_t_ESLURM_QOS_PREEMPTION_LOOP: slurm_err_t = 2067;
pub const slurm_err_t_ESLURM_NODE_NOT_AVAIL: slurm_err_t = 2068;
pub const slurm_err_t_ESLURM_INVALID_CPU_COUNT: slurm_err_t = 2069;
pub const slurm_err_t_ESLURM_PARTITION_NOT_AVAIL: slurm_err_t = 2070;
pub const slurm_err_t_ESLURM_CIRCULAR_DEPENDENCY: slurm_err_t = 2071;
pub const slurm_err_t_ESLURM_INVALID_GRES: slurm_err_t = 2072;
pub const slurm_err_t_ESLURM_JOB_NOT_PENDING: slurm_err_t = 2073;
pub const slurm_err_t_ESLURM_QOS_THRES: slurm_err_t = 2074;
pub const slurm_err_t_ESLURM_PARTITION_IN_USE: slurm_err_t = 2075;
pub const slurm_err_t_ESLURM_STEP_LIMIT: slurm_err_t = 2076;
pub const slurm_err_t_ESLURM_JOB_SUSPENDED: slurm_err_t = 2077;
pub const slurm_err_t_ESLURM_CAN_NOT_START_IMMEDIATELY: slurm_err_t = 2078;
pub const slurm_err_t_ESLURM_INTERCONNECT_BUSY: slurm_err_t = 2079;
pub const slurm_err_t_ESLURM_RESERVATION_EMPTY: slurm_err_t = 2080;
pub const slurm_err_t_ESLURM_INVALID_ARRAY: slurm_err_t = 2081;
pub const slurm_err_t_ESLURM_RESERVATION_NAME_DUP: slurm_err_t = 2082;
pub const slurm_err_t_ESLURM_JOB_STARTED: slurm_err_t = 2083;
pub const slurm_err_t_ESLURM_JOB_FINISHED: slurm_err_t = 2084;
pub const slurm_err_t_ESLURM_JOB_NOT_RUNNING: slurm_err_t = 2085;
pub const slurm_err_t_ESLURM_JOB_NOT_PENDING_NOR_RUNNING: slurm_err_t = 2086;
pub const slurm_err_t_ESLURM_JOB_NOT_SUSPENDED: slurm_err_t = 2087;
pub const slurm_err_t_ESLURM_JOB_NOT_FINISHED: slurm_err_t = 2088;
pub const slurm_err_t_ESLURM_TRIGGER_DUP: slurm_err_t = 2089;
pub const slurm_err_t_ESLURM_INTERNAL: slurm_err_t = 2090;
pub const slurm_err_t_ESLURM_INVALID_BURST_BUFFER_CHANGE: slurm_err_t = 2091;
pub const slurm_err_t_ESLURM_BURST_BUFFER_PERMISSION: slurm_err_t = 2092;
pub const slurm_err_t_ESLURM_BURST_BUFFER_LIMIT: slurm_err_t = 2093;
pub const slurm_err_t_ESLURM_INVALID_BURST_BUFFER_REQUEST: slurm_err_t = 2094;
pub const slurm_err_t_ESLURM_PRIO_RESET_FAIL: slurm_err_t = 2095;
pub const slurm_err_t_ESLURM_CANNOT_MODIFY_CRON_JOB: slurm_err_t = 2096;
pub const slurm_err_t_ESLURM_INVALID_JOB_CONTAINER_CHANGE: slurm_err_t = 2097;
pub const slurm_err_t_ESLURM_CANNOT_CANCEL_CRON_JOB: slurm_err_t = 2098;
pub const slurm_err_t_ESLURM_INVALID_MCS_LABEL: slurm_err_t = 2099;
pub const slurm_err_t_ESLURM_BURST_BUFFER_WAIT: slurm_err_t = 2100;
pub const slurm_err_t_ESLURM_PARTITION_DOWN: slurm_err_t = 2101;
pub const slurm_err_t_ESLURM_DUPLICATE_GRES: slurm_err_t = 2102;
pub const slurm_err_t_ESLURM_RSV_ALREADY_STARTED: slurm_err_t = 2104;
pub const slurm_err_t_ESLURM_SUBMISSIONS_DISABLED: slurm_err_t = 2105;
pub const slurm_err_t_ESLURM_NOT_HET_JOB: slurm_err_t = 2106;
pub const slurm_err_t_ESLURM_NOT_HET_JOB_LEADER: slurm_err_t = 2107;
pub const slurm_err_t_ESLURM_NOT_WHOLE_HET_JOB: slurm_err_t = 2108;
pub const slurm_err_t_ESLURM_CORE_RESERVATION_UPDATE: slurm_err_t = 2109;
pub const slurm_err_t_ESLURM_DUPLICATE_STEP_ID: slurm_err_t = 2110;
pub const slurm_err_t_ESLURM_INVALID_CORE_CNT: slurm_err_t = 2111;
pub const slurm_err_t_ESLURM_X11_NOT_AVAIL: slurm_err_t = 2112;
pub const slurm_err_t_ESLURM_GROUP_ID_MISSING: slurm_err_t = 2113;
pub const slurm_err_t_ESLURM_BATCH_CONSTRAINT: slurm_err_t = 2114;
pub const slurm_err_t_ESLURM_INVALID_TRES: slurm_err_t = 2115;
pub const slurm_err_t_ESLURM_INVALID_TRES_BILLING_WEIGHTS: slurm_err_t = 2116;
pub const slurm_err_t_ESLURM_INVALID_JOB_DEFAULTS: slurm_err_t = 2117;
pub const slurm_err_t_ESLURM_RESERVATION_MAINT: slurm_err_t = 2118;
pub const slurm_err_t_ESLURM_INVALID_GRES_TYPE: slurm_err_t = 2119;
pub const slurm_err_t_ESLURM_REBOOT_IN_PROGRESS: slurm_err_t = 2120;
pub const slurm_err_t_ESLURM_MULTI_KNL_CONSTRAINT: slurm_err_t = 2121;
pub const slurm_err_t_ESLURM_UNSUPPORTED_GRES: slurm_err_t = 2122;
pub const slurm_err_t_ESLURM_INVALID_NICE: slurm_err_t = 2123;
pub const slurm_err_t_ESLURM_INVALID_TIME_MIN_LIMIT: slurm_err_t = 2124;
pub const slurm_err_t_ESLURM_DEFER: slurm_err_t = 2125;
pub const slurm_err_t_ESLURM_CONFIGLESS_DISABLED: slurm_err_t = 2126;
pub const slurm_err_t_ESLURM_ENVIRONMENT_MISSING: slurm_err_t = 2127;
pub const slurm_err_t_ESLURM_RESERVATION_NO_SKIP: slurm_err_t = 2128;
pub const slurm_err_t_ESLURM_RESERVATION_USER_GROUP: slurm_err_t = 2129;
pub const slurm_err_t_ESLURM_PARTITION_ASSOC: slurm_err_t = 2130;
pub const slurm_err_t_ESLURM_IN_STANDBY_USE_BACKUP: slurm_err_t = 2131;
pub const slurm_err_t_ESLURM_BAD_THREAD_PER_CORE: slurm_err_t = 2132;
pub const slurm_err_t_ESLURM_INVALID_PREFER: slurm_err_t = 2133;
pub const slurm_err_t_ESLURM_INSUFFICIENT_GRES: slurm_err_t = 2134;
pub const slurm_err_t_ESLURM_INVALID_CONTAINER_ID: slurm_err_t = 2135;
pub const slurm_err_t_ESLURM_EMPTY_JOB_ID: slurm_err_t = 2136;
pub const slurm_err_t_ESLURM_INVALID_JOB_ID_ZERO: slurm_err_t = 2137;
pub const slurm_err_t_ESLURM_INVALID_JOB_ID_NEGATIVE: slurm_err_t = 2138;
pub const slurm_err_t_ESLURM_INVALID_JOB_ID_TOO_LARGE: slurm_err_t = 2139;
pub const slurm_err_t_ESLURM_INVALID_JOB_ID_NON_NUMERIC: slurm_err_t = 2140;
pub const slurm_err_t_ESLURM_EMPTY_JOB_ARRAY_ID: slurm_err_t = 2141;
pub const slurm_err_t_ESLURM_INVALID_JOB_ARRAY_ID_NEGATIVE: slurm_err_t = 2142;
pub const slurm_err_t_ESLURM_INVALID_JOB_ARRAY_ID_TOO_LARGE: slurm_err_t = 2143;
pub const slurm_err_t_ESLURM_INVALID_JOB_ARRAY_ID_NON_NUMERIC: slurm_err_t = 2144;
pub const slurm_err_t_ESLURM_INVALID_HET_JOB_AND_ARRAY: slurm_err_t = 2145;
pub const slurm_err_t_ESLURM_EMPTY_HET_JOB_COMP: slurm_err_t = 2146;
pub const slurm_err_t_ESLURM_INVALID_HET_JOB_COMP_NEGATIVE: slurm_err_t = 2147;
pub const slurm_err_t_ESLURM_INVALID_HET_JOB_COMP_TOO_LARGE: slurm_err_t = 2148;
pub const slurm_err_t_ESLURM_INVALID_HET_JOB_COMP_NON_NUMERIC: slurm_err_t = 2149;
pub const slurm_err_t_ESLURM_EMPTY_STEP_ID: slurm_err_t = 2150;
pub const slurm_err_t_ESLURM_INVALID_STEP_ID_NEGATIVE: slurm_err_t = 2151;
pub const slurm_err_t_ESLURM_INVALID_STEP_ID_TOO_LARGE: slurm_err_t = 2152;
pub const slurm_err_t_ESLURM_INVALID_STEP_ID_NON_NUMERIC: slurm_err_t = 2153;
pub const slurm_err_t_ESLURM_EMPTY_HET_STEP: slurm_err_t = 2154;
pub const slurm_err_t_ESLURM_INVALID_HET_STEP_ZERO: slurm_err_t = 2155;
pub const slurm_err_t_ESLURM_INVALID_HET_STEP_NEGATIVE: slurm_err_t = 2156;
pub const slurm_err_t_ESLURM_INVALID_HET_STEP_TOO_LARGE: slurm_err_t = 2157;
pub const slurm_err_t_ESLURM_INVALID_HET_STEP_NON_NUMERIC: slurm_err_t = 2158;
pub const slurm_err_t_ESLURM_INVALID_HET_STEP_JOB: slurm_err_t = 2159;
pub const slurm_err_t_ESLURM_JOB_TIMEOUT_KILLED: slurm_err_t = 2160;
pub const slurm_err_t_ESLURM_JOB_NODE_FAIL_KILLED: slurm_err_t = 2161;
pub const slurm_err_t_ESLURM_EMPTY_LIST: slurm_err_t = 2162;
pub const slurm_err_t_ESLURM_GROUP_ID_INVALID: slurm_err_t = 2163;
pub const slurm_err_t_ESLURM_GROUP_ID_UNKNOWN: slurm_err_t = 2164;
pub const slurm_err_t_ESLURM_USER_ID_INVALID: slurm_err_t = 2165;
pub const slurm_err_t_ESLURM_USER_ID_UNKNOWN: slurm_err_t = 2166;
pub const slurm_err_t_ESLURM_INVALID_ASSOC: slurm_err_t = 2167;
pub const slurm_err_t_ESLURM_NODE_ALREADY_EXISTS: slurm_err_t = 2168;
pub const slurm_err_t_ESLURM_NODE_TABLE_FULL: slurm_err_t = 2169;
pub const slurm_err_t_ESLURM_INVALID_RELATIVE_QOS: slurm_err_t = 2170;
pub const slurm_err_t_ESLURM_INVALID_EXTRA: slurm_err_t = 2171;
pub const slurm_err_t_ESLURM_JOB_SIGNAL_FAILED: slurm_err_t = 2172;
pub const slurm_err_t_ESLURM_SIGNAL_JOBS_INVALID: slurm_err_t = 2173;
pub const slurm_err_t_ESLURM_RES_CORES_PER_GPU_UNIQUE: slurm_err_t = 2174;
pub const slurm_err_t_ESLURM_RES_CORES_PER_GPU_TOPO: slurm_err_t = 2175;
pub const slurm_err_t_ESLURM_RES_CORES_PER_GPU_NO: slurm_err_t = 2176;
pub const slurm_err_t_ESLURM_MAX_POWERED_NODES: slurm_err_t = 2177;
pub const slurm_err_t_ESLURM_REQUESTED_TOPO_CONFIG_UNAVAILABLE: slurm_err_t = 2178;
pub const slurm_err_t_ESLURM_PREEMPTION_REQUIRED: slurm_err_t = 2179;
pub const slurm_err_t_ESPANK_ERROR: slurm_err_t = 3000;
pub const slurm_err_t_ESPANK_BAD_ARG: slurm_err_t = 3001;
pub const slurm_err_t_ESPANK_NOT_TASK: slurm_err_t = 3002;
pub const slurm_err_t_ESPANK_ENV_EXISTS: slurm_err_t = 3003;
pub const slurm_err_t_ESPANK_ENV_NOEXIST: slurm_err_t = 3004;
pub const slurm_err_t_ESPANK_NOSPACE: slurm_err_t = 3005;
pub const slurm_err_t_ESPANK_NOT_REMOTE: slurm_err_t = 3006;
pub const slurm_err_t_ESPANK_NOEXIST: slurm_err_t = 3007;
pub const slurm_err_t_ESPANK_NOT_EXECD: slurm_err_t = 3008;
pub const slurm_err_t_ESPANK_NOT_AVAIL: slurm_err_t = 3009;
pub const slurm_err_t_ESPANK_NOT_LOCAL: slurm_err_t = 3010;
pub const slurm_err_t_ESLURMD_KILL_TASK_FAILED: slurm_err_t = 4001;
pub const slurm_err_t_ESLURMD_KILL_JOB_ALREADY_COMPLETE: slurm_err_t = 4002;
pub const slurm_err_t_ESLURMD_INVALID_ACCT_FREQ: slurm_err_t = 4003;
pub const slurm_err_t_ESLURMD_INVALID_JOB_CREDENTIAL: slurm_err_t = 4004;
pub const slurm_err_t_ESLURMD_CREDENTIAL_EXPIRED: slurm_err_t = 4007;
pub const slurm_err_t_ESLURMD_CREDENTIAL_REVOKED: slurm_err_t = 4008;
pub const slurm_err_t_ESLURMD_CREDENTIAL_REPLAYED: slurm_err_t = 4009;
pub const slurm_err_t_ESLURMD_CREATE_BATCH_DIR_ERROR: slurm_err_t = 4010;
pub const slurm_err_t_ESLURMD_SETUP_ENVIRONMENT_ERROR: slurm_err_t = 4014;
pub const slurm_err_t_ESLURMD_SET_UID_OR_GID_ERROR: slurm_err_t = 4016;
pub const slurm_err_t_ESLURMD_EXECVE_FAILED: slurm_err_t = 4020;
pub const slurm_err_t_ESLURMD_IO_ERROR: slurm_err_t = 4021;
pub const slurm_err_t_ESLURMD_PROLOG_FAILED: slurm_err_t = 4022;
pub const slurm_err_t_ESLURMD_EPILOG_FAILED: slurm_err_t = 4023;
pub const slurm_err_t_ESLURMD_TOOMANYSTEPS: slurm_err_t = 4025;
pub const slurm_err_t_ESLURMD_STEP_EXISTS: slurm_err_t = 4026;
pub const slurm_err_t_ESLURMD_JOB_NOTRUNNING: slurm_err_t = 4027;
pub const slurm_err_t_ESLURMD_STEP_SUSPENDED: slurm_err_t = 4028;
pub const slurm_err_t_ESLURMD_STEP_NOTSUSPENDED: slurm_err_t = 4029;
pub const slurm_err_t_ESLURMD_INVALID_SOCKET_NAME_LEN: slurm_err_t = 4030;
pub const slurm_err_t_ESLURMD_CONTAINER_RUNTIME_INVALID: slurm_err_t = 4031;
pub const slurm_err_t_ESLURMD_CPU_BIND_ERROR: slurm_err_t = 4032;
pub const slurm_err_t_ESLURMD_CPU_LAYOUT_ERROR: slurm_err_t = 4033;
pub const slurm_err_t_ESLURMD_TOO_MANY_RPCS: slurm_err_t = 4034;
pub const slurm_err_t_ESLURM_PROTOCOL_INCOMPLETE_PACKET: slurm_err_t = 5003;
pub const slurm_err_t_SLURM_PROTOCOL_SOCKET_IMPL_TIMEOUT: slurm_err_t = 5004;
pub const slurm_err_t_SLURM_PROTOCOL_SOCKET_ZERO_BYTES_SENT: slurm_err_t = 5005;
pub const slurm_err_t_ESLURM_AUTH_CRED_INVALID: slurm_err_t = 6000;
pub const slurm_err_t_ESLURM_AUTH_EXPIRED: slurm_err_t = 6001;
pub const slurm_err_t_ESLURM_AUTH_BADARG: slurm_err_t = 6004;
pub const slurm_err_t_ESLURM_AUTH_UNPACK: slurm_err_t = 6007;
pub const slurm_err_t_ESLURM_AUTH_SKIP: slurm_err_t = 6008;
pub const slurm_err_t_ESLURM_AUTH_UNABLE_TO_GENERATE_TOKEN: slurm_err_t = 6009;
pub const slurm_err_t_ESLURM_DB_CONNECTION: slurm_err_t = 7000;
pub const slurm_err_t_ESLURM_JOBS_RUNNING_ON_ASSOC: slurm_err_t = 7001;
pub const slurm_err_t_ESLURM_CLUSTER_DELETED: slurm_err_t = 7002;
pub const slurm_err_t_ESLURM_ONE_CHANGE: slurm_err_t = 7003;
pub const slurm_err_t_ESLURM_BAD_NAME: slurm_err_t = 7004;
pub const slurm_err_t_ESLURM_OVER_ALLOCATE: slurm_err_t = 7005;
pub const slurm_err_t_ESLURM_RESULT_TOO_LARGE: slurm_err_t = 7006;
pub const slurm_err_t_ESLURM_DB_QUERY_TOO_WIDE: slurm_err_t = 7007;
pub const slurm_err_t_ESLURM_DB_CONNECTION_INVALID: slurm_err_t = 7008;
pub const slurm_err_t_ESLURM_NO_REMOVE_DEFAULT_ACCOUNT: slurm_err_t = 7009;
pub const slurm_err_t_ESLURM_BAD_SQL: slurm_err_t = 7010;
pub const slurm_err_t_ESLURM_NO_REMOVE_DEFAULT_QOS: slurm_err_t = 7011;
pub const slurm_err_t_ESLURM_COORD_NO_INCREASE_JOB_LIMIT: slurm_err_t = 7012;
pub const slurm_err_t_ESLURM_FED_CLUSTER_MAX_CNT: slurm_err_t = 7100;
pub const slurm_err_t_ESLURM_FED_CLUSTER_MULTIPLE_ASSIGNMENT: slurm_err_t = 7101;
pub const slurm_err_t_ESLURM_INVALID_CLUSTER_FEATURE: slurm_err_t = 7102;
pub const slurm_err_t_ESLURM_JOB_NOT_FEDERATED: slurm_err_t = 7103;
pub const slurm_err_t_ESLURM_INVALID_CLUSTER_NAME: slurm_err_t = 7104;
pub const slurm_err_t_ESLURM_FED_JOB_LOCK: slurm_err_t = 7105;
pub const slurm_err_t_ESLURM_FED_NO_VALID_CLUSTERS: slurm_err_t = 7106;
pub const slurm_err_t_ESLURM_MISSING_TIME_LIMIT: slurm_err_t = 8000;
pub const slurm_err_t_ESLURM_INVALID_KNL: slurm_err_t = 8001;
pub const slurm_err_t_ESLURM_PLUGIN_INVALID: slurm_err_t = 8002;
pub const slurm_err_t_ESLURM_PLUGIN_INCOMPLETE: slurm_err_t = 8003;
pub const slurm_err_t_ESLURM_PLUGIN_NOT_LOADED: slurm_err_t = 8004;
pub const slurm_err_t_ESLURM_PLUGIN_NOTFOUND: slurm_err_t = 8005;
pub const slurm_err_t_ESLURM_PLUGIN_ACCESS_ERROR: slurm_err_t = 8006;
pub const slurm_err_t_ESLURM_PLUGIN_DLOPEN_FAILED: slurm_err_t = 8007;
pub const slurm_err_t_ESLURM_PLUGIN_INIT_FAILED: slurm_err_t = 8008;
pub const slurm_err_t_ESLURM_PLUGIN_MISSING_NAME: slurm_err_t = 8009;
pub const slurm_err_t_ESLURM_PLUGIN_BAD_VERSION: slurm_err_t = 8010;
pub const slurm_err_t_ESLURM_REST_INVALID_QUERY: slurm_err_t = 9000;
pub const slurm_err_t_ESLURM_REST_FAIL_PARSING: slurm_err_t = 9001;
pub const slurm_err_t_ESLURM_REST_INVALID_JOBS_DESC: slurm_err_t = 9002;
pub const slurm_err_t_ESLURM_REST_EMPTY_RESULT: slurm_err_t = 9003;
pub const slurm_err_t_ESLURM_REST_MISSING_UID: slurm_err_t = 9004;
pub const slurm_err_t_ESLURM_REST_MISSING_GID: slurm_err_t = 9005;
pub const slurm_err_t_ESLURM_DATA_PATH_NOT_FOUND: slurm_err_t = 9200;
pub const slurm_err_t_ESLURM_DATA_PTR_NULL: slurm_err_t = 9201;
pub const slurm_err_t_ESLURM_DATA_CONV_FAILED: slurm_err_t = 9202;
pub const slurm_err_t_ESLURM_DATA_REGEX_COMPILE: slurm_err_t = 9203;
pub const slurm_err_t_ESLURM_DATA_UNKNOWN_MIME_TYPE: slurm_err_t = 9204;
pub const slurm_err_t_ESLURM_DATA_TOO_LARGE: slurm_err_t = 9205;
pub const slurm_err_t_ESLURM_DATA_FLAGS_INVALID_TYPE: slurm_err_t = 9206;
pub const slurm_err_t_ESLURM_DATA_FLAGS_INVALID: slurm_err_t = 9207;
pub const slurm_err_t_ESLURM_DATA_EXPECTED_LIST: slurm_err_t = 9208;
pub const slurm_err_t_ESLURM_DATA_EXPECTED_DICT: slurm_err_t = 9209;
pub const slurm_err_t_ESLURM_DATA_AMBIGUOUS_MODIFY: slurm_err_t = 9210;
pub const slurm_err_t_ESLURM_DATA_AMBIGUOUS_QUERY: slurm_err_t = 9211;
pub const slurm_err_t_ESLURM_DATA_PARSE_NOTHING: slurm_err_t = 9212;
pub const slurm_err_t_ESLURM_DATA_INVALID_PARSER: slurm_err_t = 9213;
pub const slurm_err_t_ESLURM_DATA_PARSING_DEPTH: slurm_err_t = 9214;
pub const slurm_err_t_ESLURM_DATA_PARSER_INVALID_STATE: slurm_err_t = 9215;
pub const slurm_err_t_ESLURM_CONTAINER_NOT_CONFIGURED: slurm_err_t = 10000;
pub type slurm_err_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_errtab_t {
    pub xe_number: ::std::os::raw::c_int,
    pub xe_name: *mut ::std::os::raw::c_char,
    pub xe_message: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_errtab_t"][::std::mem::size_of::<slurm_errtab_t>() - 24usize];
    ["Alignment of slurm_errtab_t"][::std::mem::align_of::<slurm_errtab_t>() - 8usize];
    ["Offset of field: slurm_errtab_t::xe_number"]
        [::std::mem::offset_of!(slurm_errtab_t, xe_number) - 0usize];
    ["Offset of field: slurm_errtab_t::xe_name"]
        [::std::mem::offset_of!(slurm_errtab_t, xe_name) - 8usize];
    ["Offset of field: slurm_errtab_t::xe_message"]
        [::std::mem::offset_of!(slurm_errtab_t, xe_message) - 16usize];
};
unsafe extern "C" {
    pub static mut slurm_errtab: [slurm_errtab_t; 0usize];
}
unsafe extern "C" {
    pub static mut slurm_errtab_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn slurm_strerror(errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn slurm_seterrno(errnum: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn slurm_perror(msg: *const ::std::os::raw::c_char);
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __glibc_unused___g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_1"]
        [::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_1"]
        [::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>() - 8usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_1, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1::__wseq32"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_1, __wseq32) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_2"]
        [::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_2"]
        [::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>() - 8usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_2, __g1_start) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2::__g1_start32"]
        [::std::mem::offset_of!(__pthread_cond_s__bindgen_ty_2, __g1_start32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__glibc_unused___g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __glibc_unused___g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_storage"][::std::mem::size_of::<sockaddr_storage>() - 128usize];
    ["Alignment of sockaddr_storage"][::std::mem::align_of::<sockaddr_storage>() - 8usize];
    ["Offset of field: sockaddr_storage::ss_family"]
        [::std::mem::offset_of!(sockaddr_storage, ss_family) - 0usize];
    ["Offset of field: sockaddr_storage::__ss_padding"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_padding) - 2usize];
    ["Offset of field: sockaddr_storage::__ss_align"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_align) - 120usize];
};
pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_BATCH: _bindgen_ty_1 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_1 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msghdr"][::std::mem::size_of::<msghdr>() - 56usize];
    ["Alignment of msghdr"][::std::mem::align_of::<msghdr>() - 8usize];
    ["Offset of field: msghdr::msg_name"][::std::mem::offset_of!(msghdr, msg_name) - 0usize];
    ["Offset of field: msghdr::msg_namelen"][::std::mem::offset_of!(msghdr, msg_namelen) - 8usize];
    ["Offset of field: msghdr::msg_iov"][::std::mem::offset_of!(msghdr, msg_iov) - 16usize];
    ["Offset of field: msghdr::msg_iovlen"][::std::mem::offset_of!(msghdr, msg_iovlen) - 24usize];
    ["Offset of field: msghdr::msg_control"][::std::mem::offset_of!(msghdr, msg_control) - 32usize];
    ["Offset of field: msghdr::msg_controllen"]
        [::std::mem::offset_of!(msghdr, msg_controllen) - 40usize];
    ["Offset of field: msghdr::msg_flags"][::std::mem::offset_of!(msghdr, msg_flags) - 48usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cmsghdr"][::std::mem::size_of::<cmsghdr>() - 16usize];
    ["Alignment of cmsghdr"][::std::mem::align_of::<cmsghdr>() - 8usize];
    ["Offset of field: cmsghdr::cmsg_len"][::std::mem::offset_of!(cmsghdr, cmsg_len) - 0usize];
    ["Offset of field: cmsghdr::cmsg_level"][::std::mem::offset_of!(cmsghdr, cmsg_level) - 8usize];
    ["Offset of field: cmsghdr::cmsg_type"][::std::mem::offset_of!(cmsghdr, cmsg_type) - 12usize];
    ["Offset of field: cmsghdr::__cmsg_data"]
        [::std::mem::offset_of!(cmsghdr, __cmsg_data) - 16usize];
};
unsafe extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of linger"][::std::mem::size_of::<linger>() - 8usize];
    ["Alignment of linger"][::std::mem::align_of::<linger>() - 4usize];
    ["Offset of field: linger::l_onoff"][::std::mem::offset_of!(linger, l_onoff) - 0usize];
    ["Offset of field: linger::l_linger"][::std::mem::offset_of!(linger, l_linger) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osockaddr"][::std::mem::size_of::<osockaddr>() - 16usize];
    ["Alignment of osockaddr"][::std::mem::align_of::<osockaddr>() - 2usize];
    ["Offset of field: osockaddr::sa_family"]
        [::std::mem::offset_of!(osockaddr, sa_family) - 0usize];
    ["Offset of field: osockaddr::sa_data"][::std::mem::offset_of!(osockaddr, sa_data) - 2usize];
};
pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_opts"][::std::mem::size_of::<ip_opts>() - 44usize];
    ["Alignment of ip_opts"][::std::mem::align_of::<ip_opts>() - 4usize];
    ["Offset of field: ip_opts::ip_dst"][::std::mem::offset_of!(ip_opts, ip_dst) - 0usize];
    ["Offset of field: ip_opts::ip_opts"][::std::mem::offset_of!(ip_opts, ip_opts) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreqn"][::std::mem::size_of::<ip_mreqn>() - 12usize];
    ["Alignment of ip_mreqn"][::std::mem::align_of::<ip_mreqn>() - 4usize];
    ["Offset of field: ip_mreqn::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreqn, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreqn::imr_address"]
        [::std::mem::offset_of!(ip_mreqn, imr_address) - 4usize];
    ["Offset of field: ip_mreqn::imr_ifindex"]
        [::std::mem::offset_of!(ip_mreqn, imr_ifindex) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_pktinfo"][::std::mem::size_of::<in_pktinfo>() - 12usize];
    ["Alignment of in_pktinfo"][::std::mem::align_of::<in_pktinfo>() - 4usize];
    ["Offset of field: in_pktinfo::ipi_ifindex"]
        [::std::mem::offset_of!(in_pktinfo, ipi_ifindex) - 0usize];
    ["Offset of field: in_pktinfo::ipi_spec_dst"]
        [::std::mem::offset_of!(in_pktinfo, ipi_spec_dst) - 4usize];
    ["Offset of field: in_pktinfo::ipi_addr"]
        [::std::mem::offset_of!(in_pktinfo, ipi_addr) - 8usize];
};
pub const IPPROTO_IP: _bindgen_ty_4 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_4 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_4 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_4 = 4;
pub const IPPROTO_TCP: _bindgen_ty_4 = 6;
pub const IPPROTO_EGP: _bindgen_ty_4 = 8;
pub const IPPROTO_PUP: _bindgen_ty_4 = 12;
pub const IPPROTO_UDP: _bindgen_ty_4 = 17;
pub const IPPROTO_IDP: _bindgen_ty_4 = 22;
pub const IPPROTO_TP: _bindgen_ty_4 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_4 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_4 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_4 = 46;
pub const IPPROTO_GRE: _bindgen_ty_4 = 47;
pub const IPPROTO_ESP: _bindgen_ty_4 = 50;
pub const IPPROTO_AH: _bindgen_ty_4 = 51;
pub const IPPROTO_MTP: _bindgen_ty_4 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_4 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_4 = 98;
pub const IPPROTO_PIM: _bindgen_ty_4 = 103;
pub const IPPROTO_COMP: _bindgen_ty_4 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_4 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_4 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_4 = 137;
pub const IPPROTO_ETHERNET: _bindgen_ty_4 = 143;
pub const IPPROTO_RAW: _bindgen_ty_4 = 255;
pub const IPPROTO_MPTCP: _bindgen_ty_4 = 262;
pub const IPPROTO_MAX: _bindgen_ty_4 = 263;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_5 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_5 = 58;
pub const IPPROTO_NONE: _bindgen_ty_5 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = 60;
pub const IPPROTO_MH: _bindgen_ty_5 = 135;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub type in_port_t = u16;
pub const IPPORT_ECHO: _bindgen_ty_6 = 7;
pub const IPPORT_DISCARD: _bindgen_ty_6 = 9;
pub const IPPORT_SYSTAT: _bindgen_ty_6 = 11;
pub const IPPORT_DAYTIME: _bindgen_ty_6 = 13;
pub const IPPORT_NETSTAT: _bindgen_ty_6 = 15;
pub const IPPORT_FTP: _bindgen_ty_6 = 21;
pub const IPPORT_TELNET: _bindgen_ty_6 = 23;
pub const IPPORT_SMTP: _bindgen_ty_6 = 25;
pub const IPPORT_TIMESERVER: _bindgen_ty_6 = 37;
pub const IPPORT_NAMESERVER: _bindgen_ty_6 = 42;
pub const IPPORT_WHOIS: _bindgen_ty_6 = 43;
pub const IPPORT_MTP: _bindgen_ty_6 = 57;
pub const IPPORT_TFTP: _bindgen_ty_6 = 69;
pub const IPPORT_RJE: _bindgen_ty_6 = 77;
pub const IPPORT_FINGER: _bindgen_ty_6 = 79;
pub const IPPORT_TTYLINK: _bindgen_ty_6 = 87;
pub const IPPORT_SUPDUP: _bindgen_ty_6 = 95;
pub const IPPORT_EXECSERVER: _bindgen_ty_6 = 512;
pub const IPPORT_LOGINSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_CMDSERVER: _bindgen_ty_6 = 514;
pub const IPPORT_EFSSERVER: _bindgen_ty_6 = 520;
pub const IPPORT_BIFFUDP: _bindgen_ty_6 = 512;
pub const IPPORT_WHOSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_ROUTESERVER: _bindgen_ty_6 = 520;
pub const IPPORT_RESERVED: _bindgen_ty_6 = 1024;
pub const IPPORT_USERRESERVED: _bindgen_ty_6 = 5000;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__in6_u"][::std::mem::offset_of!(in6_addr, __in6_u) - 0usize];
};
unsafe extern "C" {
    pub static in6addr_any: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
    ["Alignment of sockaddr_in"][::std::mem::align_of::<sockaddr_in>() - 4usize];
    ["Offset of field: sockaddr_in::sin_family"]
        [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
    ["Offset of field: sockaddr_in::sin_port"]
        [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
    ["Offset of field: sockaddr_in::sin_addr"]
        [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
    ["Offset of field: sockaddr_in::sin_zero"]
        [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in6"][::std::mem::size_of::<sockaddr_in6>() - 28usize];
    ["Alignment of sockaddr_in6"][::std::mem::align_of::<sockaddr_in6>() - 4usize];
    ["Offset of field: sockaddr_in6::sin6_family"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_family) - 0usize];
    ["Offset of field: sockaddr_in6::sin6_port"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_port) - 2usize];
    ["Offset of field: sockaddr_in6::sin6_flowinfo"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_flowinfo) - 4usize];
    ["Offset of field: sockaddr_in6::sin6_addr"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_addr) - 8usize];
    ["Offset of field: sockaddr_in6::sin6_scope_id"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_scope_id) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq"][::std::mem::size_of::<ip_mreq>() - 8usize];
    ["Alignment of ip_mreq"][::std::mem::align_of::<ip_mreq>() - 4usize];
    ["Offset of field: ip_mreq::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq::imr_interface"]
        [::std::mem::offset_of!(ip_mreq, imr_interface) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq_source"][::std::mem::size_of::<ip_mreq_source>() - 12usize];
    ["Alignment of ip_mreq_source"][::std::mem::align_of::<ip_mreq_source>() - 4usize];
    ["Offset of field: ip_mreq_source::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq_source::imr_interface"]
        [::std::mem::offset_of!(ip_mreq_source, imr_interface) - 4usize];
    ["Offset of field: ip_mreq_source::imr_sourceaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_sourceaddr) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipv6_mreq"][::std::mem::size_of::<ipv6_mreq>() - 20usize];
    ["Alignment of ipv6_mreq"][::std::mem::align_of::<ipv6_mreq>() - 4usize];
    ["Offset of field: ipv6_mreq::ipv6mr_multiaddr"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_multiaddr) - 0usize];
    ["Offset of field: ipv6_mreq::ipv6mr_interface"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_interface) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_req"][::std::mem::size_of::<group_req>() - 136usize];
    ["Alignment of group_req"][::std::mem::align_of::<group_req>() - 8usize];
    ["Offset of field: group_req::gr_interface"]
        [::std::mem::offset_of!(group_req, gr_interface) - 0usize];
    ["Offset of field: group_req::gr_group"][::std::mem::offset_of!(group_req, gr_group) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_source_req"][::std::mem::size_of::<group_source_req>() - 264usize];
    ["Alignment of group_source_req"][::std::mem::align_of::<group_source_req>() - 8usize];
    ["Offset of field: group_source_req::gsr_interface"]
        [::std::mem::offset_of!(group_source_req, gsr_interface) - 0usize];
    ["Offset of field: group_source_req::gsr_group"]
        [::std::mem::offset_of!(group_source_req, gsr_group) - 8usize];
    ["Offset of field: group_source_req::gsr_source"]
        [::std::mem::offset_of!(group_source_req, gsr_source) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_msfilter"][::std::mem::size_of::<ip_msfilter>() - 20usize];
    ["Alignment of ip_msfilter"][::std::mem::align_of::<ip_msfilter>() - 4usize];
    ["Offset of field: ip_msfilter::imsf_multiaddr"]
        [::std::mem::offset_of!(ip_msfilter, imsf_multiaddr) - 0usize];
    ["Offset of field: ip_msfilter::imsf_interface"]
        [::std::mem::offset_of!(ip_msfilter, imsf_interface) - 4usize];
    ["Offset of field: ip_msfilter::imsf_fmode"]
        [::std::mem::offset_of!(ip_msfilter, imsf_fmode) - 8usize];
    ["Offset of field: ip_msfilter::imsf_numsrc"]
        [::std::mem::offset_of!(ip_msfilter, imsf_numsrc) - 12usize];
    ["Offset of field: ip_msfilter::imsf_slist"]
        [::std::mem::offset_of!(ip_msfilter, imsf_slist) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_filter"][::std::mem::size_of::<group_filter>() - 272usize];
    ["Alignment of group_filter"][::std::mem::align_of::<group_filter>() - 8usize];
    ["Offset of field: group_filter::gf_interface"]
        [::std::mem::offset_of!(group_filter, gf_interface) - 0usize];
    ["Offset of field: group_filter::gf_group"]
        [::std::mem::offset_of!(group_filter, gf_group) - 8usize];
    ["Offset of field: group_filter::gf_fmode"]
        [::std::mem::offset_of!(group_filter, gf_fmode) - 136usize];
    ["Offset of field: group_filter::gf_numsrc"]
        [::std::mem::offset_of!(group_filter, gf_numsrc) - 140usize];
    ["Offset of field: group_filter::gf_slist"]
        [::std::mem::offset_of!(group_filter, gf_slist) - 144usize];
};
unsafe extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type va_list = __gnuc_va_list;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
    -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn stime(__when: *const time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type useconds_t = __useconds_t;
unsafe extern "C" {
    pub fn access(
        __name: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn faccessat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lseek(
        __fd: ::std::os::raw::c_int,
        __offset: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> __off_t;
}
unsafe extern "C" {
    pub fn close(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn read(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn write(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pread(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pwrite(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pipe(__pipedes: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn alarm(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn sleep(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
unsafe extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pause() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn chown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fchown(
        __fd: ::std::os::raw::c_int,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lchown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fchownat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn chdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fchdir(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getcwd(__buf: *mut ::std::os::raw::c_char, __size: usize)
    -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getwd(__buf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn dup(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dup2(__fd: ::std::os::raw::c_int, __fd2: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __environ: *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn execve(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fexecve(
        __fd: ::std::os::raw::c_int,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execv(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execle(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execl(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execvp(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execlp(
        __file: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nice(__inc: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _exit(__status: ::std::os::raw::c_int) -> !;
}
pub const _PC_LINK_MAX: _bindgen_ty_7 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_7 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_7 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_7 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_7 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_7 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_7 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_7 = 7;
pub const _PC_VDISABLE: _bindgen_ty_7 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_7 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_7 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_7 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_7 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_7 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_7 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_7 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_7 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_7 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_7 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_7 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_7 = 20;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const _SC_ARG_MAX: _bindgen_ty_8 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_8 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_8 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_8 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_8 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_8 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_8 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_8 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_8 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_8 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_8 = 10;
pub const _SC_TIMERS: _bindgen_ty_8 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_8 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_8 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_8 = 14;
pub const _SC_FSYNC: _bindgen_ty_8 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_8 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_8 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_8 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_8 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_8 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_8 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_8 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_8 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_8 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_8 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_8 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_8 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_8 = 28;
pub const _SC_VERSION: _bindgen_ty_8 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_8 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_8 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_8 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_8 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_8 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_8 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_8 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_8 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_8 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_8 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_8 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_8 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_8 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_8 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_8 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_8 = 45;
pub const _SC_2_VERSION: _bindgen_ty_8 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_8 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_8 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_8 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_8 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_8 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_8 = 52;
pub const _SC_PII: _bindgen_ty_8 = 53;
pub const _SC_PII_XTI: _bindgen_ty_8 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_8 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_8 = 56;
pub const _SC_PII_OSI: _bindgen_ty_8 = 57;
pub const _SC_POLL: _bindgen_ty_8 = 58;
pub const _SC_SELECT: _bindgen_ty_8 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_8 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_8 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_8 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_8 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_8 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_8 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_8 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_8 = 66;
pub const _SC_THREADS: _bindgen_ty_8 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_8 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_8 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_8 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_8 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_8 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_8 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_8 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_8 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_8 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_8 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_8 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_8 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_8 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_8 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_8 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_8 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_8 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_8 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_8 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_8 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_8 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_8 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_8 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_8 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_8 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_8 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_8 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_8 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_8 = 96;
pub const _SC_2_UPE: _bindgen_ty_8 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_8 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_8 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_8 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_8 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_8 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_8 = 103;
pub const _SC_INT_MAX: _bindgen_ty_8 = 104;
pub const _SC_INT_MIN: _bindgen_ty_8 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_8 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_8 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_8 = 108;
pub const _SC_NZERO: _bindgen_ty_8 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_8 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_8 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_8 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_8 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_8 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_8 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_8 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_8 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_8 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_8 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_8 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_8 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_8 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_8 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_8 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_8 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_8 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_8 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_8 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_8 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_8 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_8 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_8 = 132;
pub const _SC_BARRIERS: _bindgen_ty_8 = 133;
pub const _SC_BASE: _bindgen_ty_8 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_8 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_8 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_8 = 137;
pub const _SC_CPUTIME: _bindgen_ty_8 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_8 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_8 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_8 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_8 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_8 = 143;
pub const _SC_FIFO: _bindgen_ty_8 = 144;
pub const _SC_PIPE: _bindgen_ty_8 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_8 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_8 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_8 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_8 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_8 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_8 = 151;
pub const _SC_NETWORKING: _bindgen_ty_8 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_8 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_8 = 154;
pub const _SC_REGEXP: _bindgen_ty_8 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_8 = 156;
pub const _SC_SHELL: _bindgen_ty_8 = 157;
pub const _SC_SIGNALS: _bindgen_ty_8 = 158;
pub const _SC_SPAWN: _bindgen_ty_8 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_8 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_8 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_8 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_8 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_8 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_8 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_8 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_8 = 167;
pub const _SC_2_PBS: _bindgen_ty_8 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_8 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_8 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_8 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_8 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_8 = 173;
pub const _SC_STREAMS: _bindgen_ty_8 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_8 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_8 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_8 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_8 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_8 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_8 = 180;
pub const _SC_TRACE: _bindgen_ty_8 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_8 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_8 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_8 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_8 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_8 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_8 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_8 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_8 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_8 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_8 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_8 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_8 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_8 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_8 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_8 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_8 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_8 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_8 = 199;
pub const _SC_IPV6: _bindgen_ty_8 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_8 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_8 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_8 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_8 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_8 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_8 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_8 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_8 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_8 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_8 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_8 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_8 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_8 = 248;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const _CS_PATH: _bindgen_ty_9 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_9 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_9 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_9 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_9 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_9 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_9 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_9 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_9 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_9 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_9 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_9 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_9 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_9 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_9 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_9 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_9 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_9 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_9 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_9 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_9 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_9 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_9 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_9 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_9 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_9 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_9 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_9 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_9 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_9 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_9 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_9 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_9 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_9 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_9 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_9 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_9 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_9 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_9 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_9 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_9 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_9 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_9 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_9 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_9 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_9 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_9 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_9 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_9 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_9 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_9 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_9 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_9 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_9 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_9 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_9 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_9 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_9 = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_9 = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_9 = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_9 = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_9 = 1147;
pub const _CS_V6_ENV: _bindgen_ty_9 = 1148;
pub const _CS_V7_ENV: _bindgen_ty_9 = 1149;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn pathconf(
        __path: *const ::std::os::raw::c_char,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn fpathconf(
        __fd: ::std::os::raw::c_int,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn sysconf(__name: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn confstr(
        __name: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn getpid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getppid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getpgrp() -> __pid_t;
}
unsafe extern "C" {
    pub fn __getpgid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn getpgid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setpgrp() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getsid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn getuid() -> __uid_t;
}
unsafe extern "C" {
    pub fn geteuid() -> __uid_t;
}
unsafe extern "C" {
    pub fn getgid() -> __gid_t;
}
unsafe extern "C" {
    pub fn getegid() -> __gid_t;
}
unsafe extern "C" {
    pub fn getgroups(__size: ::std::os::raw::c_int, __list: *mut __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setreuid(__ruid: __uid_t, __euid: __uid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seteuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setgid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setregid(__rgid: __gid_t, __egid: __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setegid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fork() -> __pid_t;
}
unsafe extern "C" {
    pub fn vfork() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ttyname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ttyname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isatty(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn link(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn linkat(
        __fromfd: ::std::os::raw::c_int,
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn symlink(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn readlink(
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn symlinkat(
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn readlinkat(
        __fd: ::std::os::raw::c_int,
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn unlink(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unlinkat(
        __fd: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rmdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tcgetpgrp(__fd: ::std::os::raw::c_int) -> __pid_t;
}
unsafe extern "C" {
    pub fn tcsetpgrp(__fd: ::std::os::raw::c_int, __pgrp_id: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getlogin_r(
        __name: *mut ::std::os::raw::c_char,
        __name_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setlogin(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getopt(
        ___argc: ::std::os::raw::c_int,
        ___argv: *const *mut ::std::os::raw::c_char,
        __shortopts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gethostname(__name: *mut ::std::os::raw::c_char, __len: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sethostname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sethostid(__id: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdomainname(
        __name: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setdomainname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vhangup() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn revoke(__file: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn profil(
        __sample_buffer: *mut ::std::os::raw::c_ushort,
        __size: usize,
        __offset: usize,
        __scale: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acct(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getusershell() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn endusershell();
}
unsafe extern "C" {
    pub fn setusershell();
}
unsafe extern "C" {
    pub fn daemon(
        __nochdir: ::std::os::raw::c_int,
        __noclose: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn chroot(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpass(__prompt: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fsync(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn sync();
}
unsafe extern "C" {
    pub fn getpagesize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdtablesize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn truncate(
        __file: *const ::std::os::raw::c_char,
        __length: __off_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftruncate(__fd: ::std::os::raw::c_int, __length: __off_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn brk(__addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sbrk(__delta: isize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn syscall(__sysno: ::std::os::raw::c_long, ...) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lockf(
        __fd: ::std::os::raw::c_int,
        __cmd: ::std::os::raw::c_int,
        __len: __off_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fdatasync(__fildes: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn crypt(
        __key: *const ::std::os::raw::c_char,
        __salt: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getentropy(
        __buffer: *mut ::std::os::raw::c_void,
        __length: usize,
    ) -> ::std::os::raw::c_int;
}
pub type sluid_t = u64;
pub type slurm_addr_t = sockaddr_storage;
pub type slurmdb_cluster_rec_t = slurmdb_cluster_rec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_resources {
    _unused: [u8; 0],
}
pub type job_resources_t = job_resources;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct select_jobinfo {
    _unused: [u8; 0],
}
pub type select_jobinfo_t = select_jobinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct select_nodeinfo {
    _unused: [u8; 0],
}
pub type select_nodeinfo_t = select_nodeinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jobacctinfo {
    _unused: [u8; 0],
}
pub type jobacctinfo_t = jobacctinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct allocation_msg_thread {
    _unused: [u8; 0],
}
pub type allocation_msg_thread_t = allocation_msg_thread;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sbcast_cred {
    _unused: [u8; 0],
}
pub type sbcast_cred_t = sbcast_cred;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_hash_t {
    pub type_: ::std::os::raw::c_uchar,
    pub hash: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_hash_t"][::std::mem::size_of::<slurm_hash_t>() - 33usize];
    ["Alignment of slurm_hash_t"][::std::mem::align_of::<slurm_hash_t>() - 1usize];
    ["Offset of field: slurm_hash_t::type_"][::std::mem::offset_of!(slurm_hash_t, type_) - 0usize];
    ["Offset of field: slurm_hash_t::hash"][::std::mem::offset_of!(slurm_hash_t, hash) - 1usize];
};
pub const job_states_JOB_PENDING: job_states = 0;
pub const job_states_JOB_RUNNING: job_states = 1;
pub const job_states_JOB_SUSPENDED: job_states = 2;
pub const job_states_JOB_COMPLETE: job_states = 3;
pub const job_states_JOB_CANCELLED: job_states = 4;
pub const job_states_JOB_FAILED: job_states = 5;
pub const job_states_JOB_TIMEOUT: job_states = 6;
pub const job_states_JOB_NODE_FAIL: job_states = 7;
pub const job_states_JOB_PREEMPTED: job_states = 8;
pub const job_states_JOB_BOOT_FAIL: job_states = 9;
pub const job_states_JOB_DEADLINE: job_states = 10;
pub const job_states_JOB_OOM: job_states = 11;
pub const job_states_JOB_END: job_states = 12;
pub type job_states = ::std::os::raw::c_uint;
pub const job_state_reason_WAIT_NO_REASON: job_state_reason = 0;
pub const job_state_reason_WAIT_PRIORITY: job_state_reason = 1;
pub const job_state_reason_WAIT_DEPENDENCY: job_state_reason = 2;
pub const job_state_reason_WAIT_RESOURCES: job_state_reason = 3;
pub const job_state_reason_WAIT_PART_NODE_LIMIT: job_state_reason = 4;
pub const job_state_reason_WAIT_PART_TIME_LIMIT: job_state_reason = 5;
pub const job_state_reason_WAIT_PART_DOWN: job_state_reason = 6;
pub const job_state_reason_WAIT_PART_INACTIVE: job_state_reason = 7;
pub const job_state_reason_WAIT_HELD: job_state_reason = 8;
pub const job_state_reason_WAIT_TIME: job_state_reason = 9;
pub const job_state_reason_WAIT_LICENSES: job_state_reason = 10;
pub const job_state_reason_WAIT_ASSOC_JOB_LIMIT: job_state_reason = 11;
pub const job_state_reason_WAIT_ASSOC_RESOURCE_LIMIT: job_state_reason = 12;
pub const job_state_reason_WAIT_ASSOC_TIME_LIMIT: job_state_reason = 13;
pub const job_state_reason_WAIT_RESERVATION: job_state_reason = 14;
pub const job_state_reason_WAIT_NODE_NOT_AVAIL: job_state_reason = 15;
pub const job_state_reason_WAIT_HELD_USER: job_state_reason = 16;
pub const job_state_reason_WAIT_FRONT_END: job_state_reason = 17;
pub const job_state_reason_FAIL_DEFER: job_state_reason = 18;
pub const job_state_reason_FAIL_DOWN_PARTITION: job_state_reason = 19;
pub const job_state_reason_FAIL_DOWN_NODE: job_state_reason = 20;
pub const job_state_reason_FAIL_BAD_CONSTRAINTS: job_state_reason = 21;
pub const job_state_reason_FAIL_SYSTEM: job_state_reason = 22;
pub const job_state_reason_FAIL_LAUNCH: job_state_reason = 23;
pub const job_state_reason_FAIL_EXIT_CODE: job_state_reason = 24;
pub const job_state_reason_FAIL_TIMEOUT: job_state_reason = 25;
pub const job_state_reason_FAIL_INACTIVE_LIMIT: job_state_reason = 26;
pub const job_state_reason_FAIL_ACCOUNT: job_state_reason = 27;
pub const job_state_reason_FAIL_QOS: job_state_reason = 28;
pub const job_state_reason_WAIT_QOS_THRES: job_state_reason = 29;
pub const job_state_reason_WAIT_QOS_JOB_LIMIT: job_state_reason = 30;
pub const job_state_reason_WAIT_QOS_RESOURCE_LIMIT: job_state_reason = 31;
pub const job_state_reason_WAIT_QOS_TIME_LIMIT: job_state_reason = 32;
pub const job_state_reason_FAIL_SIGNAL: job_state_reason = 33;
pub const job_state_reason_DEFUNCT_WAIT_34: job_state_reason = 34;
pub const job_state_reason_WAIT_CLEANING: job_state_reason = 35;
pub const job_state_reason_WAIT_PROLOG: job_state_reason = 36;
pub const job_state_reason_WAIT_QOS: job_state_reason = 37;
pub const job_state_reason_WAIT_ACCOUNT: job_state_reason = 38;
pub const job_state_reason_WAIT_DEP_INVALID: job_state_reason = 39;
pub const job_state_reason_WAIT_QOS_GRP_CPU: job_state_reason = 40;
pub const job_state_reason_WAIT_QOS_GRP_CPU_MIN: job_state_reason = 41;
pub const job_state_reason_WAIT_QOS_GRP_CPU_RUN_MIN: job_state_reason = 42;
pub const job_state_reason_WAIT_QOS_GRP_JOB: job_state_reason = 43;
pub const job_state_reason_WAIT_QOS_GRP_MEM: job_state_reason = 44;
pub const job_state_reason_WAIT_QOS_GRP_NODE: job_state_reason = 45;
pub const job_state_reason_WAIT_QOS_GRP_SUB_JOB: job_state_reason = 46;
pub const job_state_reason_WAIT_QOS_GRP_WALL: job_state_reason = 47;
pub const job_state_reason_WAIT_QOS_MAX_CPU_PER_JOB: job_state_reason = 48;
pub const job_state_reason_WAIT_QOS_MAX_CPU_MINS_PER_JOB: job_state_reason = 49;
pub const job_state_reason_WAIT_QOS_MAX_NODE_PER_JOB: job_state_reason = 50;
pub const job_state_reason_WAIT_QOS_MAX_WALL_PER_JOB: job_state_reason = 51;
pub const job_state_reason_WAIT_QOS_MAX_CPU_PER_USER: job_state_reason = 52;
pub const job_state_reason_WAIT_QOS_MAX_JOB_PER_USER: job_state_reason = 53;
pub const job_state_reason_WAIT_QOS_MAX_NODE_PER_USER: job_state_reason = 54;
pub const job_state_reason_WAIT_QOS_MAX_SUB_JOB: job_state_reason = 55;
pub const job_state_reason_WAIT_QOS_MIN_CPU: job_state_reason = 56;
pub const job_state_reason_WAIT_ASSOC_GRP_CPU: job_state_reason = 57;
pub const job_state_reason_WAIT_ASSOC_GRP_CPU_MIN: job_state_reason = 58;
pub const job_state_reason_WAIT_ASSOC_GRP_CPU_RUN_MIN: job_state_reason = 59;
pub const job_state_reason_WAIT_ASSOC_GRP_JOB: job_state_reason = 60;
pub const job_state_reason_WAIT_ASSOC_GRP_MEM: job_state_reason = 61;
pub const job_state_reason_WAIT_ASSOC_GRP_NODE: job_state_reason = 62;
pub const job_state_reason_WAIT_ASSOC_GRP_SUB_JOB: job_state_reason = 63;
pub const job_state_reason_WAIT_ASSOC_GRP_WALL: job_state_reason = 64;
pub const job_state_reason_WAIT_ASSOC_MAX_JOBS: job_state_reason = 65;
pub const job_state_reason_WAIT_ASSOC_MAX_CPU_PER_JOB: job_state_reason = 66;
pub const job_state_reason_WAIT_ASSOC_MAX_CPU_MINS_PER_JOB: job_state_reason = 67;
pub const job_state_reason_WAIT_ASSOC_MAX_NODE_PER_JOB: job_state_reason = 68;
pub const job_state_reason_WAIT_ASSOC_MAX_WALL_PER_JOB: job_state_reason = 69;
pub const job_state_reason_WAIT_ASSOC_MAX_SUB_JOB: job_state_reason = 70;
pub const job_state_reason_WAIT_MAX_REQUEUE: job_state_reason = 71;
pub const job_state_reason_WAIT_ARRAY_TASK_LIMIT: job_state_reason = 72;
pub const job_state_reason_WAIT_BURST_BUFFER_RESOURCE: job_state_reason = 73;
pub const job_state_reason_WAIT_BURST_BUFFER_STAGING: job_state_reason = 74;
pub const job_state_reason_FAIL_BURST_BUFFER_OP: job_state_reason = 75;
pub const job_state_reason_DEFUNCT_WAIT_76: job_state_reason = 76;
pub const job_state_reason_DEFUNCT_WAIT_77: job_state_reason = 77;
pub const job_state_reason_WAIT_ASSOC_GRP_UNK: job_state_reason = 78;
pub const job_state_reason_WAIT_ASSOC_GRP_UNK_MIN: job_state_reason = 79;
pub const job_state_reason_WAIT_ASSOC_GRP_UNK_RUN_MIN: job_state_reason = 80;
pub const job_state_reason_WAIT_ASSOC_MAX_UNK_PER_JOB: job_state_reason = 81;
pub const job_state_reason_WAIT_ASSOC_MAX_UNK_PER_NODE: job_state_reason = 82;
pub const job_state_reason_WAIT_ASSOC_MAX_UNK_MINS_PER_JOB: job_state_reason = 83;
pub const job_state_reason_WAIT_ASSOC_MAX_CPU_PER_NODE: job_state_reason = 84;
pub const job_state_reason_WAIT_ASSOC_GRP_MEM_MIN: job_state_reason = 85;
pub const job_state_reason_WAIT_ASSOC_GRP_MEM_RUN_MIN: job_state_reason = 86;
pub const job_state_reason_WAIT_ASSOC_MAX_MEM_PER_JOB: job_state_reason = 87;
pub const job_state_reason_WAIT_ASSOC_MAX_MEM_PER_NODE: job_state_reason = 88;
pub const job_state_reason_WAIT_ASSOC_MAX_MEM_MINS_PER_JOB: job_state_reason = 89;
pub const job_state_reason_WAIT_ASSOC_GRP_NODE_MIN: job_state_reason = 90;
pub const job_state_reason_WAIT_ASSOC_GRP_NODE_RUN_MIN: job_state_reason = 91;
pub const job_state_reason_WAIT_ASSOC_MAX_NODE_MINS_PER_JOB: job_state_reason = 92;
pub const job_state_reason_WAIT_ASSOC_GRP_ENERGY: job_state_reason = 93;
pub const job_state_reason_WAIT_ASSOC_GRP_ENERGY_MIN: job_state_reason = 94;
pub const job_state_reason_WAIT_ASSOC_GRP_ENERGY_RUN_MIN: job_state_reason = 95;
pub const job_state_reason_WAIT_ASSOC_MAX_ENERGY_PER_JOB: job_state_reason = 96;
pub const job_state_reason_WAIT_ASSOC_MAX_ENERGY_PER_NODE: job_state_reason = 97;
pub const job_state_reason_WAIT_ASSOC_MAX_ENERGY_MINS_PER_JOB: job_state_reason = 98;
pub const job_state_reason_WAIT_ASSOC_GRP_GRES: job_state_reason = 99;
pub const job_state_reason_WAIT_ASSOC_GRP_GRES_MIN: job_state_reason = 100;
pub const job_state_reason_WAIT_ASSOC_GRP_GRES_RUN_MIN: job_state_reason = 101;
pub const job_state_reason_WAIT_ASSOC_MAX_GRES_PER_JOB: job_state_reason = 102;
pub const job_state_reason_WAIT_ASSOC_MAX_GRES_PER_NODE: job_state_reason = 103;
pub const job_state_reason_WAIT_ASSOC_MAX_GRES_MINS_PER_JOB: job_state_reason = 104;
pub const job_state_reason_WAIT_ASSOC_GRP_LIC: job_state_reason = 105;
pub const job_state_reason_WAIT_ASSOC_GRP_LIC_MIN: job_state_reason = 106;
pub const job_state_reason_WAIT_ASSOC_GRP_LIC_RUN_MIN: job_state_reason = 107;
pub const job_state_reason_WAIT_ASSOC_MAX_LIC_PER_JOB: job_state_reason = 108;
pub const job_state_reason_WAIT_ASSOC_MAX_LIC_MINS_PER_JOB: job_state_reason = 109;
pub const job_state_reason_WAIT_ASSOC_GRP_BB: job_state_reason = 110;
pub const job_state_reason_WAIT_ASSOC_GRP_BB_MIN: job_state_reason = 111;
pub const job_state_reason_WAIT_ASSOC_GRP_BB_RUN_MIN: job_state_reason = 112;
pub const job_state_reason_WAIT_ASSOC_MAX_BB_PER_JOB: job_state_reason = 113;
pub const job_state_reason_WAIT_ASSOC_MAX_BB_PER_NODE: job_state_reason = 114;
pub const job_state_reason_WAIT_ASSOC_MAX_BB_MINS_PER_JOB: job_state_reason = 115;
pub const job_state_reason_WAIT_QOS_GRP_UNK: job_state_reason = 116;
pub const job_state_reason_WAIT_QOS_GRP_UNK_MIN: job_state_reason = 117;
pub const job_state_reason_WAIT_QOS_GRP_UNK_RUN_MIN: job_state_reason = 118;
pub const job_state_reason_WAIT_QOS_MAX_UNK_PER_JOB: job_state_reason = 119;
pub const job_state_reason_WAIT_QOS_MAX_UNK_PER_NODE: job_state_reason = 120;
pub const job_state_reason_WAIT_QOS_MAX_UNK_PER_USER: job_state_reason = 121;
pub const job_state_reason_WAIT_QOS_MAX_UNK_MINS_PER_JOB: job_state_reason = 122;
pub const job_state_reason_WAIT_QOS_MIN_UNK: job_state_reason = 123;
pub const job_state_reason_WAIT_QOS_MAX_CPU_PER_NODE: job_state_reason = 124;
pub const job_state_reason_WAIT_QOS_GRP_MEM_MIN: job_state_reason = 125;
pub const job_state_reason_WAIT_QOS_GRP_MEM_RUN_MIN: job_state_reason = 126;
pub const job_state_reason_WAIT_QOS_MAX_MEM_MINS_PER_JOB: job_state_reason = 127;
pub const job_state_reason_WAIT_QOS_MAX_MEM_PER_JOB: job_state_reason = 128;
pub const job_state_reason_WAIT_QOS_MAX_MEM_PER_NODE: job_state_reason = 129;
pub const job_state_reason_WAIT_QOS_MAX_MEM_PER_USER: job_state_reason = 130;
pub const job_state_reason_WAIT_QOS_MIN_MEM: job_state_reason = 131;
pub const job_state_reason_WAIT_QOS_GRP_ENERGY: job_state_reason = 132;
pub const job_state_reason_WAIT_QOS_GRP_ENERGY_MIN: job_state_reason = 133;
pub const job_state_reason_WAIT_QOS_GRP_ENERGY_RUN_MIN: job_state_reason = 134;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_PER_JOB: job_state_reason = 135;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_PER_NODE: job_state_reason = 136;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_PER_USER: job_state_reason = 137;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_MINS_PER_JOB: job_state_reason = 138;
pub const job_state_reason_WAIT_QOS_MIN_ENERGY: job_state_reason = 139;
pub const job_state_reason_WAIT_QOS_GRP_NODE_MIN: job_state_reason = 140;
pub const job_state_reason_WAIT_QOS_GRP_NODE_RUN_MIN: job_state_reason = 141;
pub const job_state_reason_WAIT_QOS_MAX_NODE_MINS_PER_JOB: job_state_reason = 142;
pub const job_state_reason_WAIT_QOS_MIN_NODE: job_state_reason = 143;
pub const job_state_reason_WAIT_QOS_GRP_GRES: job_state_reason = 144;
pub const job_state_reason_WAIT_QOS_GRP_GRES_MIN: job_state_reason = 145;
pub const job_state_reason_WAIT_QOS_GRP_GRES_RUN_MIN: job_state_reason = 146;
pub const job_state_reason_WAIT_QOS_MAX_GRES_PER_JOB: job_state_reason = 147;
pub const job_state_reason_WAIT_QOS_MAX_GRES_PER_NODE: job_state_reason = 148;
pub const job_state_reason_WAIT_QOS_MAX_GRES_PER_USER: job_state_reason = 149;
pub const job_state_reason_WAIT_QOS_MAX_GRES_MINS_PER_JOB: job_state_reason = 150;
pub const job_state_reason_WAIT_QOS_MIN_GRES: job_state_reason = 151;
pub const job_state_reason_WAIT_QOS_GRP_LIC: job_state_reason = 152;
pub const job_state_reason_WAIT_QOS_GRP_LIC_MIN: job_state_reason = 153;
pub const job_state_reason_WAIT_QOS_GRP_LIC_RUN_MIN: job_state_reason = 154;
pub const job_state_reason_WAIT_QOS_MAX_LIC_PER_JOB: job_state_reason = 155;
pub const job_state_reason_WAIT_QOS_MAX_LIC_PER_USER: job_state_reason = 156;
pub const job_state_reason_WAIT_QOS_MAX_LIC_MINS_PER_JOB: job_state_reason = 157;
pub const job_state_reason_WAIT_QOS_MIN_LIC: job_state_reason = 158;
pub const job_state_reason_WAIT_QOS_GRP_BB: job_state_reason = 159;
pub const job_state_reason_WAIT_QOS_GRP_BB_MIN: job_state_reason = 160;
pub const job_state_reason_WAIT_QOS_GRP_BB_RUN_MIN: job_state_reason = 161;
pub const job_state_reason_WAIT_QOS_MAX_BB_PER_JOB: job_state_reason = 162;
pub const job_state_reason_WAIT_QOS_MAX_BB_PER_NODE: job_state_reason = 163;
pub const job_state_reason_WAIT_QOS_MAX_BB_PER_USER: job_state_reason = 164;
pub const job_state_reason_WAIT_QOS_MAX_BB_MINS_PER_JOB: job_state_reason = 165;
pub const job_state_reason_WAIT_QOS_MIN_BB: job_state_reason = 166;
pub const job_state_reason_FAIL_DEADLINE: job_state_reason = 167;
pub const job_state_reason_WAIT_QOS_MAX_BB_PER_ACCT: job_state_reason = 168;
pub const job_state_reason_WAIT_QOS_MAX_CPU_PER_ACCT: job_state_reason = 169;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_PER_ACCT: job_state_reason = 170;
pub const job_state_reason_WAIT_QOS_MAX_GRES_PER_ACCT: job_state_reason = 171;
pub const job_state_reason_WAIT_QOS_MAX_NODE_PER_ACCT: job_state_reason = 172;
pub const job_state_reason_WAIT_QOS_MAX_LIC_PER_ACCT: job_state_reason = 173;
pub const job_state_reason_WAIT_QOS_MAX_MEM_PER_ACCT: job_state_reason = 174;
pub const job_state_reason_WAIT_QOS_MAX_UNK_PER_ACCT: job_state_reason = 175;
pub const job_state_reason_WAIT_QOS_MAX_JOB_PER_ACCT: job_state_reason = 176;
pub const job_state_reason_WAIT_QOS_MAX_SUB_JOB_PER_ACCT: job_state_reason = 177;
pub const job_state_reason_WAIT_PART_CONFIG: job_state_reason = 178;
pub const job_state_reason_WAIT_ACCOUNT_POLICY: job_state_reason = 179;
pub const job_state_reason_WAIT_FED_JOB_LOCK: job_state_reason = 180;
pub const job_state_reason_FAIL_OOM: job_state_reason = 181;
pub const job_state_reason_WAIT_PN_MEM_LIMIT: job_state_reason = 182;
pub const job_state_reason_WAIT_ASSOC_GRP_BILLING: job_state_reason = 183;
pub const job_state_reason_WAIT_ASSOC_GRP_BILLING_MIN: job_state_reason = 184;
pub const job_state_reason_WAIT_ASSOC_GRP_BILLING_RUN_MIN: job_state_reason = 185;
pub const job_state_reason_WAIT_ASSOC_MAX_BILLING_PER_JOB: job_state_reason = 186;
pub const job_state_reason_WAIT_ASSOC_MAX_BILLING_PER_NODE: job_state_reason = 187;
pub const job_state_reason_WAIT_ASSOC_MAX_BILLING_MINS_PER_JOB: job_state_reason = 188;
pub const job_state_reason_WAIT_QOS_GRP_BILLING: job_state_reason = 189;
pub const job_state_reason_WAIT_QOS_GRP_BILLING_MIN: job_state_reason = 190;
pub const job_state_reason_WAIT_QOS_GRP_BILLING_RUN_MIN: job_state_reason = 191;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_PER_JOB: job_state_reason = 192;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_PER_NODE: job_state_reason = 193;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_PER_USER: job_state_reason = 194;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_MINS_PER_JOB: job_state_reason = 195;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_PER_ACCT: job_state_reason = 196;
pub const job_state_reason_WAIT_QOS_MIN_BILLING: job_state_reason = 197;
pub const job_state_reason_WAIT_RESV_DELETED: job_state_reason = 198;
pub const job_state_reason_WAIT_RESV_INVALID: job_state_reason = 199;
pub const job_state_reason_FAIL_CONSTRAINTS: job_state_reason = 200;
pub const job_state_reason_WAIT_QOS_MAX_BB_RUN_MINS_PER_ACCT: job_state_reason = 201;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_RUN_MINS_PER_ACCT: job_state_reason = 202;
pub const job_state_reason_WAIT_QOS_MAX_CPU_RUN_MINS_PER_ACCT: job_state_reason = 203;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_RUN_MINS_PER_ACCT: job_state_reason = 204;
pub const job_state_reason_WAIT_QOS_MAX_GRES_RUN_MINS_PER_ACCT: job_state_reason = 205;
pub const job_state_reason_WAIT_QOS_MAX_NODE_RUN_MINS_PER_ACCT: job_state_reason = 206;
pub const job_state_reason_WAIT_QOS_MAX_LIC_RUN_MINS_PER_ACCT: job_state_reason = 207;
pub const job_state_reason_WAIT_QOS_MAX_MEM_RUN_MINS_PER_ACCT: job_state_reason = 208;
pub const job_state_reason_WAIT_QOS_MAX_UNK_RUN_MINS_PER_ACCT: job_state_reason = 209;
pub const job_state_reason_WAIT_QOS_MAX_BB_RUN_MINS_PER_USER: job_state_reason = 210;
pub const job_state_reason_WAIT_QOS_MAX_BILLING_RUN_MINS_PER_USER: job_state_reason = 211;
pub const job_state_reason_WAIT_QOS_MAX_CPU_RUN_MINS_PER_USER: job_state_reason = 212;
pub const job_state_reason_WAIT_QOS_MAX_ENERGY_RUN_MINS_PER_USER: job_state_reason = 213;
pub const job_state_reason_WAIT_QOS_MAX_GRES_RUN_MINS_PER_USER: job_state_reason = 214;
pub const job_state_reason_WAIT_QOS_MAX_NODE_RUN_MINS_PER_USER: job_state_reason = 215;
pub const job_state_reason_WAIT_QOS_MAX_LIC_RUN_MINS_PER_USER: job_state_reason = 216;
pub const job_state_reason_WAIT_QOS_MAX_MEM_RUN_MINS_PER_USER: job_state_reason = 217;
pub const job_state_reason_WAIT_QOS_MAX_UNK_RUN_MINS_PER_USER: job_state_reason = 218;
pub const job_state_reason_WAIT_MAX_POWERED_NODES: job_state_reason = 219;
pub const job_state_reason_WAIT_MPI_PORTS_BUSY: job_state_reason = 220;
pub const job_state_reason_REASON_END: job_state_reason = 221;
pub type job_state_reason = ::std::os::raw::c_uint;
pub const job_acct_types_JOB_START: job_acct_types = 0;
pub const job_acct_types_JOB_STEP: job_acct_types = 1;
pub const job_acct_types_JOB_SUSPEND: job_acct_types = 2;
pub const job_acct_types_JOB_TERMINATED: job_acct_types = 3;
pub type job_acct_types = ::std::os::raw::c_uint;
pub const auth_plugin_type_AUTH_PLUGIN_NONE: auth_plugin_type = 100;
pub const auth_plugin_type_AUTH_PLUGIN_MUNGE: auth_plugin_type = 101;
pub const auth_plugin_type_AUTH_PLUGIN_JWT: auth_plugin_type = 102;
pub const auth_plugin_type_AUTH_PLUGIN_SLURM: auth_plugin_type = 103;
pub type auth_plugin_type = ::std::os::raw::c_uint;
pub const hash_plugin_type_HASH_PLUGIN_DEFAULT: hash_plugin_type = 0;
pub const hash_plugin_type_HASH_PLUGIN_NONE: hash_plugin_type = 1;
pub const hash_plugin_type_HASH_PLUGIN_K12: hash_plugin_type = 2;
pub const hash_plugin_type_HASH_PLUGIN_SHA256: hash_plugin_type = 3;
pub const hash_plugin_type_HASH_PLUGIN_SHA3: hash_plugin_type = 4;
pub const hash_plugin_type_HASH_PLUGIN_CNT: hash_plugin_type = 5;
pub type hash_plugin_type = ::std::os::raw::c_uint;
pub const tls_plugin_type_TLS_PLUGIN_NONE: tls_plugin_type = 100;
pub const tls_plugin_type_TLS_PLUGIN_S2N: tls_plugin_type = 101;
pub type tls_plugin_type = ::std::os::raw::c_uint;
pub const select_plugin_type_SELECT_PLUGIN_CONS_RES: select_plugin_type = 101;
pub const select_plugin_type_SELECT_PLUGIN_LINEAR: select_plugin_type = 102;
pub const select_plugin_type_SELECT_PLUGIN_CONS_TRES: select_plugin_type = 109;
pub type select_plugin_type = ::std::os::raw::c_uint;
pub const switch_plugin_type_SWITCH_PLUGIN_NONE: switch_plugin_type = 100;
pub const switch_plugin_type_SWITCH_PLUGIN_GENERIC: switch_plugin_type = 101;
pub const switch_plugin_type_SWITCH_PLUGIN_CRAY: switch_plugin_type = 102;
pub const switch_plugin_type_SWITCH_PLUGIN_SLINGSHOT: switch_plugin_type = 104;
pub const switch_plugin_type_SWITCH_PLUGIN_NVIDIA_IMEX: switch_plugin_type = 105;
pub type switch_plugin_type = ::std::os::raw::c_uint;
pub const select_jobdata_type_SELECT_JOBDATA_NETWORK: select_jobdata_type = 23;
pub type select_jobdata_type = ::std::os::raw::c_uint;
pub const select_nodedata_type_SELECT_NODEDATA_SUBCNT: select_nodedata_type = 2;
pub const select_nodedata_type_SELECT_NODEDATA_PTR: select_nodedata_type = 5;
pub const select_nodedata_type_SELECT_NODEDATA_MEM_ALLOC: select_nodedata_type = 8;
pub const select_nodedata_type_SELECT_NODEDATA_TRES_ALLOC_FMT_STR: select_nodedata_type = 9;
pub const select_nodedata_type_SELECT_NODEDATA_TRES_ALLOC_WEIGHTED: select_nodedata_type = 10;
pub type select_nodedata_type = ::std::os::raw::c_uint;
pub const select_print_mode_SELECT_PRINT_HEAD: select_print_mode = 0;
pub const select_print_mode_SELECT_PRINT_DATA: select_print_mode = 1;
pub const select_print_mode_SELECT_PRINT_MIXED: select_print_mode = 2;
pub const select_print_mode_SELECT_PRINT_MIXED_SHORT: select_print_mode = 3;
pub const select_print_mode_SELECT_PRINT_BG_ID: select_print_mode = 4;
pub const select_print_mode_SELECT_PRINT_NODES: select_print_mode = 5;
pub const select_print_mode_SELECT_PRINT_CONNECTION: select_print_mode = 6;
pub const select_print_mode_SELECT_PRINT_ROTATE: select_print_mode = 7;
pub const select_print_mode_SELECT_PRINT_GEOMETRY: select_print_mode = 8;
pub const select_print_mode_SELECT_PRINT_START: select_print_mode = 9;
pub const select_print_mode_SELECT_PRINT_BLRTS_IMAGE: select_print_mode = 10;
pub const select_print_mode_SELECT_PRINT_LINUX_IMAGE: select_print_mode = 11;
pub const select_print_mode_SELECT_PRINT_MLOADER_IMAGE: select_print_mode = 12;
pub const select_print_mode_SELECT_PRINT_RAMDISK_IMAGE: select_print_mode = 13;
pub const select_print_mode_SELECT_PRINT_REBOOT: select_print_mode = 14;
pub const select_print_mode_SELECT_PRINT_RESV_ID: select_print_mode = 15;
pub const select_print_mode_SELECT_PRINT_START_LOC: select_print_mode = 16;
pub type select_print_mode = ::std::os::raw::c_uint;
pub const select_node_cnt_SELECT_GET_NODE_SCALING: select_node_cnt = 0;
pub const select_node_cnt_SELECT_GET_NODE_CPU_CNT: select_node_cnt = 1;
pub const select_node_cnt_SELECT_GET_MP_CPU_CNT: select_node_cnt = 2;
pub const select_node_cnt_SELECT_APPLY_NODE_MIN_OFFSET: select_node_cnt = 3;
pub const select_node_cnt_SELECT_APPLY_NODE_MAX_OFFSET: select_node_cnt = 4;
pub const select_node_cnt_SELECT_SET_NODE_CNT: select_node_cnt = 5;
pub const select_node_cnt_SELECT_SET_MP_CNT: select_node_cnt = 6;
pub type select_node_cnt = ::std::os::raw::c_uint;
pub const acct_gather_profile_info_ACCT_GATHER_PROFILE_DIR: acct_gather_profile_info = 0;
pub const acct_gather_profile_info_ACCT_GATHER_PROFILE_DEFAULT: acct_gather_profile_info = 1;
pub const acct_gather_profile_info_ACCT_GATHER_PROFILE_RUNNING: acct_gather_profile_info = 2;
pub type acct_gather_profile_info = ::std::os::raw::c_uint;
pub const jobacct_data_type_JOBACCT_DATA_TOTAL: jobacct_data_type = 0;
pub const jobacct_data_type_JOBACCT_DATA_PIPE: jobacct_data_type = 1;
pub const jobacct_data_type_JOBACCT_DATA_RUSAGE: jobacct_data_type = 2;
pub const jobacct_data_type_JOBACCT_DATA_TOT_VSIZE: jobacct_data_type = 5;
pub const jobacct_data_type_JOBACCT_DATA_TOT_RSS: jobacct_data_type = 8;
pub type jobacct_data_type = ::std::os::raw::c_uint;
pub const acct_energy_type_ENERGY_DATA_JOULES_TASK: acct_energy_type = 0;
pub const acct_energy_type_ENERGY_DATA_STRUCT: acct_energy_type = 1;
pub const acct_energy_type_ENERGY_DATA_RECONFIG: acct_energy_type = 2;
pub const acct_energy_type_ENERGY_DATA_PROFILE: acct_energy_type = 3;
pub const acct_energy_type_ENERGY_DATA_LAST_POLL: acct_energy_type = 4;
pub const acct_energy_type_ENERGY_DATA_SENSOR_CNT: acct_energy_type = 5;
pub const acct_energy_type_ENERGY_DATA_NODE_ENERGY: acct_energy_type = 6;
pub const acct_energy_type_ENERGY_DATA_NODE_ENERGY_UP: acct_energy_type = 7;
pub const acct_energy_type_ENERGY_DATA_STEP_PTR: acct_energy_type = 8;
pub type acct_energy_type = ::std::os::raw::c_uint;
pub const update_mode_t_UPDATE_SET: update_mode_t = 0;
pub const update_mode_t_UPDATE_ADD: update_mode_t = 1;
pub const update_mode_t_UPDATE_REMOVE: update_mode_t = 2;
pub type update_mode_t = ::std::os::raw::c_uint;
pub const task_dist_states_SLURM_DIST_CYCLIC: task_dist_states = 1;
pub const task_dist_states_SLURM_DIST_BLOCK: task_dist_states = 2;
pub const task_dist_states_SLURM_DIST_ARBITRARY: task_dist_states = 3;
pub const task_dist_states_SLURM_DIST_PLANE: task_dist_states = 4;
pub const task_dist_states_SLURM_DIST_CYCLIC_CYCLIC: task_dist_states = 17;
pub const task_dist_states_SLURM_DIST_CYCLIC_BLOCK: task_dist_states = 33;
pub const task_dist_states_SLURM_DIST_CYCLIC_CFULL: task_dist_states = 49;
pub const task_dist_states_SLURM_DIST_BLOCK_CYCLIC: task_dist_states = 18;
pub const task_dist_states_SLURM_DIST_BLOCK_BLOCK: task_dist_states = 34;
pub const task_dist_states_SLURM_DIST_BLOCK_CFULL: task_dist_states = 50;
pub const task_dist_states_SLURM_DIST_CYCLIC_CYCLIC_CYCLIC: task_dist_states = 273;
pub const task_dist_states_SLURM_DIST_CYCLIC_CYCLIC_BLOCK: task_dist_states = 529;
pub const task_dist_states_SLURM_DIST_CYCLIC_CYCLIC_CFULL: task_dist_states = 785;
pub const task_dist_states_SLURM_DIST_CYCLIC_BLOCK_CYCLIC: task_dist_states = 289;
pub const task_dist_states_SLURM_DIST_CYCLIC_BLOCK_BLOCK: task_dist_states = 545;
pub const task_dist_states_SLURM_DIST_CYCLIC_BLOCK_CFULL: task_dist_states = 801;
pub const task_dist_states_SLURM_DIST_CYCLIC_CFULL_CYCLIC: task_dist_states = 305;
pub const task_dist_states_SLURM_DIST_CYCLIC_CFULL_BLOCK: task_dist_states = 561;
pub const task_dist_states_SLURM_DIST_CYCLIC_CFULL_CFULL: task_dist_states = 817;
pub const task_dist_states_SLURM_DIST_BLOCK_CYCLIC_CYCLIC: task_dist_states = 274;
pub const task_dist_states_SLURM_DIST_BLOCK_CYCLIC_BLOCK: task_dist_states = 530;
pub const task_dist_states_SLURM_DIST_BLOCK_CYCLIC_CFULL: task_dist_states = 786;
pub const task_dist_states_SLURM_DIST_BLOCK_BLOCK_CYCLIC: task_dist_states = 290;
pub const task_dist_states_SLURM_DIST_BLOCK_BLOCK_BLOCK: task_dist_states = 546;
pub const task_dist_states_SLURM_DIST_BLOCK_BLOCK_CFULL: task_dist_states = 802;
pub const task_dist_states_SLURM_DIST_BLOCK_CFULL_CYCLIC: task_dist_states = 306;
pub const task_dist_states_SLURM_DIST_BLOCK_CFULL_BLOCK: task_dist_states = 562;
pub const task_dist_states_SLURM_DIST_BLOCK_CFULL_CFULL: task_dist_states = 818;
pub const task_dist_states_SLURM_DIST_NODECYCLIC: task_dist_states = 1;
pub const task_dist_states_SLURM_DIST_NODEBLOCK: task_dist_states = 2;
pub const task_dist_states_SLURM_DIST_SOCKCYCLIC: task_dist_states = 16;
pub const task_dist_states_SLURM_DIST_SOCKBLOCK: task_dist_states = 32;
pub const task_dist_states_SLURM_DIST_SOCKCFULL: task_dist_states = 48;
pub const task_dist_states_SLURM_DIST_CORECYCLIC: task_dist_states = 256;
pub const task_dist_states_SLURM_DIST_COREBLOCK: task_dist_states = 512;
pub const task_dist_states_SLURM_DIST_CORECFULL: task_dist_states = 768;
pub const task_dist_states_SLURM_DIST_UNKNOWN: task_dist_states = 8192;
pub type task_dist_states = ::std::os::raw::c_uint;
pub use self::task_dist_states as task_dist_states_t;
pub const cpu_bind_type_CPU_BIND_VERBOSE: cpu_bind_type = 1;
pub const cpu_bind_type_CPU_BIND_TO_THREADS: cpu_bind_type = 2;
pub const cpu_bind_type_CPU_BIND_TO_CORES: cpu_bind_type = 4;
pub const cpu_bind_type_CPU_BIND_TO_SOCKETS: cpu_bind_type = 8;
pub const cpu_bind_type_CPU_BIND_TO_LDOMS: cpu_bind_type = 16;
pub const cpu_bind_type_CPU_BIND_NONE: cpu_bind_type = 32;
pub const cpu_bind_type_CPU_BIND_MAP: cpu_bind_type = 128;
pub const cpu_bind_type_CPU_BIND_MASK: cpu_bind_type = 256;
pub const cpu_bind_type_CPU_BIND_LDRANK: cpu_bind_type = 512;
pub const cpu_bind_type_CPU_BIND_LDMAP: cpu_bind_type = 1024;
pub const cpu_bind_type_CPU_BIND_LDMASK: cpu_bind_type = 2048;
pub const cpu_bind_type_CPU_BIND_ONE_THREAD_PER_CORE: cpu_bind_type = 8192;
pub const cpu_bind_type_CPU_AUTO_BIND_TO_THREADS: cpu_bind_type = 16384;
pub const cpu_bind_type_CPU_AUTO_BIND_TO_CORES: cpu_bind_type = 65536;
pub const cpu_bind_type_CPU_AUTO_BIND_TO_SOCKETS: cpu_bind_type = 131072;
pub const cpu_bind_type_SLURMD_OFF_SPEC: cpu_bind_type = 262144;
pub const cpu_bind_type_CPU_BIND_OFF: cpu_bind_type = 524288;
pub const cpu_bind_type_OOM_KILL_STEP: cpu_bind_type = 1048576;
pub type cpu_bind_type = ::std::os::raw::c_uint;
pub use self::cpu_bind_type as cpu_bind_type_t;
pub const mem_bind_type_MEM_BIND_VERBOSE: mem_bind_type = 1;
pub const mem_bind_type_MEM_BIND_NONE: mem_bind_type = 2;
pub const mem_bind_type_MEM_BIND_RANK: mem_bind_type = 4;
pub const mem_bind_type_MEM_BIND_MAP: mem_bind_type = 8;
pub const mem_bind_type_MEM_BIND_MASK: mem_bind_type = 16;
pub const mem_bind_type_MEM_BIND_LOCAL: mem_bind_type = 32;
pub const mem_bind_type_MEM_BIND_SORT: mem_bind_type = 64;
pub const mem_bind_type_MEM_BIND_PREFER: mem_bind_type = 128;
pub type mem_bind_type = ::std::os::raw::c_uint;
pub use self::mem_bind_type as mem_bind_type_t;
pub const accel_bind_type_ACCEL_BIND_VERBOSE: accel_bind_type = 1;
pub const accel_bind_type_ACCEL_BIND_CLOSEST_GPU: accel_bind_type = 2;
pub const accel_bind_type_ACCEL_BIND_CLOSEST_NIC: accel_bind_type = 8;
pub type accel_bind_type = ::std::os::raw::c_uint;
pub use self::accel_bind_type as accel_bind_type_t;
pub const node_states_NODE_STATE_UNKNOWN: node_states = 0;
pub const node_states_NODE_STATE_DOWN: node_states = 1;
pub const node_states_NODE_STATE_IDLE: node_states = 2;
pub const node_states_NODE_STATE_ALLOCATED: node_states = 3;
pub const node_states_NODE_STATE_ERROR: node_states = 4;
pub const node_states_NODE_STATE_MIXED: node_states = 5;
pub const node_states_NODE_STATE_FUTURE: node_states = 6;
pub const node_states_NODE_STATE_END: node_states = 7;
pub type node_states = ::std::os::raw::c_uint;
pub const step_spec_flags_t_SSF_NONE: step_spec_flags_t = 0;
pub const step_spec_flags_t_SSF_EXCLUSIVE: step_spec_flags_t = 1;
pub const step_spec_flags_t_SSF_NO_KILL: step_spec_flags_t = 2;
pub const step_spec_flags_t_SSF_OVERCOMMIT: step_spec_flags_t = 4;
pub const step_spec_flags_t_SSF_WHOLE: step_spec_flags_t = 8;
pub const step_spec_flags_t_SSF_INTERACTIVE: step_spec_flags_t = 16;
pub const step_spec_flags_t_SSF_MEM_ZERO: step_spec_flags_t = 32;
pub const step_spec_flags_t_SSF_OVERLAP_FORCE: step_spec_flags_t = 64;
pub const step_spec_flags_t_SSF_NO_SIG_FAIL: step_spec_flags_t = 128;
pub const step_spec_flags_t_SSF_EXT_LAUNCHER: step_spec_flags_t = 256;
pub const step_spec_flags_t_SSF_GRES_ALLOW_TASK_SHARING: step_spec_flags_t = 512;
pub type step_spec_flags_t = ::std::os::raw::c_uint;
pub const topology_plugin_type_TOPOLOGY_PLUGIN_DEFAULT: topology_plugin_type = 100;
pub const topology_plugin_type_TOPOLOGY_PLUGIN_3DTORUS: topology_plugin_type = 101;
pub const topology_plugin_type_TOPOLOGY_PLUGIN_TREE: topology_plugin_type = 102;
pub const topology_plugin_type_TOPOLOGY_PLUGIN_BLOCK: topology_plugin_type = 103;
pub type topology_plugin_type = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn slurm_init(conf: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn slurm_fini();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hostlist {
    _unused: [u8; 0],
}
pub type hostlist_t = hostlist;
unsafe extern "C" {
    pub fn slurm_hostlist_create(hostlist: *const ::std::os::raw::c_char) -> *mut hostlist_t;
}
unsafe extern "C" {
    pub fn slurm_hostlist_count(hl: *mut hostlist_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn slurm_hostlist_destroy(hl: *mut hostlist_t);
}
unsafe extern "C" {
    pub fn slurm_hostlist_find(
        hl: *mut hostlist_t,
        hostname: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn slurm_hostlist_push(
        hl: *mut hostlist_t,
        hosts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn slurm_hostlist_push_host(
        hl: *mut hostlist_t,
        host: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn slurm_hostlist_ranged_string(
        hl: *mut hostlist_t,
        n: usize,
        buf: *mut ::std::os::raw::c_char,
    ) -> isize;
}
unsafe extern "C" {
    pub fn slurm_hostlist_ranged_string_xmalloc(hl: *mut hostlist_t)
    -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn slurm_hostlist_shift(hl: *mut hostlist_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn slurm_hostlist_uniq(hl: *mut hostlist_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xlist {
    _unused: [u8; 0],
}
pub type list_t = xlist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct listIterator {
    _unused: [u8; 0],
}
pub type list_itr_t = listIterator;
pub type ListDelF = ::std::option::Option<unsafe extern "C" fn(x: *mut ::std::os::raw::c_void)>;
pub type ListCmpF = ::std::option::Option<
    unsafe extern "C" fn(
        x: *mut ::std::os::raw::c_void,
        y: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type ListFindF = ::std::option::Option<
    unsafe extern "C" fn(
        x: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type ListForF = ::std::option::Option<
    unsafe extern "C" fn(
        x: *mut ::std::os::raw::c_void,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn slurm_list_append(l: *mut list_t, x: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn slurm_list_count(l: *mut list_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn slurm_list_create(f: ListDelF) -> *mut list_t;
}
unsafe extern "C" {
    pub fn slurm_list_destroy(l: *mut list_t);
}
unsafe extern "C" {
    pub fn slurm_list_find(
        i: *mut list_itr_t,
        f: ListFindF,
        key: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn slurm_list_is_empty(l: *mut list_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn slurm_list_iterator_create(l: *mut list_t) -> *mut list_itr_t;
}
unsafe extern "C" {
    pub fn slurm_list_iterator_reset(i: *mut list_itr_t);
}
unsafe extern "C" {
    pub fn slurm_list_iterator_destroy(i: *mut list_itr_t);
}
unsafe extern "C" {
    pub fn slurm_list_next(i: *mut list_itr_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn slurm_list_sort(l: *mut list_t, f: ListCmpF);
}
unsafe extern "C" {
    pub fn slurm_list_pop(l: *mut list_t) -> *mut ::std::os::raw::c_void;
}
pub type bitstr_t = i64;
pub type bitoff_t = bitstr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dynamic_plugin_data {
    pub data: *mut ::std::os::raw::c_void,
    pub plugin_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dynamic_plugin_data"][::std::mem::size_of::<dynamic_plugin_data>() - 16usize];
    ["Alignment of dynamic_plugin_data"][::std::mem::align_of::<dynamic_plugin_data>() - 8usize];
    ["Offset of field: dynamic_plugin_data::data"]
        [::std::mem::offset_of!(dynamic_plugin_data, data) - 0usize];
    ["Offset of field: dynamic_plugin_data::plugin_id"]
        [::std::mem::offset_of!(dynamic_plugin_data, plugin_id) - 8usize];
};
pub type dynamic_plugin_data_t = dynamic_plugin_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acct_gather_energy {
    pub ave_watts: u32,
    pub base_consumed_energy: u64,
    pub consumed_energy: u64,
    pub current_watts: u32,
    pub last_adjustment: u64,
    pub previous_consumed_energy: u64,
    pub poll_time: time_t,
    pub slurmd_start_time: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acct_gather_energy"][::std::mem::size_of::<acct_gather_energy>() - 64usize];
    ["Alignment of acct_gather_energy"][::std::mem::align_of::<acct_gather_energy>() - 8usize];
    ["Offset of field: acct_gather_energy::ave_watts"]
        [::std::mem::offset_of!(acct_gather_energy, ave_watts) - 0usize];
    ["Offset of field: acct_gather_energy::base_consumed_energy"]
        [::std::mem::offset_of!(acct_gather_energy, base_consumed_energy) - 8usize];
    ["Offset of field: acct_gather_energy::consumed_energy"]
        [::std::mem::offset_of!(acct_gather_energy, consumed_energy) - 16usize];
    ["Offset of field: acct_gather_energy::current_watts"]
        [::std::mem::offset_of!(acct_gather_energy, current_watts) - 24usize];
    ["Offset of field: acct_gather_energy::last_adjustment"]
        [::std::mem::offset_of!(acct_gather_energy, last_adjustment) - 32usize];
    ["Offset of field: acct_gather_energy::previous_consumed_energy"]
        [::std::mem::offset_of!(acct_gather_energy, previous_consumed_energy) - 40usize];
    ["Offset of field: acct_gather_energy::poll_time"]
        [::std::mem::offset_of!(acct_gather_energy, poll_time) - 48usize];
    ["Offset of field: acct_gather_energy::slurmd_start_time"]
        [::std::mem::offset_of!(acct_gather_energy, slurmd_start_time) - 56usize];
};
pub type acct_gather_energy_t = acct_gather_energy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_node_alias_addrs_t {
    pub expiration: time_t,
    pub net_cred: *mut ::std::os::raw::c_char,
    pub node_addrs: *mut slurm_addr_t,
    pub node_cnt: u32,
    pub node_list: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_node_alias_addrs_t"]
        [::std::mem::size_of::<slurm_node_alias_addrs_t>() - 40usize];
    ["Alignment of slurm_node_alias_addrs_t"]
        [::std::mem::align_of::<slurm_node_alias_addrs_t>() - 8usize];
    ["Offset of field: slurm_node_alias_addrs_t::expiration"]
        [::std::mem::offset_of!(slurm_node_alias_addrs_t, expiration) - 0usize];
    ["Offset of field: slurm_node_alias_addrs_t::net_cred"]
        [::std::mem::offset_of!(slurm_node_alias_addrs_t, net_cred) - 8usize];
    ["Offset of field: slurm_node_alias_addrs_t::node_addrs"]
        [::std::mem::offset_of!(slurm_node_alias_addrs_t, node_addrs) - 16usize];
    ["Offset of field: slurm_node_alias_addrs_t::node_cnt"]
        [::std::mem::offset_of!(slurm_node_alias_addrs_t, node_cnt) - 24usize];
    ["Offset of field: slurm_node_alias_addrs_t::node_list"]
        [::std::mem::offset_of!(slurm_node_alias_addrs_t, node_list) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_descriptor {
    pub account: *mut ::std::os::raw::c_char,
    pub acctg_freq: *mut ::std::os::raw::c_char,
    pub admin_comment: *mut ::std::os::raw::c_char,
    pub alloc_node: *mut ::std::os::raw::c_char,
    pub alloc_resp_port: u16,
    pub alloc_sid: u32,
    pub argc: u32,
    pub argv: *mut *mut ::std::os::raw::c_char,
    pub array_inx: *mut ::std::os::raw::c_char,
    pub array_bitmap: *mut bitstr_t,
    pub batch_features: *mut ::std::os::raw::c_char,
    pub begin_time: time_t,
    pub bitflags: u64,
    pub burst_buffer: *mut ::std::os::raw::c_char,
    pub clusters: *mut ::std::os::raw::c_char,
    pub cluster_features: *mut ::std::os::raw::c_char,
    pub comment: *mut ::std::os::raw::c_char,
    pub contiguous: u16,
    pub container: *mut ::std::os::raw::c_char,
    pub container_id: *mut ::std::os::raw::c_char,
    pub core_spec: u16,
    pub cpu_bind: *mut ::std::os::raw::c_char,
    pub cpu_bind_type: u16,
    pub cpu_freq_min: u32,
    pub cpu_freq_max: u32,
    pub cpu_freq_gov: u32,
    pub cpus_per_tres: *mut ::std::os::raw::c_char,
    pub crontab_entry: *mut ::std::os::raw::c_void,
    pub deadline: time_t,
    pub delay_boot: u32,
    pub dependency: *mut ::std::os::raw::c_char,
    pub end_time: time_t,
    pub environment: *mut *mut ::std::os::raw::c_char,
    pub env_hash: slurm_hash_t,
    pub env_size: u32,
    pub exc_nodes: *mut ::std::os::raw::c_char,
    pub extra: *mut ::std::os::raw::c_char,
    pub features: *mut ::std::os::raw::c_char,
    pub fed_siblings_active: u64,
    pub fed_siblings_viable: u64,
    pub group_id: u32,
    pub het_job_offset: u32,
    pub id: *mut ::std::os::raw::c_void,
    pub immediate: u16,
    pub job_id: u32,
    pub job_id_str: *mut ::std::os::raw::c_char,
    pub job_size_str: *mut ::std::os::raw::c_char,
    pub kill_on_node_fail: u16,
    pub licenses: *mut ::std::os::raw::c_char,
    pub licenses_tot: *mut ::std::os::raw::c_char,
    pub mail_type: u16,
    pub mail_user: *mut ::std::os::raw::c_char,
    pub mcs_label: *mut ::std::os::raw::c_char,
    pub mem_bind: *mut ::std::os::raw::c_char,
    pub mem_bind_type: u16,
    pub mem_per_tres: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub network: *mut ::std::os::raw::c_char,
    pub nice: u32,
    pub num_tasks: u32,
    pub oom_kill_step: u16,
    pub open_mode: u8,
    pub origin_cluster: *mut ::std::os::raw::c_char,
    pub other_port: u16,
    pub overcommit: u8,
    pub partition: *mut ::std::os::raw::c_char,
    pub plane_size: u16,
    pub prefer: *mut ::std::os::raw::c_char,
    pub priority: u32,
    pub profile: u32,
    pub qos: *mut ::std::os::raw::c_char,
    pub reboot: u16,
    pub resp_host: *mut ::std::os::raw::c_char,
    pub restart_cnt: u16,
    pub req_nodes: *mut ::std::os::raw::c_char,
    pub requeue: u16,
    pub reservation: *mut ::std::os::raw::c_char,
    pub resv_port_cnt: u16,
    pub script: *mut ::std::os::raw::c_char,
    pub script_buf: *mut ::std::os::raw::c_void,
    pub script_hash: slurm_hash_t,
    pub shared: u16,
    pub site_factor: u32,
    pub spank_job_env: *mut *mut ::std::os::raw::c_char,
    pub spank_job_env_size: u32,
    pub submit_line: *mut ::std::os::raw::c_char,
    pub task_dist: u32,
    pub time_limit: u32,
    pub time_min: u32,
    pub tres_bind: *mut ::std::os::raw::c_char,
    pub tres_freq: *mut ::std::os::raw::c_char,
    pub tres_per_job: *mut ::std::os::raw::c_char,
    pub tres_per_node: *mut ::std::os::raw::c_char,
    pub tres_per_socket: *mut ::std::os::raw::c_char,
    pub tres_per_task: *mut ::std::os::raw::c_char,
    pub user_id: u32,
    pub wait_all_nodes: u16,
    pub warn_flags: u16,
    pub warn_signal: u16,
    pub warn_time: u16,
    pub work_dir: *mut ::std::os::raw::c_char,
    pub cpus_per_task: u16,
    pub min_cpus: u32,
    pub max_cpus: u32,
    pub min_nodes: u32,
    pub max_nodes: u32,
    pub boards_per_node: u16,
    pub sockets_per_board: u16,
    pub sockets_per_node: u16,
    pub cores_per_socket: u16,
    pub threads_per_core: u16,
    pub ntasks_per_node: u16,
    pub ntasks_per_socket: u16,
    pub ntasks_per_core: u16,
    pub ntasks_per_board: u16,
    pub ntasks_per_tres: u16,
    pub pn_min_cpus: u16,
    pub pn_min_memory: u64,
    pub pn_min_tmp_disk: u32,
    pub req_context: *mut ::std::os::raw::c_char,
    pub req_switch: u32,
    pub segment_size: u16,
    pub selinux_context: *mut ::std::os::raw::c_char,
    pub std_err: *mut ::std::os::raw::c_char,
    pub std_in: *mut ::std::os::raw::c_char,
    pub std_out: *mut ::std::os::raw::c_char,
    pub tres_req_cnt: *mut u64,
    pub wait4switch: u32,
    pub wckey: *mut ::std::os::raw::c_char,
    pub x11: u16,
    pub x11_magic_cookie: *mut ::std::os::raw::c_char,
    pub x11_target: *mut ::std::os::raw::c_char,
    pub x11_target_port: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_descriptor"][::std::mem::size_of::<job_descriptor>() - 912usize];
    ["Alignment of job_descriptor"][::std::mem::align_of::<job_descriptor>() - 8usize];
    ["Offset of field: job_descriptor::account"]
        [::std::mem::offset_of!(job_descriptor, account) - 0usize];
    ["Offset of field: job_descriptor::acctg_freq"]
        [::std::mem::offset_of!(job_descriptor, acctg_freq) - 8usize];
    ["Offset of field: job_descriptor::admin_comment"]
        [::std::mem::offset_of!(job_descriptor, admin_comment) - 16usize];
    ["Offset of field: job_descriptor::alloc_node"]
        [::std::mem::offset_of!(job_descriptor, alloc_node) - 24usize];
    ["Offset of field: job_descriptor::alloc_resp_port"]
        [::std::mem::offset_of!(job_descriptor, alloc_resp_port) - 32usize];
    ["Offset of field: job_descriptor::alloc_sid"]
        [::std::mem::offset_of!(job_descriptor, alloc_sid) - 36usize];
    ["Offset of field: job_descriptor::argc"]
        [::std::mem::offset_of!(job_descriptor, argc) - 40usize];
    ["Offset of field: job_descriptor::argv"]
        [::std::mem::offset_of!(job_descriptor, argv) - 48usize];
    ["Offset of field: job_descriptor::array_inx"]
        [::std::mem::offset_of!(job_descriptor, array_inx) - 56usize];
    ["Offset of field: job_descriptor::array_bitmap"]
        [::std::mem::offset_of!(job_descriptor, array_bitmap) - 64usize];
    ["Offset of field: job_descriptor::batch_features"]
        [::std::mem::offset_of!(job_descriptor, batch_features) - 72usize];
    ["Offset of field: job_descriptor::begin_time"]
        [::std::mem::offset_of!(job_descriptor, begin_time) - 80usize];
    ["Offset of field: job_descriptor::bitflags"]
        [::std::mem::offset_of!(job_descriptor, bitflags) - 88usize];
    ["Offset of field: job_descriptor::burst_buffer"]
        [::std::mem::offset_of!(job_descriptor, burst_buffer) - 96usize];
    ["Offset of field: job_descriptor::clusters"]
        [::std::mem::offset_of!(job_descriptor, clusters) - 104usize];
    ["Offset of field: job_descriptor::cluster_features"]
        [::std::mem::offset_of!(job_descriptor, cluster_features) - 112usize];
    ["Offset of field: job_descriptor::comment"]
        [::std::mem::offset_of!(job_descriptor, comment) - 120usize];
    ["Offset of field: job_descriptor::contiguous"]
        [::std::mem::offset_of!(job_descriptor, contiguous) - 128usize];
    ["Offset of field: job_descriptor::container"]
        [::std::mem::offset_of!(job_descriptor, container) - 136usize];
    ["Offset of field: job_descriptor::container_id"]
        [::std::mem::offset_of!(job_descriptor, container_id) - 144usize];
    ["Offset of field: job_descriptor::core_spec"]
        [::std::mem::offset_of!(job_descriptor, core_spec) - 152usize];
    ["Offset of field: job_descriptor::cpu_bind"]
        [::std::mem::offset_of!(job_descriptor, cpu_bind) - 160usize];
    ["Offset of field: job_descriptor::cpu_bind_type"]
        [::std::mem::offset_of!(job_descriptor, cpu_bind_type) - 168usize];
    ["Offset of field: job_descriptor::cpu_freq_min"]
        [::std::mem::offset_of!(job_descriptor, cpu_freq_min) - 172usize];
    ["Offset of field: job_descriptor::cpu_freq_max"]
        [::std::mem::offset_of!(job_descriptor, cpu_freq_max) - 176usize];
    ["Offset of field: job_descriptor::cpu_freq_gov"]
        [::std::mem::offset_of!(job_descriptor, cpu_freq_gov) - 180usize];
    ["Offset of field: job_descriptor::cpus_per_tres"]
        [::std::mem::offset_of!(job_descriptor, cpus_per_tres) - 184usize];
    ["Offset of field: job_descriptor::crontab_entry"]
        [::std::mem::offset_of!(job_descriptor, crontab_entry) - 192usize];
    ["Offset of field: job_descriptor::deadline"]
        [::std::mem::offset_of!(job_descriptor, deadline) - 200usize];
    ["Offset of field: job_descriptor::delay_boot"]
        [::std::mem::offset_of!(job_descriptor, delay_boot) - 208usize];
    ["Offset of field: job_descriptor::dependency"]
        [::std::mem::offset_of!(job_descriptor, dependency) - 216usize];
    ["Offset of field: job_descriptor::end_time"]
        [::std::mem::offset_of!(job_descriptor, end_time) - 224usize];
    ["Offset of field: job_descriptor::environment"]
        [::std::mem::offset_of!(job_descriptor, environment) - 232usize];
    ["Offset of field: job_descriptor::env_hash"]
        [::std::mem::offset_of!(job_descriptor, env_hash) - 240usize];
    ["Offset of field: job_descriptor::env_size"]
        [::std::mem::offset_of!(job_descriptor, env_size) - 276usize];
    ["Offset of field: job_descriptor::exc_nodes"]
        [::std::mem::offset_of!(job_descriptor, exc_nodes) - 280usize];
    ["Offset of field: job_descriptor::extra"]
        [::std::mem::offset_of!(job_descriptor, extra) - 288usize];
    ["Offset of field: job_descriptor::features"]
        [::std::mem::offset_of!(job_descriptor, features) - 296usize];
    ["Offset of field: job_descriptor::fed_siblings_active"]
        [::std::mem::offset_of!(job_descriptor, fed_siblings_active) - 304usize];
    ["Offset of field: job_descriptor::fed_siblings_viable"]
        [::std::mem::offset_of!(job_descriptor, fed_siblings_viable) - 312usize];
    ["Offset of field: job_descriptor::group_id"]
        [::std::mem::offset_of!(job_descriptor, group_id) - 320usize];
    ["Offset of field: job_descriptor::het_job_offset"]
        [::std::mem::offset_of!(job_descriptor, het_job_offset) - 324usize];
    ["Offset of field: job_descriptor::id"][::std::mem::offset_of!(job_descriptor, id) - 328usize];
    ["Offset of field: job_descriptor::immediate"]
        [::std::mem::offset_of!(job_descriptor, immediate) - 336usize];
    ["Offset of field: job_descriptor::job_id"]
        [::std::mem::offset_of!(job_descriptor, job_id) - 340usize];
    ["Offset of field: job_descriptor::job_id_str"]
        [::std::mem::offset_of!(job_descriptor, job_id_str) - 344usize];
    ["Offset of field: job_descriptor::job_size_str"]
        [::std::mem::offset_of!(job_descriptor, job_size_str) - 352usize];
    ["Offset of field: job_descriptor::kill_on_node_fail"]
        [::std::mem::offset_of!(job_descriptor, kill_on_node_fail) - 360usize];
    ["Offset of field: job_descriptor::licenses"]
        [::std::mem::offset_of!(job_descriptor, licenses) - 368usize];
    ["Offset of field: job_descriptor::licenses_tot"]
        [::std::mem::offset_of!(job_descriptor, licenses_tot) - 376usize];
    ["Offset of field: job_descriptor::mail_type"]
        [::std::mem::offset_of!(job_descriptor, mail_type) - 384usize];
    ["Offset of field: job_descriptor::mail_user"]
        [::std::mem::offset_of!(job_descriptor, mail_user) - 392usize];
    ["Offset of field: job_descriptor::mcs_label"]
        [::std::mem::offset_of!(job_descriptor, mcs_label) - 400usize];
    ["Offset of field: job_descriptor::mem_bind"]
        [::std::mem::offset_of!(job_descriptor, mem_bind) - 408usize];
    ["Offset of field: job_descriptor::mem_bind_type"]
        [::std::mem::offset_of!(job_descriptor, mem_bind_type) - 416usize];
    ["Offset of field: job_descriptor::mem_per_tres"]
        [::std::mem::offset_of!(job_descriptor, mem_per_tres) - 424usize];
    ["Offset of field: job_descriptor::name"]
        [::std::mem::offset_of!(job_descriptor, name) - 432usize];
    ["Offset of field: job_descriptor::network"]
        [::std::mem::offset_of!(job_descriptor, network) - 440usize];
    ["Offset of field: job_descriptor::nice"]
        [::std::mem::offset_of!(job_descriptor, nice) - 448usize];
    ["Offset of field: job_descriptor::num_tasks"]
        [::std::mem::offset_of!(job_descriptor, num_tasks) - 452usize];
    ["Offset of field: job_descriptor::oom_kill_step"]
        [::std::mem::offset_of!(job_descriptor, oom_kill_step) - 456usize];
    ["Offset of field: job_descriptor::open_mode"]
        [::std::mem::offset_of!(job_descriptor, open_mode) - 458usize];
    ["Offset of field: job_descriptor::origin_cluster"]
        [::std::mem::offset_of!(job_descriptor, origin_cluster) - 464usize];
    ["Offset of field: job_descriptor::other_port"]
        [::std::mem::offset_of!(job_descriptor, other_port) - 472usize];
    ["Offset of field: job_descriptor::overcommit"]
        [::std::mem::offset_of!(job_descriptor, overcommit) - 474usize];
    ["Offset of field: job_descriptor::partition"]
        [::std::mem::offset_of!(job_descriptor, partition) - 480usize];
    ["Offset of field: job_descriptor::plane_size"]
        [::std::mem::offset_of!(job_descriptor, plane_size) - 488usize];
    ["Offset of field: job_descriptor::prefer"]
        [::std::mem::offset_of!(job_descriptor, prefer) - 496usize];
    ["Offset of field: job_descriptor::priority"]
        [::std::mem::offset_of!(job_descriptor, priority) - 504usize];
    ["Offset of field: job_descriptor::profile"]
        [::std::mem::offset_of!(job_descriptor, profile) - 508usize];
    ["Offset of field: job_descriptor::qos"]
        [::std::mem::offset_of!(job_descriptor, qos) - 512usize];
    ["Offset of field: job_descriptor::reboot"]
        [::std::mem::offset_of!(job_descriptor, reboot) - 520usize];
    ["Offset of field: job_descriptor::resp_host"]
        [::std::mem::offset_of!(job_descriptor, resp_host) - 528usize];
    ["Offset of field: job_descriptor::restart_cnt"]
        [::std::mem::offset_of!(job_descriptor, restart_cnt) - 536usize];
    ["Offset of field: job_descriptor::req_nodes"]
        [::std::mem::offset_of!(job_descriptor, req_nodes) - 544usize];
    ["Offset of field: job_descriptor::requeue"]
        [::std::mem::offset_of!(job_descriptor, requeue) - 552usize];
    ["Offset of field: job_descriptor::reservation"]
        [::std::mem::offset_of!(job_descriptor, reservation) - 560usize];
    ["Offset of field: job_descriptor::resv_port_cnt"]
        [::std::mem::offset_of!(job_descriptor, resv_port_cnt) - 568usize];
    ["Offset of field: job_descriptor::script"]
        [::std::mem::offset_of!(job_descriptor, script) - 576usize];
    ["Offset of field: job_descriptor::script_buf"]
        [::std::mem::offset_of!(job_descriptor, script_buf) - 584usize];
    ["Offset of field: job_descriptor::script_hash"]
        [::std::mem::offset_of!(job_descriptor, script_hash) - 592usize];
    ["Offset of field: job_descriptor::shared"]
        [::std::mem::offset_of!(job_descriptor, shared) - 626usize];
    ["Offset of field: job_descriptor::site_factor"]
        [::std::mem::offset_of!(job_descriptor, site_factor) - 628usize];
    ["Offset of field: job_descriptor::spank_job_env"]
        [::std::mem::offset_of!(job_descriptor, spank_job_env) - 632usize];
    ["Offset of field: job_descriptor::spank_job_env_size"]
        [::std::mem::offset_of!(job_descriptor, spank_job_env_size) - 640usize];
    ["Offset of field: job_descriptor::submit_line"]
        [::std::mem::offset_of!(job_descriptor, submit_line) - 648usize];
    ["Offset of field: job_descriptor::task_dist"]
        [::std::mem::offset_of!(job_descriptor, task_dist) - 656usize];
    ["Offset of field: job_descriptor::time_limit"]
        [::std::mem::offset_of!(job_descriptor, time_limit) - 660usize];
    ["Offset of field: job_descriptor::time_min"]
        [::std::mem::offset_of!(job_descriptor, time_min) - 664usize];
    ["Offset of field: job_descriptor::tres_bind"]
        [::std::mem::offset_of!(job_descriptor, tres_bind) - 672usize];
    ["Offset of field: job_descriptor::tres_freq"]
        [::std::mem::offset_of!(job_descriptor, tres_freq) - 680usize];
    ["Offset of field: job_descriptor::tres_per_job"]
        [::std::mem::offset_of!(job_descriptor, tres_per_job) - 688usize];
    ["Offset of field: job_descriptor::tres_per_node"]
        [::std::mem::offset_of!(job_descriptor, tres_per_node) - 696usize];
    ["Offset of field: job_descriptor::tres_per_socket"]
        [::std::mem::offset_of!(job_descriptor, tres_per_socket) - 704usize];
    ["Offset of field: job_descriptor::tres_per_task"]
        [::std::mem::offset_of!(job_descriptor, tres_per_task) - 712usize];
    ["Offset of field: job_descriptor::user_id"]
        [::std::mem::offset_of!(job_descriptor, user_id) - 720usize];
    ["Offset of field: job_descriptor::wait_all_nodes"]
        [::std::mem::offset_of!(job_descriptor, wait_all_nodes) - 724usize];
    ["Offset of field: job_descriptor::warn_flags"]
        [::std::mem::offset_of!(job_descriptor, warn_flags) - 726usize];
    ["Offset of field: job_descriptor::warn_signal"]
        [::std::mem::offset_of!(job_descriptor, warn_signal) - 728usize];
    ["Offset of field: job_descriptor::warn_time"]
        [::std::mem::offset_of!(job_descriptor, warn_time) - 730usize];
    ["Offset of field: job_descriptor::work_dir"]
        [::std::mem::offset_of!(job_descriptor, work_dir) - 736usize];
    ["Offset of field: job_descriptor::cpus_per_task"]
        [::std::mem::offset_of!(job_descriptor, cpus_per_task) - 744usize];
    ["Offset of field: job_descriptor::min_cpus"]
        [::std::mem::offset_of!(job_descriptor, min_cpus) - 748usize];
    ["Offset of field: job_descriptor::max_cpus"]
        [::std::mem::offset_of!(job_descriptor, max_cpus) - 752usize];
    ["Offset of field: job_descriptor::min_nodes"]
        [::std::mem::offset_of!(job_descriptor, min_nodes) - 756usize];
    ["Offset of field: job_descriptor::max_nodes"]
        [::std::mem::offset_of!(job_descriptor, max_nodes) - 760usize];
    ["Offset of field: job_descriptor::boards_per_node"]
        [::std::mem::offset_of!(job_descriptor, boards_per_node) - 764usize];
    ["Offset of field: job_descriptor::sockets_per_board"]
        [::std::mem::offset_of!(job_descriptor, sockets_per_board) - 766usize];
    ["Offset of field: job_descriptor::sockets_per_node"]
        [::std::mem::offset_of!(job_descriptor, sockets_per_node) - 768usize];
    ["Offset of field: job_descriptor::cores_per_socket"]
        [::std::mem::offset_of!(job_descriptor, cores_per_socket) - 770usize];
    ["Offset of field: job_descriptor::threads_per_core"]
        [::std::mem::offset_of!(job_descriptor, threads_per_core) - 772usize];
    ["Offset of field: job_descriptor::ntasks_per_node"]
        [::std::mem::offset_of!(job_descriptor, ntasks_per_node) - 774usize];
    ["Offset of field: job_descriptor::ntasks_per_socket"]
        [::std::mem::offset_of!(job_descriptor, ntasks_per_socket) - 776usize];
    ["Offset of field: job_descriptor::ntasks_per_core"]
        [::std::mem::offset_of!(job_descriptor, ntasks_per_core) - 778usize];
    ["Offset of field: job_descriptor::ntasks_per_board"]
        [::std::mem::offset_of!(job_descriptor, ntasks_per_board) - 780usize];
    ["Offset of field: job_descriptor::ntasks_per_tres"]
        [::std::mem::offset_of!(job_descriptor, ntasks_per_tres) - 782usize];
    ["Offset of field: job_descriptor::pn_min_cpus"]
        [::std::mem::offset_of!(job_descriptor, pn_min_cpus) - 784usize];
    ["Offset of field: job_descriptor::pn_min_memory"]
        [::std::mem::offset_of!(job_descriptor, pn_min_memory) - 792usize];
    ["Offset of field: job_descriptor::pn_min_tmp_disk"]
        [::std::mem::offset_of!(job_descriptor, pn_min_tmp_disk) - 800usize];
    ["Offset of field: job_descriptor::req_context"]
        [::std::mem::offset_of!(job_descriptor, req_context) - 808usize];
    ["Offset of field: job_descriptor::req_switch"]
        [::std::mem::offset_of!(job_descriptor, req_switch) - 816usize];
    ["Offset of field: job_descriptor::segment_size"]
        [::std::mem::offset_of!(job_descriptor, segment_size) - 820usize];
    ["Offset of field: job_descriptor::selinux_context"]
        [::std::mem::offset_of!(job_descriptor, selinux_context) - 824usize];
    ["Offset of field: job_descriptor::std_err"]
        [::std::mem::offset_of!(job_descriptor, std_err) - 832usize];
    ["Offset of field: job_descriptor::std_in"]
        [::std::mem::offset_of!(job_descriptor, std_in) - 840usize];
    ["Offset of field: job_descriptor::std_out"]
        [::std::mem::offset_of!(job_descriptor, std_out) - 848usize];
    ["Offset of field: job_descriptor::tres_req_cnt"]
        [::std::mem::offset_of!(job_descriptor, tres_req_cnt) - 856usize];
    ["Offset of field: job_descriptor::wait4switch"]
        [::std::mem::offset_of!(job_descriptor, wait4switch) - 864usize];
    ["Offset of field: job_descriptor::wckey"]
        [::std::mem::offset_of!(job_descriptor, wckey) - 872usize];
    ["Offset of field: job_descriptor::x11"]
        [::std::mem::offset_of!(job_descriptor, x11) - 880usize];
    ["Offset of field: job_descriptor::x11_magic_cookie"]
        [::std::mem::offset_of!(job_descriptor, x11_magic_cookie) - 888usize];
    ["Offset of field: job_descriptor::x11_target"]
        [::std::mem::offset_of!(job_descriptor, x11_target) - 896usize];
    ["Offset of field: job_descriptor::x11_target_port"]
        [::std::mem::offset_of!(job_descriptor, x11_target_port) - 904usize];
};
pub type job_desc_msg_t = job_descriptor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_info {
    pub account: *mut ::std::os::raw::c_char,
    pub accrue_time: time_t,
    pub admin_comment: *mut ::std::os::raw::c_char,
    pub alloc_node: *mut ::std::os::raw::c_char,
    pub alloc_sid: u32,
    pub array_bitmap: *mut bitstr_t,
    pub array_job_id: u32,
    pub array_task_id: u32,
    pub array_max_tasks: u32,
    pub array_task_str: *mut ::std::os::raw::c_char,
    pub assoc_id: u32,
    pub batch_features: *mut ::std::os::raw::c_char,
    pub batch_flag: u16,
    pub batch_host: *mut ::std::os::raw::c_char,
    pub bitflags: u64,
    pub boards_per_node: u16,
    pub burst_buffer: *mut ::std::os::raw::c_char,
    pub burst_buffer_state: *mut ::std::os::raw::c_char,
    pub cluster: *mut ::std::os::raw::c_char,
    pub cluster_features: *mut ::std::os::raw::c_char,
    pub command: *mut ::std::os::raw::c_char,
    pub comment: *mut ::std::os::raw::c_char,
    pub container: *mut ::std::os::raw::c_char,
    pub container_id: *mut ::std::os::raw::c_char,
    pub contiguous: u16,
    pub core_spec: u16,
    pub cores_per_socket: u16,
    pub billable_tres: f64,
    pub cpus_per_task: u16,
    pub cpu_freq_min: u32,
    pub cpu_freq_max: u32,
    pub cpu_freq_gov: u32,
    pub cpus_per_tres: *mut ::std::os::raw::c_char,
    pub cronspec: *mut ::std::os::raw::c_char,
    pub deadline: time_t,
    pub delay_boot: u32,
    pub dependency: *mut ::std::os::raw::c_char,
    pub derived_ec: u32,
    pub eligible_time: time_t,
    pub end_time: time_t,
    pub exc_nodes: *mut ::std::os::raw::c_char,
    pub exc_node_inx: *mut i32,
    pub exit_code: u32,
    pub extra: *mut ::std::os::raw::c_char,
    pub failed_node: *mut ::std::os::raw::c_char,
    pub features: *mut ::std::os::raw::c_char,
    pub fed_origin_str: *mut ::std::os::raw::c_char,
    pub fed_siblings_active: u64,
    pub fed_siblings_active_str: *mut ::std::os::raw::c_char,
    pub fed_siblings_viable: u64,
    pub fed_siblings_viable_str: *mut ::std::os::raw::c_char,
    pub gres_detail_cnt: u32,
    pub gres_detail_str: *mut *mut ::std::os::raw::c_char,
    pub gres_total: *mut ::std::os::raw::c_char,
    pub group_id: u32,
    pub het_job_id: u32,
    pub het_job_id_set: *mut ::std::os::raw::c_char,
    pub het_job_offset: u32,
    pub job_id: u32,
    pub job_resrcs: *mut job_resources_t,
    pub job_size_str: *mut ::std::os::raw::c_char,
    pub job_state: u32,
    pub last_sched_eval: time_t,
    pub licenses: *mut ::std::os::raw::c_char,
    pub mail_type: u16,
    pub mail_user: *mut ::std::os::raw::c_char,
    pub max_cpus: u32,
    pub max_nodes: u32,
    pub mcs_label: *mut ::std::os::raw::c_char,
    pub mem_per_tres: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub network: *mut ::std::os::raw::c_char,
    pub nodes: *mut ::std::os::raw::c_char,
    pub nice: u32,
    pub node_inx: *mut i32,
    pub ntasks_per_core: u16,
    pub ntasks_per_tres: u16,
    pub ntasks_per_node: u16,
    pub ntasks_per_socket: u16,
    pub ntasks_per_board: u16,
    pub num_cpus: u32,
    pub num_nodes: u32,
    pub num_tasks: u32,
    pub oom_kill_step: u16,
    pub partition: *mut ::std::os::raw::c_char,
    pub prefer: *mut ::std::os::raw::c_char,
    pub pn_min_memory: u64,
    pub pn_min_cpus: u16,
    pub pn_min_tmp_disk: u32,
    pub preempt_time: time_t,
    pub preemptable_time: time_t,
    pub pre_sus_time: time_t,
    pub priority: u32,
    pub priority_array: *mut u32,
    pub priority_array_names: *mut ::std::os::raw::c_char,
    pub profile: u32,
    pub qos: *mut ::std::os::raw::c_char,
    pub reboot: u8,
    pub req_nodes: *mut ::std::os::raw::c_char,
    pub req_node_inx: *mut i32,
    pub req_switch: u32,
    pub requeue: u16,
    pub resize_time: time_t,
    pub restart_cnt: u16,
    pub resv_name: *mut ::std::os::raw::c_char,
    pub resv_ports: *mut ::std::os::raw::c_char,
    pub sched_nodes: *mut ::std::os::raw::c_char,
    pub selinux_context: *mut ::std::os::raw::c_char,
    pub shared: u16,
    pub site_factor: u32,
    pub sockets_per_board: u16,
    pub sockets_per_node: u16,
    pub start_time: time_t,
    pub start_protocol_ver: u16,
    pub state_desc: *mut ::std::os::raw::c_char,
    pub state_reason: u32,
    pub std_err: *mut ::std::os::raw::c_char,
    pub std_in: *mut ::std::os::raw::c_char,
    pub std_out: *mut ::std::os::raw::c_char,
    pub submit_time: time_t,
    pub suspend_time: time_t,
    pub system_comment: *mut ::std::os::raw::c_char,
    pub time_limit: u32,
    pub time_min: u32,
    pub threads_per_core: u16,
    pub tres_bind: *mut ::std::os::raw::c_char,
    pub tres_freq: *mut ::std::os::raw::c_char,
    pub tres_per_job: *mut ::std::os::raw::c_char,
    pub tres_per_node: *mut ::std::os::raw::c_char,
    pub tres_per_socket: *mut ::std::os::raw::c_char,
    pub tres_per_task: *mut ::std::os::raw::c_char,
    pub tres_req_str: *mut ::std::os::raw::c_char,
    pub tres_alloc_str: *mut ::std::os::raw::c_char,
    pub user_id: u32,
    pub user_name: *mut ::std::os::raw::c_char,
    pub wait4switch: u32,
    pub wckey: *mut ::std::os::raw::c_char,
    pub work_dir: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_info"][::std::mem::size_of::<job_info>() - 960usize];
    ["Alignment of job_info"][::std::mem::align_of::<job_info>() - 8usize];
    ["Offset of field: job_info::account"][::std::mem::offset_of!(job_info, account) - 0usize];
    ["Offset of field: job_info::accrue_time"]
        [::std::mem::offset_of!(job_info, accrue_time) - 8usize];
    ["Offset of field: job_info::admin_comment"]
        [::std::mem::offset_of!(job_info, admin_comment) - 16usize];
    ["Offset of field: job_info::alloc_node"]
        [::std::mem::offset_of!(job_info, alloc_node) - 24usize];
    ["Offset of field: job_info::alloc_sid"][::std::mem::offset_of!(job_info, alloc_sid) - 32usize];
    ["Offset of field: job_info::array_bitmap"]
        [::std::mem::offset_of!(job_info, array_bitmap) - 40usize];
    ["Offset of field: job_info::array_job_id"]
        [::std::mem::offset_of!(job_info, array_job_id) - 48usize];
    ["Offset of field: job_info::array_task_id"]
        [::std::mem::offset_of!(job_info, array_task_id) - 52usize];
    ["Offset of field: job_info::array_max_tasks"]
        [::std::mem::offset_of!(job_info, array_max_tasks) - 56usize];
    ["Offset of field: job_info::array_task_str"]
        [::std::mem::offset_of!(job_info, array_task_str) - 64usize];
    ["Offset of field: job_info::assoc_id"][::std::mem::offset_of!(job_info, assoc_id) - 72usize];
    ["Offset of field: job_info::batch_features"]
        [::std::mem::offset_of!(job_info, batch_features) - 80usize];
    ["Offset of field: job_info::batch_flag"]
        [::std::mem::offset_of!(job_info, batch_flag) - 88usize];
    ["Offset of field: job_info::batch_host"]
        [::std::mem::offset_of!(job_info, batch_host) - 96usize];
    ["Offset of field: job_info::bitflags"][::std::mem::offset_of!(job_info, bitflags) - 104usize];
    ["Offset of field: job_info::boards_per_node"]
        [::std::mem::offset_of!(job_info, boards_per_node) - 112usize];
    ["Offset of field: job_info::burst_buffer"]
        [::std::mem::offset_of!(job_info, burst_buffer) - 120usize];
    ["Offset of field: job_info::burst_buffer_state"]
        [::std::mem::offset_of!(job_info, burst_buffer_state) - 128usize];
    ["Offset of field: job_info::cluster"][::std::mem::offset_of!(job_info, cluster) - 136usize];
    ["Offset of field: job_info::cluster_features"]
        [::std::mem::offset_of!(job_info, cluster_features) - 144usize];
    ["Offset of field: job_info::command"][::std::mem::offset_of!(job_info, command) - 152usize];
    ["Offset of field: job_info::comment"][::std::mem::offset_of!(job_info, comment) - 160usize];
    ["Offset of field: job_info::container"]
        [::std::mem::offset_of!(job_info, container) - 168usize];
    ["Offset of field: job_info::container_id"]
        [::std::mem::offset_of!(job_info, container_id) - 176usize];
    ["Offset of field: job_info::contiguous"]
        [::std::mem::offset_of!(job_info, contiguous) - 184usize];
    ["Offset of field: job_info::core_spec"]
        [::std::mem::offset_of!(job_info, core_spec) - 186usize];
    ["Offset of field: job_info::cores_per_socket"]
        [::std::mem::offset_of!(job_info, cores_per_socket) - 188usize];
    ["Offset of field: job_info::billable_tres"]
        [::std::mem::offset_of!(job_info, billable_tres) - 192usize];
    ["Offset of field: job_info::cpus_per_task"]
        [::std::mem::offset_of!(job_info, cpus_per_task) - 200usize];
    ["Offset of field: job_info::cpu_freq_min"]
        [::std::mem::offset_of!(job_info, cpu_freq_min) - 204usize];
    ["Offset of field: job_info::cpu_freq_max"]
        [::std::mem::offset_of!(job_info, cpu_freq_max) - 208usize];
    ["Offset of field: job_info::cpu_freq_gov"]
        [::std::mem::offset_of!(job_info, cpu_freq_gov) - 212usize];
    ["Offset of field: job_info::cpus_per_tres"]
        [::std::mem::offset_of!(job_info, cpus_per_tres) - 216usize];
    ["Offset of field: job_info::cronspec"][::std::mem::offset_of!(job_info, cronspec) - 224usize];
    ["Offset of field: job_info::deadline"][::std::mem::offset_of!(job_info, deadline) - 232usize];
    ["Offset of field: job_info::delay_boot"]
        [::std::mem::offset_of!(job_info, delay_boot) - 240usize];
    ["Offset of field: job_info::dependency"]
        [::std::mem::offset_of!(job_info, dependency) - 248usize];
    ["Offset of field: job_info::derived_ec"]
        [::std::mem::offset_of!(job_info, derived_ec) - 256usize];
    ["Offset of field: job_info::eligible_time"]
        [::std::mem::offset_of!(job_info, eligible_time) - 264usize];
    ["Offset of field: job_info::end_time"][::std::mem::offset_of!(job_info, end_time) - 272usize];
    ["Offset of field: job_info::exc_nodes"]
        [::std::mem::offset_of!(job_info, exc_nodes) - 280usize];
    ["Offset of field: job_info::exc_node_inx"]
        [::std::mem::offset_of!(job_info, exc_node_inx) - 288usize];
    ["Offset of field: job_info::exit_code"]
        [::std::mem::offset_of!(job_info, exit_code) - 296usize];
    ["Offset of field: job_info::extra"][::std::mem::offset_of!(job_info, extra) - 304usize];
    ["Offset of field: job_info::failed_node"]
        [::std::mem::offset_of!(job_info, failed_node) - 312usize];
    ["Offset of field: job_info::features"][::std::mem::offset_of!(job_info, features) - 320usize];
    ["Offset of field: job_info::fed_origin_str"]
        [::std::mem::offset_of!(job_info, fed_origin_str) - 328usize];
    ["Offset of field: job_info::fed_siblings_active"]
        [::std::mem::offset_of!(job_info, fed_siblings_active) - 336usize];
    ["Offset of field: job_info::fed_siblings_active_str"]
        [::std::mem::offset_of!(job_info, fed_siblings_active_str) - 344usize];
    ["Offset of field: job_info::fed_siblings_viable"]
        [::std::mem::offset_of!(job_info, fed_siblings_viable) - 352usize];
    ["Offset of field: job_info::fed_siblings_viable_str"]
        [::std::mem::offset_of!(job_info, fed_siblings_viable_str) - 360usize];
    ["Offset of field: job_info::gres_detail_cnt"]
        [::std::mem::offset_of!(job_info, gres_detail_cnt) - 368usize];
    ["Offset of field: job_info::gres_detail_str"]
        [::std::mem::offset_of!(job_info, gres_detail_str) - 376usize];
    ["Offset of field: job_info::gres_total"]
        [::std::mem::offset_of!(job_info, gres_total) - 384usize];
    ["Offset of field: job_info::group_id"][::std::mem::offset_of!(job_info, group_id) - 392usize];
    ["Offset of field: job_info::het_job_id"]
        [::std::mem::offset_of!(job_info, het_job_id) - 396usize];
    ["Offset of field: job_info::het_job_id_set"]
        [::std::mem::offset_of!(job_info, het_job_id_set) - 400usize];
    ["Offset of field: job_info::het_job_offset"]
        [::std::mem::offset_of!(job_info, het_job_offset) - 408usize];
    ["Offset of field: job_info::job_id"][::std::mem::offset_of!(job_info, job_id) - 412usize];
    ["Offset of field: job_info::job_resrcs"]
        [::std::mem::offset_of!(job_info, job_resrcs) - 416usize];
    ["Offset of field: job_info::job_size_str"]
        [::std::mem::offset_of!(job_info, job_size_str) - 424usize];
    ["Offset of field: job_info::job_state"]
        [::std::mem::offset_of!(job_info, job_state) - 432usize];
    ["Offset of field: job_info::last_sched_eval"]
        [::std::mem::offset_of!(job_info, last_sched_eval) - 440usize];
    ["Offset of field: job_info::licenses"][::std::mem::offset_of!(job_info, licenses) - 448usize];
    ["Offset of field: job_info::mail_type"]
        [::std::mem::offset_of!(job_info, mail_type) - 456usize];
    ["Offset of field: job_info::mail_user"]
        [::std::mem::offset_of!(job_info, mail_user) - 464usize];
    ["Offset of field: job_info::max_cpus"][::std::mem::offset_of!(job_info, max_cpus) - 472usize];
    ["Offset of field: job_info::max_nodes"]
        [::std::mem::offset_of!(job_info, max_nodes) - 476usize];
    ["Offset of field: job_info::mcs_label"]
        [::std::mem::offset_of!(job_info, mcs_label) - 480usize];
    ["Offset of field: job_info::mem_per_tres"]
        [::std::mem::offset_of!(job_info, mem_per_tres) - 488usize];
    ["Offset of field: job_info::name"][::std::mem::offset_of!(job_info, name) - 496usize];
    ["Offset of field: job_info::network"][::std::mem::offset_of!(job_info, network) - 504usize];
    ["Offset of field: job_info::nodes"][::std::mem::offset_of!(job_info, nodes) - 512usize];
    ["Offset of field: job_info::nice"][::std::mem::offset_of!(job_info, nice) - 520usize];
    ["Offset of field: job_info::node_inx"][::std::mem::offset_of!(job_info, node_inx) - 528usize];
    ["Offset of field: job_info::ntasks_per_core"]
        [::std::mem::offset_of!(job_info, ntasks_per_core) - 536usize];
    ["Offset of field: job_info::ntasks_per_tres"]
        [::std::mem::offset_of!(job_info, ntasks_per_tres) - 538usize];
    ["Offset of field: job_info::ntasks_per_node"]
        [::std::mem::offset_of!(job_info, ntasks_per_node) - 540usize];
    ["Offset of field: job_info::ntasks_per_socket"]
        [::std::mem::offset_of!(job_info, ntasks_per_socket) - 542usize];
    ["Offset of field: job_info::ntasks_per_board"]
        [::std::mem::offset_of!(job_info, ntasks_per_board) - 544usize];
    ["Offset of field: job_info::num_cpus"][::std::mem::offset_of!(job_info, num_cpus) - 548usize];
    ["Offset of field: job_info::num_nodes"]
        [::std::mem::offset_of!(job_info, num_nodes) - 552usize];
    ["Offset of field: job_info::num_tasks"]
        [::std::mem::offset_of!(job_info, num_tasks) - 556usize];
    ["Offset of field: job_info::oom_kill_step"]
        [::std::mem::offset_of!(job_info, oom_kill_step) - 560usize];
    ["Offset of field: job_info::partition"]
        [::std::mem::offset_of!(job_info, partition) - 568usize];
    ["Offset of field: job_info::prefer"][::std::mem::offset_of!(job_info, prefer) - 576usize];
    ["Offset of field: job_info::pn_min_memory"]
        [::std::mem::offset_of!(job_info, pn_min_memory) - 584usize];
    ["Offset of field: job_info::pn_min_cpus"]
        [::std::mem::offset_of!(job_info, pn_min_cpus) - 592usize];
    ["Offset of field: job_info::pn_min_tmp_disk"]
        [::std::mem::offset_of!(job_info, pn_min_tmp_disk) - 596usize];
    ["Offset of field: job_info::preempt_time"]
        [::std::mem::offset_of!(job_info, preempt_time) - 600usize];
    ["Offset of field: job_info::preemptable_time"]
        [::std::mem::offset_of!(job_info, preemptable_time) - 608usize];
    ["Offset of field: job_info::pre_sus_time"]
        [::std::mem::offset_of!(job_info, pre_sus_time) - 616usize];
    ["Offset of field: job_info::priority"][::std::mem::offset_of!(job_info, priority) - 624usize];
    ["Offset of field: job_info::priority_array"]
        [::std::mem::offset_of!(job_info, priority_array) - 632usize];
    ["Offset of field: job_info::priority_array_names"]
        [::std::mem::offset_of!(job_info, priority_array_names) - 640usize];
    ["Offset of field: job_info::profile"][::std::mem::offset_of!(job_info, profile) - 648usize];
    ["Offset of field: job_info::qos"][::std::mem::offset_of!(job_info, qos) - 656usize];
    ["Offset of field: job_info::reboot"][::std::mem::offset_of!(job_info, reboot) - 664usize];
    ["Offset of field: job_info::req_nodes"]
        [::std::mem::offset_of!(job_info, req_nodes) - 672usize];
    ["Offset of field: job_info::req_node_inx"]
        [::std::mem::offset_of!(job_info, req_node_inx) - 680usize];
    ["Offset of field: job_info::req_switch"]
        [::std::mem::offset_of!(job_info, req_switch) - 688usize];
    ["Offset of field: job_info::requeue"][::std::mem::offset_of!(job_info, requeue) - 692usize];
    ["Offset of field: job_info::resize_time"]
        [::std::mem::offset_of!(job_info, resize_time) - 696usize];
    ["Offset of field: job_info::restart_cnt"]
        [::std::mem::offset_of!(job_info, restart_cnt) - 704usize];
    ["Offset of field: job_info::resv_name"]
        [::std::mem::offset_of!(job_info, resv_name) - 712usize];
    ["Offset of field: job_info::resv_ports"]
        [::std::mem::offset_of!(job_info, resv_ports) - 720usize];
    ["Offset of field: job_info::sched_nodes"]
        [::std::mem::offset_of!(job_info, sched_nodes) - 728usize];
    ["Offset of field: job_info::selinux_context"]
        [::std::mem::offset_of!(job_info, selinux_context) - 736usize];
    ["Offset of field: job_info::shared"][::std::mem::offset_of!(job_info, shared) - 744usize];
    ["Offset of field: job_info::site_factor"]
        [::std::mem::offset_of!(job_info, site_factor) - 748usize];
    ["Offset of field: job_info::sockets_per_board"]
        [::std::mem::offset_of!(job_info, sockets_per_board) - 752usize];
    ["Offset of field: job_info::sockets_per_node"]
        [::std::mem::offset_of!(job_info, sockets_per_node) - 754usize];
    ["Offset of field: job_info::start_time"]
        [::std::mem::offset_of!(job_info, start_time) - 760usize];
    ["Offset of field: job_info::start_protocol_ver"]
        [::std::mem::offset_of!(job_info, start_protocol_ver) - 768usize];
    ["Offset of field: job_info::state_desc"]
        [::std::mem::offset_of!(job_info, state_desc) - 776usize];
    ["Offset of field: job_info::state_reason"]
        [::std::mem::offset_of!(job_info, state_reason) - 784usize];
    ["Offset of field: job_info::std_err"][::std::mem::offset_of!(job_info, std_err) - 792usize];
    ["Offset of field: job_info::std_in"][::std::mem::offset_of!(job_info, std_in) - 800usize];
    ["Offset of field: job_info::std_out"][::std::mem::offset_of!(job_info, std_out) - 808usize];
    ["Offset of field: job_info::submit_time"]
        [::std::mem::offset_of!(job_info, submit_time) - 816usize];
    ["Offset of field: job_info::suspend_time"]
        [::std::mem::offset_of!(job_info, suspend_time) - 824usize];
    ["Offset of field: job_info::system_comment"]
        [::std::mem::offset_of!(job_info, system_comment) - 832usize];
    ["Offset of field: job_info::time_limit"]
        [::std::mem::offset_of!(job_info, time_limit) - 840usize];
    ["Offset of field: job_info::time_min"][::std::mem::offset_of!(job_info, time_min) - 844usize];
    ["Offset of field: job_info::threads_per_core"]
        [::std::mem::offset_of!(job_info, threads_per_core) - 848usize];
    ["Offset of field: job_info::tres_bind"]
        [::std::mem::offset_of!(job_info, tres_bind) - 856usize];
    ["Offset of field: job_info::tres_freq"]
        [::std::mem::offset_of!(job_info, tres_freq) - 864usize];
    ["Offset of field: job_info::tres_per_job"]
        [::std::mem::offset_of!(job_info, tres_per_job) - 872usize];
    ["Offset of field: job_info::tres_per_node"]
        [::std::mem::offset_of!(job_info, tres_per_node) - 880usize];
    ["Offset of field: job_info::tres_per_socket"]
        [::std::mem::offset_of!(job_info, tres_per_socket) - 888usize];
    ["Offset of field: job_info::tres_per_task"]
        [::std::mem::offset_of!(job_info, tres_per_task) - 896usize];
    ["Offset of field: job_info::tres_req_str"]
        [::std::mem::offset_of!(job_info, tres_req_str) - 904usize];
    ["Offset of field: job_info::tres_alloc_str"]
        [::std::mem::offset_of!(job_info, tres_alloc_str) - 912usize];
    ["Offset of field: job_info::user_id"][::std::mem::offset_of!(job_info, user_id) - 920usize];
    ["Offset of field: job_info::user_name"]
        [::std::mem::offset_of!(job_info, user_name) - 928usize];
    ["Offset of field: job_info::wait4switch"]
        [::std::mem::offset_of!(job_info, wait4switch) - 936usize];
    ["Offset of field: job_info::wckey"][::std::mem::offset_of!(job_info, wckey) - 944usize];
    ["Offset of field: job_info::work_dir"][::std::mem::offset_of!(job_info, work_dir) - 952usize];
};
pub type slurm_job_info_t = job_info;
pub type job_info_t = slurm_job_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct priority_factors_t {
    pub nice: u32,
    pub priority_age: f64,
    pub priority_assoc: f64,
    pub priority_fs: f64,
    pub priority_js: f64,
    pub priority_part: f64,
    pub priority_qos: f64,
    pub priority_site: u32,
    pub priority_tres: *mut f64,
    pub tres_cnt: u32,
    pub tres_names: *mut *mut ::std::os::raw::c_char,
    pub tres_weights: *mut f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of priority_factors_t"][::std::mem::size_of::<priority_factors_t>() - 96usize];
    ["Alignment of priority_factors_t"][::std::mem::align_of::<priority_factors_t>() - 8usize];
    ["Offset of field: priority_factors_t::nice"]
        [::std::mem::offset_of!(priority_factors_t, nice) - 0usize];
    ["Offset of field: priority_factors_t::priority_age"]
        [::std::mem::offset_of!(priority_factors_t, priority_age) - 8usize];
    ["Offset of field: priority_factors_t::priority_assoc"]
        [::std::mem::offset_of!(priority_factors_t, priority_assoc) - 16usize];
    ["Offset of field: priority_factors_t::priority_fs"]
        [::std::mem::offset_of!(priority_factors_t, priority_fs) - 24usize];
    ["Offset of field: priority_factors_t::priority_js"]
        [::std::mem::offset_of!(priority_factors_t, priority_js) - 32usize];
    ["Offset of field: priority_factors_t::priority_part"]
        [::std::mem::offset_of!(priority_factors_t, priority_part) - 40usize];
    ["Offset of field: priority_factors_t::priority_qos"]
        [::std::mem::offset_of!(priority_factors_t, priority_qos) - 48usize];
    ["Offset of field: priority_factors_t::priority_site"]
        [::std::mem::offset_of!(priority_factors_t, priority_site) - 56usize];
    ["Offset of field: priority_factors_t::priority_tres"]
        [::std::mem::offset_of!(priority_factors_t, priority_tres) - 64usize];
    ["Offset of field: priority_factors_t::tres_cnt"]
        [::std::mem::offset_of!(priority_factors_t, tres_cnt) - 72usize];
    ["Offset of field: priority_factors_t::tres_names"]
        [::std::mem::offset_of!(priority_factors_t, tres_names) - 80usize];
    ["Offset of field: priority_factors_t::tres_weights"]
        [::std::mem::offset_of!(priority_factors_t, tres_weights) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct priority_factors_object {
    pub account: *mut ::std::os::raw::c_char,
    pub cluster_name: *mut ::std::os::raw::c_char,
    pub direct_prio: f64,
    pub job_id: u32,
    pub partition: *mut ::std::os::raw::c_char,
    pub prio_factors: *mut priority_factors_t,
    pub qos: *mut ::std::os::raw::c_char,
    pub user_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of priority_factors_object"][::std::mem::size_of::<priority_factors_object>() - 64usize];
    ["Alignment of priority_factors_object"]
        [::std::mem::align_of::<priority_factors_object>() - 8usize];
    ["Offset of field: priority_factors_object::account"]
        [::std::mem::offset_of!(priority_factors_object, account) - 0usize];
    ["Offset of field: priority_factors_object::cluster_name"]
        [::std::mem::offset_of!(priority_factors_object, cluster_name) - 8usize];
    ["Offset of field: priority_factors_object::direct_prio"]
        [::std::mem::offset_of!(priority_factors_object, direct_prio) - 16usize];
    ["Offset of field: priority_factors_object::job_id"]
        [::std::mem::offset_of!(priority_factors_object, job_id) - 24usize];
    ["Offset of field: priority_factors_object::partition"]
        [::std::mem::offset_of!(priority_factors_object, partition) - 32usize];
    ["Offset of field: priority_factors_object::prio_factors"]
        [::std::mem::offset_of!(priority_factors_object, prio_factors) - 40usize];
    ["Offset of field: priority_factors_object::qos"]
        [::std::mem::offset_of!(priority_factors_object, qos) - 48usize];
    ["Offset of field: priority_factors_object::user_id"]
        [::std::mem::offset_of!(priority_factors_object, user_id) - 56usize];
};
pub type priority_factors_object_t = priority_factors_object;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct priority_factors_response_msg {
    pub priority_factors_list: *mut list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of priority_factors_response_msg"]
        [::std::mem::size_of::<priority_factors_response_msg>() - 8usize];
    ["Alignment of priority_factors_response_msg"]
        [::std::mem::align_of::<priority_factors_response_msg>() - 8usize];
    ["Offset of field: priority_factors_response_msg::priority_factors_list"]
        [::std::mem::offset_of!(priority_factors_response_msg, priority_factors_list) - 0usize];
};
pub type priority_factors_response_msg_t = priority_factors_response_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_info_msg {
    pub last_backfill: time_t,
    pub last_update: time_t,
    pub record_count: u32,
    pub job_array: *mut slurm_job_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_info_msg"][::std::mem::size_of::<job_info_msg>() - 32usize];
    ["Alignment of job_info_msg"][::std::mem::align_of::<job_info_msg>() - 8usize];
    ["Offset of field: job_info_msg::last_backfill"]
        [::std::mem::offset_of!(job_info_msg, last_backfill) - 0usize];
    ["Offset of field: job_info_msg::last_update"]
        [::std::mem::offset_of!(job_info_msg, last_update) - 8usize];
    ["Offset of field: job_info_msg::record_count"]
        [::std::mem::offset_of!(job_info_msg, record_count) - 16usize];
    ["Offset of field: job_info_msg::job_array"]
        [::std::mem::offset_of!(job_info_msg, job_array) - 24usize];
};
pub type job_info_msg_t = job_info_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct listjobs_info {
    pub job_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of listjobs_info"][::std::mem::size_of::<listjobs_info>() - 4usize];
    ["Alignment of listjobs_info"][::std::mem::align_of::<listjobs_info>() - 4usize];
    ["Offset of field: listjobs_info::job_id"]
        [::std::mem::offset_of!(listjobs_info, job_id) - 0usize];
};
pub type listjobs_info_t = listjobs_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct listpids_info {
    pub global_task_id: u32,
    pub job_id: u32,
    pub local_task_id: u32,
    pub pid: pid_t,
    pub step_id: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of listpids_info"][::std::mem::size_of::<listpids_info>() - 24usize];
    ["Alignment of listpids_info"][::std::mem::align_of::<listpids_info>() - 8usize];
    ["Offset of field: listpids_info::global_task_id"]
        [::std::mem::offset_of!(listpids_info, global_task_id) - 0usize];
    ["Offset of field: listpids_info::job_id"]
        [::std::mem::offset_of!(listpids_info, job_id) - 4usize];
    ["Offset of field: listpids_info::local_task_id"]
        [::std::mem::offset_of!(listpids_info, local_task_id) - 8usize];
    ["Offset of field: listpids_info::pid"][::std::mem::offset_of!(listpids_info, pid) - 12usize];
    ["Offset of field: listpids_info::step_id"]
        [::std::mem::offset_of!(listpids_info, step_id) - 16usize];
};
pub type listpids_info_t = listpids_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct liststeps_info {
    pub job_id: u32,
    pub step_id: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of liststeps_info"][::std::mem::size_of::<liststeps_info>() - 16usize];
    ["Alignment of liststeps_info"][::std::mem::align_of::<liststeps_info>() - 8usize];
    ["Offset of field: liststeps_info::job_id"]
        [::std::mem::offset_of!(liststeps_info, job_id) - 0usize];
    ["Offset of field: liststeps_info::step_id"]
        [::std::mem::offset_of!(liststeps_info, step_id) - 8usize];
};
pub type liststeps_info_t = liststeps_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_state_response_job_t {
    pub job_id: u32,
    pub array_job_id: u32,
    pub array_task_id: u32,
    pub array_task_id_bitmap: *mut bitstr_t,
    pub het_job_id: u32,
    pub state: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_state_response_job_t"]
        [::std::mem::size_of::<job_state_response_job_t>() - 32usize];
    ["Alignment of job_state_response_job_t"]
        [::std::mem::align_of::<job_state_response_job_t>() - 8usize];
    ["Offset of field: job_state_response_job_t::job_id"]
        [::std::mem::offset_of!(job_state_response_job_t, job_id) - 0usize];
    ["Offset of field: job_state_response_job_t::array_job_id"]
        [::std::mem::offset_of!(job_state_response_job_t, array_job_id) - 4usize];
    ["Offset of field: job_state_response_job_t::array_task_id"]
        [::std::mem::offset_of!(job_state_response_job_t, array_task_id) - 8usize];
    ["Offset of field: job_state_response_job_t::array_task_id_bitmap"]
        [::std::mem::offset_of!(job_state_response_job_t, array_task_id_bitmap) - 16usize];
    ["Offset of field: job_state_response_job_t::het_job_id"]
        [::std::mem::offset_of!(job_state_response_job_t, het_job_id) - 24usize];
    ["Offset of field: job_state_response_job_t::state"]
        [::std::mem::offset_of!(job_state_response_job_t, state) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_state_response_msg_t {
    pub jobs_count: u32,
    pub jobs: *mut job_state_response_job_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_state_response_msg_t"]
        [::std::mem::size_of::<job_state_response_msg_t>() - 16usize];
    ["Alignment of job_state_response_msg_t"]
        [::std::mem::align_of::<job_state_response_msg_t>() - 8usize];
    ["Offset of field: job_state_response_msg_t::jobs_count"]
        [::std::mem::offset_of!(job_state_response_msg_t, jobs_count) - 0usize];
    ["Offset of field: job_state_response_msg_t::jobs"]
        [::std::mem::offset_of!(job_state_response_msg_t, jobs) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct step_update_request_msg {
    pub job_id: u32,
    pub step_id: u32,
    pub time_limit: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of step_update_request_msg"][::std::mem::size_of::<step_update_request_msg>() - 12usize];
    ["Alignment of step_update_request_msg"]
        [::std::mem::align_of::<step_update_request_msg>() - 4usize];
    ["Offset of field: step_update_request_msg::job_id"]
        [::std::mem::offset_of!(step_update_request_msg, job_id) - 0usize];
    ["Offset of field: step_update_request_msg::step_id"]
        [::std::mem::offset_of!(step_update_request_msg, step_id) - 4usize];
    ["Offset of field: step_update_request_msg::time_limit"]
        [::std::mem::offset_of!(step_update_request_msg, time_limit) - 8usize];
};
pub type step_update_request_msg_t = step_update_request_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct suspend_exc_update_msg {
    pub update_str: *mut ::std::os::raw::c_char,
    pub mode: update_mode_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of suspend_exc_update_msg"][::std::mem::size_of::<suspend_exc_update_msg>() - 16usize];
    ["Alignment of suspend_exc_update_msg"]
        [::std::mem::align_of::<suspend_exc_update_msg>() - 8usize];
    ["Offset of field: suspend_exc_update_msg::update_str"]
        [::std::mem::offset_of!(suspend_exc_update_msg, update_str) - 0usize];
    ["Offset of field: suspend_exc_update_msg::mode"]
        [::std::mem::offset_of!(suspend_exc_update_msg, mode) - 8usize];
};
pub type suspend_exc_update_msg_t = suspend_exc_update_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_layout_req_t {
    pub node_list: *mut ::std::os::raw::c_char,
    pub cpus_per_node: *mut u16,
    pub cpu_count_reps: *mut u32,
    pub num_hosts: u32,
    pub num_tasks: u32,
    pub cpus_per_task: *mut u16,
    pub cpus_task_reps: *mut u32,
    pub task_dist: u32,
    pub plane_size: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_layout_req_t"][::std::mem::size_of::<slurm_step_layout_req_t>() - 56usize];
    ["Alignment of slurm_step_layout_req_t"]
        [::std::mem::align_of::<slurm_step_layout_req_t>() - 8usize];
    ["Offset of field: slurm_step_layout_req_t::node_list"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, node_list) - 0usize];
    ["Offset of field: slurm_step_layout_req_t::cpus_per_node"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, cpus_per_node) - 8usize];
    ["Offset of field: slurm_step_layout_req_t::cpu_count_reps"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, cpu_count_reps) - 16usize];
    ["Offset of field: slurm_step_layout_req_t::num_hosts"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, num_hosts) - 24usize];
    ["Offset of field: slurm_step_layout_req_t::num_tasks"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, num_tasks) - 28usize];
    ["Offset of field: slurm_step_layout_req_t::cpus_per_task"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, cpus_per_task) - 32usize];
    ["Offset of field: slurm_step_layout_req_t::cpus_task_reps"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, cpus_task_reps) - 40usize];
    ["Offset of field: slurm_step_layout_req_t::task_dist"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, task_dist) - 48usize];
    ["Offset of field: slurm_step_layout_req_t::plane_size"]
        [::std::mem::offset_of!(slurm_step_layout_req_t, plane_size) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_layout {
    pub cpt_compact_array: *mut u16,
    pub cpt_compact_cnt: u32,
    pub cpt_compact_reps: *mut u32,
    pub front_end: *mut ::std::os::raw::c_char,
    pub alias_addrs: *mut slurm_node_alias_addrs_t,
    pub node_cnt: u32,
    pub node_list: *mut ::std::os::raw::c_char,
    pub plane_size: u16,
    pub start_protocol_ver: u16,
    pub tasks: *mut u16,
    pub task_cnt: u32,
    pub task_dist: u32,
    pub tids: *mut *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_layout"][::std::mem::size_of::<slurm_step_layout>() - 88usize];
    ["Alignment of slurm_step_layout"][::std::mem::align_of::<slurm_step_layout>() - 8usize];
    ["Offset of field: slurm_step_layout::cpt_compact_array"]
        [::std::mem::offset_of!(slurm_step_layout, cpt_compact_array) - 0usize];
    ["Offset of field: slurm_step_layout::cpt_compact_cnt"]
        [::std::mem::offset_of!(slurm_step_layout, cpt_compact_cnt) - 8usize];
    ["Offset of field: slurm_step_layout::cpt_compact_reps"]
        [::std::mem::offset_of!(slurm_step_layout, cpt_compact_reps) - 16usize];
    ["Offset of field: slurm_step_layout::front_end"]
        [::std::mem::offset_of!(slurm_step_layout, front_end) - 24usize];
    ["Offset of field: slurm_step_layout::alias_addrs"]
        [::std::mem::offset_of!(slurm_step_layout, alias_addrs) - 32usize];
    ["Offset of field: slurm_step_layout::node_cnt"]
        [::std::mem::offset_of!(slurm_step_layout, node_cnt) - 40usize];
    ["Offset of field: slurm_step_layout::node_list"]
        [::std::mem::offset_of!(slurm_step_layout, node_list) - 48usize];
    ["Offset of field: slurm_step_layout::plane_size"]
        [::std::mem::offset_of!(slurm_step_layout, plane_size) - 56usize];
    ["Offset of field: slurm_step_layout::start_protocol_ver"]
        [::std::mem::offset_of!(slurm_step_layout, start_protocol_ver) - 58usize];
    ["Offset of field: slurm_step_layout::tasks"]
        [::std::mem::offset_of!(slurm_step_layout, tasks) - 64usize];
    ["Offset of field: slurm_step_layout::task_cnt"]
        [::std::mem::offset_of!(slurm_step_layout, task_cnt) - 72usize];
    ["Offset of field: slurm_step_layout::task_dist"]
        [::std::mem::offset_of!(slurm_step_layout, task_dist) - 76usize];
    ["Offset of field: slurm_step_layout::tids"]
        [::std::mem::offset_of!(slurm_step_layout, tids) - 80usize];
};
pub type slurm_step_layout_t = slurm_step_layout;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_id_msg {
    pub sluid: sluid_t,
    pub job_id: u32,
    pub step_het_comp: u32,
    pub step_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_id_msg"][::std::mem::size_of::<slurm_step_id_msg>() - 24usize];
    ["Alignment of slurm_step_id_msg"][::std::mem::align_of::<slurm_step_id_msg>() - 8usize];
    ["Offset of field: slurm_step_id_msg::sluid"]
        [::std::mem::offset_of!(slurm_step_id_msg, sluid) - 0usize];
    ["Offset of field: slurm_step_id_msg::job_id"]
        [::std::mem::offset_of!(slurm_step_id_msg, job_id) - 8usize];
    ["Offset of field: slurm_step_id_msg::step_het_comp"]
        [::std::mem::offset_of!(slurm_step_id_msg, step_het_comp) - 12usize];
    ["Offset of field: slurm_step_id_msg::step_id"]
        [::std::mem::offset_of!(slurm_step_id_msg, step_id) - 16usize];
};
pub type slurm_step_id_t = slurm_step_id_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_io_fds {
    pub input: slurm_step_io_fds__bindgen_ty_1,
    pub out: slurm_step_io_fds__bindgen_ty_1,
    pub err: slurm_step_io_fds__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_io_fds__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub taskid: u32,
    pub nodeid: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_io_fds__bindgen_ty_1"]
        [::std::mem::size_of::<slurm_step_io_fds__bindgen_ty_1>() - 12usize];
    ["Alignment of slurm_step_io_fds__bindgen_ty_1"]
        [::std::mem::align_of::<slurm_step_io_fds__bindgen_ty_1>() - 4usize];
    ["Offset of field: slurm_step_io_fds__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(slurm_step_io_fds__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: slurm_step_io_fds__bindgen_ty_1::taskid"]
        [::std::mem::offset_of!(slurm_step_io_fds__bindgen_ty_1, taskid) - 4usize];
    ["Offset of field: slurm_step_io_fds__bindgen_ty_1::nodeid"]
        [::std::mem::offset_of!(slurm_step_io_fds__bindgen_ty_1, nodeid) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_io_fds"][::std::mem::size_of::<slurm_step_io_fds>() - 36usize];
    ["Alignment of slurm_step_io_fds"][::std::mem::align_of::<slurm_step_io_fds>() - 4usize];
    ["Offset of field: slurm_step_io_fds::input"]
        [::std::mem::offset_of!(slurm_step_io_fds, input) - 0usize];
    ["Offset of field: slurm_step_io_fds::out"]
        [::std::mem::offset_of!(slurm_step_io_fds, out) - 12usize];
    ["Offset of field: slurm_step_io_fds::err"]
        [::std::mem::offset_of!(slurm_step_io_fds, err) - 24usize];
};
pub type slurm_step_io_fds_t = slurm_step_io_fds;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct launch_tasks_response_msg {
    pub return_code: u32,
    pub node_name: *mut ::std::os::raw::c_char,
    pub srun_node_id: u32,
    pub count_of_pids: u32,
    pub local_pids: *mut u32,
    pub step_id: slurm_step_id_t,
    pub task_ids: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of launch_tasks_response_msg"]
        [::std::mem::size_of::<launch_tasks_response_msg>() - 64usize];
    ["Alignment of launch_tasks_response_msg"]
        [::std::mem::align_of::<launch_tasks_response_msg>() - 8usize];
    ["Offset of field: launch_tasks_response_msg::return_code"]
        [::std::mem::offset_of!(launch_tasks_response_msg, return_code) - 0usize];
    ["Offset of field: launch_tasks_response_msg::node_name"]
        [::std::mem::offset_of!(launch_tasks_response_msg, node_name) - 8usize];
    ["Offset of field: launch_tasks_response_msg::srun_node_id"]
        [::std::mem::offset_of!(launch_tasks_response_msg, srun_node_id) - 16usize];
    ["Offset of field: launch_tasks_response_msg::count_of_pids"]
        [::std::mem::offset_of!(launch_tasks_response_msg, count_of_pids) - 20usize];
    ["Offset of field: launch_tasks_response_msg::local_pids"]
        [::std::mem::offset_of!(launch_tasks_response_msg, local_pids) - 24usize];
    ["Offset of field: launch_tasks_response_msg::step_id"]
        [::std::mem::offset_of!(launch_tasks_response_msg, step_id) - 32usize];
    ["Offset of field: launch_tasks_response_msg::task_ids"]
        [::std::mem::offset_of!(launch_tasks_response_msg, task_ids) - 56usize];
};
pub type launch_tasks_response_msg_t = launch_tasks_response_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_ext_msg {
    pub num_tasks: u32,
    pub task_id_list: *mut u32,
    pub return_code: u32,
    pub step_id: slurm_step_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_ext_msg"][::std::mem::size_of::<task_ext_msg>() - 48usize];
    ["Alignment of task_ext_msg"][::std::mem::align_of::<task_ext_msg>() - 8usize];
    ["Offset of field: task_ext_msg::num_tasks"]
        [::std::mem::offset_of!(task_ext_msg, num_tasks) - 0usize];
    ["Offset of field: task_ext_msg::task_id_list"]
        [::std::mem::offset_of!(task_ext_msg, task_id_list) - 8usize];
    ["Offset of field: task_ext_msg::return_code"]
        [::std::mem::offset_of!(task_ext_msg, return_code) - 16usize];
    ["Offset of field: task_ext_msg::step_id"]
        [::std::mem::offset_of!(task_ext_msg, step_id) - 24usize];
};
pub type task_exit_msg_t = task_ext_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_forward_msg_t {
    pub job_id: u32,
    pub flags: u32,
    pub port: u16,
    pub target: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of net_forward_msg_t"][::std::mem::size_of::<net_forward_msg_t>() - 24usize];
    ["Alignment of net_forward_msg_t"][::std::mem::align_of::<net_forward_msg_t>() - 8usize];
    ["Offset of field: net_forward_msg_t::job_id"]
        [::std::mem::offset_of!(net_forward_msg_t, job_id) - 0usize];
    ["Offset of field: net_forward_msg_t::flags"]
        [::std::mem::offset_of!(net_forward_msg_t, flags) - 4usize];
    ["Offset of field: net_forward_msg_t::port"]
        [::std::mem::offset_of!(net_forward_msg_t, port) - 8usize];
    ["Offset of field: net_forward_msg_t::target"]
        [::std::mem::offset_of!(net_forward_msg_t, target) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct srun_ping_msg {
    pub job_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of srun_ping_msg"][::std::mem::size_of::<srun_ping_msg>() - 4usize];
    ["Alignment of srun_ping_msg"][::std::mem::align_of::<srun_ping_msg>() - 4usize];
    ["Offset of field: srun_ping_msg::job_id"]
        [::std::mem::offset_of!(srun_ping_msg, job_id) - 0usize];
};
pub type srun_ping_msg_t = srun_ping_msg;
pub type srun_job_complete_msg_t = slurm_step_id_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct srun_timeout_msg {
    pub step_id: slurm_step_id_t,
    pub timeout: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of srun_timeout_msg"][::std::mem::size_of::<srun_timeout_msg>() - 32usize];
    ["Alignment of srun_timeout_msg"][::std::mem::align_of::<srun_timeout_msg>() - 8usize];
    ["Offset of field: srun_timeout_msg::step_id"]
        [::std::mem::offset_of!(srun_timeout_msg, step_id) - 0usize];
    ["Offset of field: srun_timeout_msg::timeout"]
        [::std::mem::offset_of!(srun_timeout_msg, timeout) - 24usize];
};
pub type srun_timeout_msg_t = srun_timeout_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct srun_user_msg {
    pub job_id: u32,
    pub msg: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of srun_user_msg"][::std::mem::size_of::<srun_user_msg>() - 16usize];
    ["Alignment of srun_user_msg"][::std::mem::align_of::<srun_user_msg>() - 8usize];
    ["Offset of field: srun_user_msg::job_id"]
        [::std::mem::offset_of!(srun_user_msg, job_id) - 0usize];
    ["Offset of field: srun_user_msg::msg"][::std::mem::offset_of!(srun_user_msg, msg) - 8usize];
};
pub type srun_user_msg_t = srun_user_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct srun_node_fail_msg {
    pub nodelist: *mut ::std::os::raw::c_char,
    pub step_id: slurm_step_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of srun_node_fail_msg"][::std::mem::size_of::<srun_node_fail_msg>() - 32usize];
    ["Alignment of srun_node_fail_msg"][::std::mem::align_of::<srun_node_fail_msg>() - 8usize];
    ["Offset of field: srun_node_fail_msg::nodelist"]
        [::std::mem::offset_of!(srun_node_fail_msg, nodelist) - 0usize];
    ["Offset of field: srun_node_fail_msg::step_id"]
        [::std::mem::offset_of!(srun_node_fail_msg, step_id) - 8usize];
};
pub type srun_node_fail_msg_t = srun_node_fail_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct srun_step_missing_msg {
    pub nodelist: *mut ::std::os::raw::c_char,
    pub step_id: slurm_step_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of srun_step_missing_msg"][::std::mem::size_of::<srun_step_missing_msg>() - 32usize];
    ["Alignment of srun_step_missing_msg"]
        [::std::mem::align_of::<srun_step_missing_msg>() - 8usize];
    ["Offset of field: srun_step_missing_msg::nodelist"]
        [::std::mem::offset_of!(srun_step_missing_msg, nodelist) - 0usize];
    ["Offset of field: srun_step_missing_msg::step_id"]
        [::std::mem::offset_of!(srun_step_missing_msg, step_id) - 8usize];
};
pub type srun_step_missing_msg_t = srun_step_missing_msg;
pub const suspend_opts_SUSPEND_JOB: suspend_opts = 0;
pub const suspend_opts_RESUME_JOB: suspend_opts = 1;
pub type suspend_opts = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct suspend_msg {
    pub op: u16,
    pub job_id: u32,
    pub job_id_str: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of suspend_msg"][::std::mem::size_of::<suspend_msg>() - 16usize];
    ["Alignment of suspend_msg"][::std::mem::align_of::<suspend_msg>() - 8usize];
    ["Offset of field: suspend_msg::op"][::std::mem::offset_of!(suspend_msg, op) - 0usize];
    ["Offset of field: suspend_msg::job_id"][::std::mem::offset_of!(suspend_msg, job_id) - 4usize];
    ["Offset of field: suspend_msg::job_id_str"]
        [::std::mem::offset_of!(suspend_msg, job_id_str) - 8usize];
};
pub type suspend_msg_t = suspend_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct top_job_msg {
    pub op: u16,
    pub job_id: u32,
    pub job_id_str: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of top_job_msg"][::std::mem::size_of::<top_job_msg>() - 16usize];
    ["Alignment of top_job_msg"][::std::mem::align_of::<top_job_msg>() - 8usize];
    ["Offset of field: top_job_msg::op"][::std::mem::offset_of!(top_job_msg, op) - 0usize];
    ["Offset of field: top_job_msg::job_id"][::std::mem::offset_of!(top_job_msg, job_id) - 4usize];
    ["Offset of field: top_job_msg::job_id_str"]
        [::std::mem::offset_of!(top_job_msg, job_id_str) - 8usize];
};
pub type top_job_msg_t = top_job_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_launch_params_t {
    pub alias_list: *mut ::std::os::raw::c_char,
    pub argc: u32,
    pub argv: *mut *mut ::std::os::raw::c_char,
    pub envc: u32,
    pub env: *mut *mut ::std::os::raw::c_char,
    pub container: *mut ::std::os::raw::c_char,
    pub cwd: *mut ::std::os::raw::c_char,
    pub msg_timeout: u32,
    pub ntasks_per_board: u16,
    pub ntasks_per_core: u16,
    pub ntasks_per_tres: u16,
    pub ntasks_per_socket: u16,
    pub buffered_stdio: bool,
    pub labelio: bool,
    pub remote_output_filename: *mut ::std::os::raw::c_char,
    pub remote_error_filename: *mut ::std::os::raw::c_char,
    pub remote_input_filename: *mut ::std::os::raw::c_char,
    pub local_fds: slurm_step_io_fds_t,
    pub multi_prog: bool,
    pub no_alloc: bool,
    pub slurmd_debug: u32,
    pub het_job_node_offset: u32,
    pub het_job_id: u32,
    pub het_job_nnodes: u32,
    pub het_job_ntasks: u32,
    pub het_job_step_cnt: u32,
    pub het_job_task_cnts: *mut u16,
    pub het_job_tids: *mut *mut u32,
    pub het_job_tid_offsets: *mut u32,
    pub het_job_offset: u32,
    pub het_job_task_offset: u32,
    pub het_job_node_list: *mut ::std::os::raw::c_char,
    pub parallel_debug: bool,
    pub profile: u32,
    pub task_prolog: *mut ::std::os::raw::c_char,
    pub task_epilog: *mut ::std::os::raw::c_char,
    pub cpu_bind_type: u16,
    pub cpu_bind: *mut ::std::os::raw::c_char,
    pub cpu_freq_min: u32,
    pub cpu_freq_max: u32,
    pub cpu_freq_gov: u32,
    pub mem_bind_type: u16,
    pub mem_bind: *mut ::std::os::raw::c_char,
    pub accel_bind_type: u16,
    pub max_sockets: u16,
    pub max_cores: u16,
    pub max_threads: u16,
    pub cpus_per_task: u16,
    pub cpt_compact_array: *mut u16,
    pub cpt_compact_cnt: u32,
    pub cpt_compact_reps: *mut u32,
    pub threads_per_core: u16,
    pub task_dist: u32,
    pub tree_width: u16,
    pub preserve_env: bool,
    pub mpi_plugin_name: *mut ::std::os::raw::c_char,
    pub open_mode: u8,
    pub acctg_freq: *mut ::std::os::raw::c_char,
    pub pty: bool,
    pub spank_job_env: *mut *mut ::std::os::raw::c_char,
    pub spank_job_env_size: u32,
    pub tres_bind: *mut ::std::os::raw::c_char,
    pub tres_freq: *mut ::std::os::raw::c_char,
    pub oom_kill_step: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_launch_params_t"]
        [::std::mem::size_of::<slurm_step_launch_params_t>() - 392usize];
    ["Alignment of slurm_step_launch_params_t"]
        [::std::mem::align_of::<slurm_step_launch_params_t>() - 8usize];
    ["Offset of field: slurm_step_launch_params_t::alias_list"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, alias_list) - 0usize];
    ["Offset of field: slurm_step_launch_params_t::argc"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, argc) - 8usize];
    ["Offset of field: slurm_step_launch_params_t::argv"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, argv) - 16usize];
    ["Offset of field: slurm_step_launch_params_t::envc"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, envc) - 24usize];
    ["Offset of field: slurm_step_launch_params_t::env"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, env) - 32usize];
    ["Offset of field: slurm_step_launch_params_t::container"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, container) - 40usize];
    ["Offset of field: slurm_step_launch_params_t::cwd"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cwd) - 48usize];
    ["Offset of field: slurm_step_launch_params_t::msg_timeout"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, msg_timeout) - 56usize];
    ["Offset of field: slurm_step_launch_params_t::ntasks_per_board"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, ntasks_per_board) - 60usize];
    ["Offset of field: slurm_step_launch_params_t::ntasks_per_core"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, ntasks_per_core) - 62usize];
    ["Offset of field: slurm_step_launch_params_t::ntasks_per_tres"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, ntasks_per_tres) - 64usize];
    ["Offset of field: slurm_step_launch_params_t::ntasks_per_socket"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, ntasks_per_socket) - 66usize];
    ["Offset of field: slurm_step_launch_params_t::buffered_stdio"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, buffered_stdio) - 68usize];
    ["Offset of field: slurm_step_launch_params_t::labelio"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, labelio) - 69usize];
    ["Offset of field: slurm_step_launch_params_t::remote_output_filename"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, remote_output_filename) - 72usize];
    ["Offset of field: slurm_step_launch_params_t::remote_error_filename"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, remote_error_filename) - 80usize];
    ["Offset of field: slurm_step_launch_params_t::remote_input_filename"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, remote_input_filename) - 88usize];
    ["Offset of field: slurm_step_launch_params_t::local_fds"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, local_fds) - 96usize];
    ["Offset of field: slurm_step_launch_params_t::multi_prog"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, multi_prog) - 132usize];
    ["Offset of field: slurm_step_launch_params_t::no_alloc"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, no_alloc) - 133usize];
    ["Offset of field: slurm_step_launch_params_t::slurmd_debug"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, slurmd_debug) - 136usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_node_offset"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_node_offset) - 140usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_id"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_id) - 144usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_nnodes"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_nnodes) - 148usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_ntasks"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_ntasks) - 152usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_step_cnt"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_step_cnt) - 156usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_task_cnts"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_task_cnts) - 160usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_tids"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_tids) - 168usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_tid_offsets"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_tid_offsets) - 176usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_offset"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_offset) - 184usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_task_offset"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_task_offset) - 188usize];
    ["Offset of field: slurm_step_launch_params_t::het_job_node_list"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, het_job_node_list) - 192usize];
    ["Offset of field: slurm_step_launch_params_t::parallel_debug"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, parallel_debug) - 200usize];
    ["Offset of field: slurm_step_launch_params_t::profile"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, profile) - 204usize];
    ["Offset of field: slurm_step_launch_params_t::task_prolog"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, task_prolog) - 208usize];
    ["Offset of field: slurm_step_launch_params_t::task_epilog"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, task_epilog) - 216usize];
    ["Offset of field: slurm_step_launch_params_t::cpu_bind_type"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpu_bind_type) - 224usize];
    ["Offset of field: slurm_step_launch_params_t::cpu_bind"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpu_bind) - 232usize];
    ["Offset of field: slurm_step_launch_params_t::cpu_freq_min"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpu_freq_min) - 240usize];
    ["Offset of field: slurm_step_launch_params_t::cpu_freq_max"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpu_freq_max) - 244usize];
    ["Offset of field: slurm_step_launch_params_t::cpu_freq_gov"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpu_freq_gov) - 248usize];
    ["Offset of field: slurm_step_launch_params_t::mem_bind_type"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, mem_bind_type) - 252usize];
    ["Offset of field: slurm_step_launch_params_t::mem_bind"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, mem_bind) - 256usize];
    ["Offset of field: slurm_step_launch_params_t::accel_bind_type"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, accel_bind_type) - 264usize];
    ["Offset of field: slurm_step_launch_params_t::max_sockets"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, max_sockets) - 266usize];
    ["Offset of field: slurm_step_launch_params_t::max_cores"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, max_cores) - 268usize];
    ["Offset of field: slurm_step_launch_params_t::max_threads"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, max_threads) - 270usize];
    ["Offset of field: slurm_step_launch_params_t::cpus_per_task"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpus_per_task) - 272usize];
    ["Offset of field: slurm_step_launch_params_t::cpt_compact_array"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpt_compact_array) - 280usize];
    ["Offset of field: slurm_step_launch_params_t::cpt_compact_cnt"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpt_compact_cnt) - 288usize];
    ["Offset of field: slurm_step_launch_params_t::cpt_compact_reps"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, cpt_compact_reps) - 296usize];
    ["Offset of field: slurm_step_launch_params_t::threads_per_core"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, threads_per_core) - 304usize];
    ["Offset of field: slurm_step_launch_params_t::task_dist"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, task_dist) - 308usize];
    ["Offset of field: slurm_step_launch_params_t::tree_width"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, tree_width) - 312usize];
    ["Offset of field: slurm_step_launch_params_t::preserve_env"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, preserve_env) - 314usize];
    ["Offset of field: slurm_step_launch_params_t::mpi_plugin_name"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, mpi_plugin_name) - 320usize];
    ["Offset of field: slurm_step_launch_params_t::open_mode"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, open_mode) - 328usize];
    ["Offset of field: slurm_step_launch_params_t::acctg_freq"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, acctg_freq) - 336usize];
    ["Offset of field: slurm_step_launch_params_t::pty"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, pty) - 344usize];
    ["Offset of field: slurm_step_launch_params_t::spank_job_env"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, spank_job_env) - 352usize];
    ["Offset of field: slurm_step_launch_params_t::spank_job_env_size"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, spank_job_env_size) - 360usize];
    ["Offset of field: slurm_step_launch_params_t::tres_bind"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, tres_bind) - 368usize];
    ["Offset of field: slurm_step_launch_params_t::tres_freq"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, tres_freq) - 376usize];
    ["Offset of field: slurm_step_launch_params_t::oom_kill_step"]
        [::std::mem::offset_of!(slurm_step_launch_params_t, oom_kill_step) - 384usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_step_launch_callbacks_t {
    pub step_complete:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut srun_job_complete_msg_t)>,
    pub step_signal: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub step_timeout: ::std::option::Option<unsafe extern "C" fn(arg1: *mut srun_timeout_msg_t)>,
    pub task_start:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut launch_tasks_response_msg_t)>,
    pub task_finish: ::std::option::Option<unsafe extern "C" fn(arg1: *mut task_exit_msg_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_step_launch_callbacks_t"]
        [::std::mem::size_of::<slurm_step_launch_callbacks_t>() - 40usize];
    ["Alignment of slurm_step_launch_callbacks_t"]
        [::std::mem::align_of::<slurm_step_launch_callbacks_t>() - 8usize];
    ["Offset of field: slurm_step_launch_callbacks_t::step_complete"]
        [::std::mem::offset_of!(slurm_step_launch_callbacks_t, step_complete) - 0usize];
    ["Offset of field: slurm_step_launch_callbacks_t::step_signal"]
        [::std::mem::offset_of!(slurm_step_launch_callbacks_t, step_signal) - 8usize];
    ["Offset of field: slurm_step_launch_callbacks_t::step_timeout"]
        [::std::mem::offset_of!(slurm_step_launch_callbacks_t, step_timeout) - 16usize];
    ["Offset of field: slurm_step_launch_callbacks_t::task_start"]
        [::std::mem::offset_of!(slurm_step_launch_callbacks_t, task_start) - 24usize];
    ["Offset of field: slurm_step_launch_callbacks_t::task_finish"]
        [::std::mem::offset_of!(slurm_step_launch_callbacks_t, task_finish) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_allocation_callbacks_t {
    pub job_complete:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut srun_job_complete_msg_t)>,
    pub timeout: ::std::option::Option<unsafe extern "C" fn(arg1: *mut srun_timeout_msg_t)>,
    pub user_msg: ::std::option::Option<unsafe extern "C" fn(arg1: *mut srun_user_msg_t)>,
    pub node_fail: ::std::option::Option<unsafe extern "C" fn(arg1: *mut srun_node_fail_msg_t)>,
    pub job_suspend: ::std::option::Option<unsafe extern "C" fn(arg1: *mut suspend_msg_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_allocation_callbacks_t"]
        [::std::mem::size_of::<slurm_allocation_callbacks_t>() - 40usize];
    ["Alignment of slurm_allocation_callbacks_t"]
        [::std::mem::align_of::<slurm_allocation_callbacks_t>() - 8usize];
    ["Offset of field: slurm_allocation_callbacks_t::job_complete"]
        [::std::mem::offset_of!(slurm_allocation_callbacks_t, job_complete) - 0usize];
    ["Offset of field: slurm_allocation_callbacks_t::timeout"]
        [::std::mem::offset_of!(slurm_allocation_callbacks_t, timeout) - 8usize];
    ["Offset of field: slurm_allocation_callbacks_t::user_msg"]
        [::std::mem::offset_of!(slurm_allocation_callbacks_t, user_msg) - 16usize];
    ["Offset of field: slurm_allocation_callbacks_t::node_fail"]
        [::std::mem::offset_of!(slurm_allocation_callbacks_t, node_fail) - 24usize];
    ["Offset of field: slurm_allocation_callbacks_t::job_suspend"]
        [::std::mem::offset_of!(slurm_allocation_callbacks_t, job_suspend) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_trigger_callbacks_t {
    pub acct_full: ::std::option::Option<unsafe extern "C" fn()>,
    pub dbd_fail: ::std::option::Option<unsafe extern "C" fn()>,
    pub dbd_resumed: ::std::option::Option<unsafe extern "C" fn()>,
    pub db_fail: ::std::option::Option<unsafe extern "C" fn()>,
    pub db_resumed: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_trigger_callbacks_t"]
        [::std::mem::size_of::<slurm_trigger_callbacks_t>() - 40usize];
    ["Alignment of slurm_trigger_callbacks_t"]
        [::std::mem::align_of::<slurm_trigger_callbacks_t>() - 8usize];
    ["Offset of field: slurm_trigger_callbacks_t::acct_full"]
        [::std::mem::offset_of!(slurm_trigger_callbacks_t, acct_full) - 0usize];
    ["Offset of field: slurm_trigger_callbacks_t::dbd_fail"]
        [::std::mem::offset_of!(slurm_trigger_callbacks_t, dbd_fail) - 8usize];
    ["Offset of field: slurm_trigger_callbacks_t::dbd_resumed"]
        [::std::mem::offset_of!(slurm_trigger_callbacks_t, dbd_resumed) - 16usize];
    ["Offset of field: slurm_trigger_callbacks_t::db_fail"]
        [::std::mem::offset_of!(slurm_trigger_callbacks_t, db_fail) - 24usize];
    ["Offset of field: slurm_trigger_callbacks_t::db_resumed"]
        [::std::mem::offset_of!(slurm_trigger_callbacks_t, db_resumed) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_step_info_t {
    pub array_job_id: u32,
    pub array_task_id: u32,
    pub cluster: *mut ::std::os::raw::c_char,
    pub container: *mut ::std::os::raw::c_char,
    pub container_id: *mut ::std::os::raw::c_char,
    pub cpu_freq_min: u32,
    pub cpu_freq_max: u32,
    pub cpu_freq_gov: u32,
    pub cpus_per_tres: *mut ::std::os::raw::c_char,
    pub mem_per_tres: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub network: *mut ::std::os::raw::c_char,
    pub nodes: *mut ::std::os::raw::c_char,
    pub node_inx: *mut i32,
    pub num_cpus: u32,
    pub num_tasks: u32,
    pub partition: *mut ::std::os::raw::c_char,
    pub resv_ports: *mut ::std::os::raw::c_char,
    pub run_time: time_t,
    pub srun_host: *mut ::std::os::raw::c_char,
    pub srun_pid: u32,
    pub start_time: time_t,
    pub start_protocol_ver: u16,
    pub state: u32,
    pub step_id: slurm_step_id_t,
    pub submit_line: *mut ::std::os::raw::c_char,
    pub task_dist: u32,
    pub time_limit: u32,
    pub tres_alloc_str: *mut ::std::os::raw::c_char,
    pub tres_bind: *mut ::std::os::raw::c_char,
    pub tres_freq: *mut ::std::os::raw::c_char,
    pub tres_per_step: *mut ::std::os::raw::c_char,
    pub tres_per_node: *mut ::std::os::raw::c_char,
    pub tres_per_socket: *mut ::std::os::raw::c_char,
    pub tres_per_task: *mut ::std::os::raw::c_char,
    pub user_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_step_info_t"][::std::mem::size_of::<job_step_info_t>() - 264usize];
    ["Alignment of job_step_info_t"][::std::mem::align_of::<job_step_info_t>() - 8usize];
    ["Offset of field: job_step_info_t::array_job_id"]
        [::std::mem::offset_of!(job_step_info_t, array_job_id) - 0usize];
    ["Offset of field: job_step_info_t::array_task_id"]
        [::std::mem::offset_of!(job_step_info_t, array_task_id) - 4usize];
    ["Offset of field: job_step_info_t::cluster"]
        [::std::mem::offset_of!(job_step_info_t, cluster) - 8usize];
    ["Offset of field: job_step_info_t::container"]
        [::std::mem::offset_of!(job_step_info_t, container) - 16usize];
    ["Offset of field: job_step_info_t::container_id"]
        [::std::mem::offset_of!(job_step_info_t, container_id) - 24usize];
    ["Offset of field: job_step_info_t::cpu_freq_min"]
        [::std::mem::offset_of!(job_step_info_t, cpu_freq_min) - 32usize];
    ["Offset of field: job_step_info_t::cpu_freq_max"]
        [::std::mem::offset_of!(job_step_info_t, cpu_freq_max) - 36usize];
    ["Offset of field: job_step_info_t::cpu_freq_gov"]
        [::std::mem::offset_of!(job_step_info_t, cpu_freq_gov) - 40usize];
    ["Offset of field: job_step_info_t::cpus_per_tres"]
        [::std::mem::offset_of!(job_step_info_t, cpus_per_tres) - 48usize];
    ["Offset of field: job_step_info_t::mem_per_tres"]
        [::std::mem::offset_of!(job_step_info_t, mem_per_tres) - 56usize];
    ["Offset of field: job_step_info_t::name"]
        [::std::mem::offset_of!(job_step_info_t, name) - 64usize];
    ["Offset of field: job_step_info_t::network"]
        [::std::mem::offset_of!(job_step_info_t, network) - 72usize];
    ["Offset of field: job_step_info_t::nodes"]
        [::std::mem::offset_of!(job_step_info_t, nodes) - 80usize];
    ["Offset of field: job_step_info_t::node_inx"]
        [::std::mem::offset_of!(job_step_info_t, node_inx) - 88usize];
    ["Offset of field: job_step_info_t::num_cpus"]
        [::std::mem::offset_of!(job_step_info_t, num_cpus) - 96usize];
    ["Offset of field: job_step_info_t::num_tasks"]
        [::std::mem::offset_of!(job_step_info_t, num_tasks) - 100usize];
    ["Offset of field: job_step_info_t::partition"]
        [::std::mem::offset_of!(job_step_info_t, partition) - 104usize];
    ["Offset of field: job_step_info_t::resv_ports"]
        [::std::mem::offset_of!(job_step_info_t, resv_ports) - 112usize];
    ["Offset of field: job_step_info_t::run_time"]
        [::std::mem::offset_of!(job_step_info_t, run_time) - 120usize];
    ["Offset of field: job_step_info_t::srun_host"]
        [::std::mem::offset_of!(job_step_info_t, srun_host) - 128usize];
    ["Offset of field: job_step_info_t::srun_pid"]
        [::std::mem::offset_of!(job_step_info_t, srun_pid) - 136usize];
    ["Offset of field: job_step_info_t::start_time"]
        [::std::mem::offset_of!(job_step_info_t, start_time) - 144usize];
    ["Offset of field: job_step_info_t::start_protocol_ver"]
        [::std::mem::offset_of!(job_step_info_t, start_protocol_ver) - 152usize];
    ["Offset of field: job_step_info_t::state"]
        [::std::mem::offset_of!(job_step_info_t, state) - 156usize];
    ["Offset of field: job_step_info_t::step_id"]
        [::std::mem::offset_of!(job_step_info_t, step_id) - 160usize];
    ["Offset of field: job_step_info_t::submit_line"]
        [::std::mem::offset_of!(job_step_info_t, submit_line) - 184usize];
    ["Offset of field: job_step_info_t::task_dist"]
        [::std::mem::offset_of!(job_step_info_t, task_dist) - 192usize];
    ["Offset of field: job_step_info_t::time_limit"]
        [::std::mem::offset_of!(job_step_info_t, time_limit) - 196usize];
    ["Offset of field: job_step_info_t::tres_alloc_str"]
        [::std::mem::offset_of!(job_step_info_t, tres_alloc_str) - 200usize];
    ["Offset of field: job_step_info_t::tres_bind"]
        [::std::mem::offset_of!(job_step_info_t, tres_bind) - 208usize];
    ["Offset of field: job_step_info_t::tres_freq"]
        [::std::mem::offset_of!(job_step_info_t, tres_freq) - 216usize];
    ["Offset of field: job_step_info_t::tres_per_step"]
        [::std::mem::offset_of!(job_step_info_t, tres_per_step) - 224usize];
    ["Offset of field: job_step_info_t::tres_per_node"]
        [::std::mem::offset_of!(job_step_info_t, tres_per_node) - 232usize];
    ["Offset of field: job_step_info_t::tres_per_socket"]
        [::std::mem::offset_of!(job_step_info_t, tres_per_socket) - 240usize];
    ["Offset of field: job_step_info_t::tres_per_task"]
        [::std::mem::offset_of!(job_step_info_t, tres_per_task) - 248usize];
    ["Offset of field: job_step_info_t::user_id"]
        [::std::mem::offset_of!(job_step_info_t, user_id) - 256usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stepmgr_job_info_t {
    pub job_id: u32,
    pub stepmgr: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stepmgr_job_info_t"][::std::mem::size_of::<stepmgr_job_info_t>() - 16usize];
    ["Alignment of stepmgr_job_info_t"][::std::mem::align_of::<stepmgr_job_info_t>() - 8usize];
    ["Offset of field: stepmgr_job_info_t::job_id"]
        [::std::mem::offset_of!(stepmgr_job_info_t, job_id) - 0usize];
    ["Offset of field: stepmgr_job_info_t::stepmgr"]
        [::std::mem::offset_of!(stepmgr_job_info_t, stepmgr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_step_info_response_msg {
    pub last_update: time_t,
    pub job_step_count: u32,
    pub job_steps: *mut job_step_info_t,
    pub stepmgr_jobs: *mut list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_step_info_response_msg"]
        [::std::mem::size_of::<job_step_info_response_msg>() - 32usize];
    ["Alignment of job_step_info_response_msg"]
        [::std::mem::align_of::<job_step_info_response_msg>() - 8usize];
    ["Offset of field: job_step_info_response_msg::last_update"]
        [::std::mem::offset_of!(job_step_info_response_msg, last_update) - 0usize];
    ["Offset of field: job_step_info_response_msg::job_step_count"]
        [::std::mem::offset_of!(job_step_info_response_msg, job_step_count) - 8usize];
    ["Offset of field: job_step_info_response_msg::job_steps"]
        [::std::mem::offset_of!(job_step_info_response_msg, job_steps) - 16usize];
    ["Offset of field: job_step_info_response_msg::stepmgr_jobs"]
        [::std::mem::offset_of!(job_step_info_response_msg, stepmgr_jobs) - 24usize];
};
pub type job_step_info_response_msg_t = job_step_info_response_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_step_pids_t {
    pub node_name: *mut ::std::os::raw::c_char,
    pub pid: *mut u32,
    pub pid_cnt: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_step_pids_t"][::std::mem::size_of::<job_step_pids_t>() - 24usize];
    ["Alignment of job_step_pids_t"][::std::mem::align_of::<job_step_pids_t>() - 8usize];
    ["Offset of field: job_step_pids_t::node_name"]
        [::std::mem::offset_of!(job_step_pids_t, node_name) - 0usize];
    ["Offset of field: job_step_pids_t::pid"]
        [::std::mem::offset_of!(job_step_pids_t, pid) - 8usize];
    ["Offset of field: job_step_pids_t::pid_cnt"]
        [::std::mem::offset_of!(job_step_pids_t, pid_cnt) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_step_pids_response_msg_t {
    pub pid_list: *mut list_t,
    pub step_id: slurm_step_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_step_pids_response_msg_t"]
        [::std::mem::size_of::<job_step_pids_response_msg_t>() - 32usize];
    ["Alignment of job_step_pids_response_msg_t"]
        [::std::mem::align_of::<job_step_pids_response_msg_t>() - 8usize];
    ["Offset of field: job_step_pids_response_msg_t::pid_list"]
        [::std::mem::offset_of!(job_step_pids_response_msg_t, pid_list) - 0usize];
    ["Offset of field: job_step_pids_response_msg_t::step_id"]
        [::std::mem::offset_of!(job_step_pids_response_msg_t, step_id) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_step_stat_t {
    pub jobacct: *mut jobacctinfo_t,
    pub num_tasks: u32,
    pub return_code: u32,
    pub step_pids: *mut job_step_pids_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_step_stat_t"][::std::mem::size_of::<job_step_stat_t>() - 24usize];
    ["Alignment of job_step_stat_t"][::std::mem::align_of::<job_step_stat_t>() - 8usize];
    ["Offset of field: job_step_stat_t::jobacct"]
        [::std::mem::offset_of!(job_step_stat_t, jobacct) - 0usize];
    ["Offset of field: job_step_stat_t::num_tasks"]
        [::std::mem::offset_of!(job_step_stat_t, num_tasks) - 8usize];
    ["Offset of field: job_step_stat_t::return_code"]
        [::std::mem::offset_of!(job_step_stat_t, return_code) - 12usize];
    ["Offset of field: job_step_stat_t::step_pids"]
        [::std::mem::offset_of!(job_step_stat_t, step_pids) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_step_stat_response_msg_t {
    pub stats_list: *mut list_t,
    pub step_id: slurm_step_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_step_stat_response_msg_t"]
        [::std::mem::size_of::<job_step_stat_response_msg_t>() - 32usize];
    ["Alignment of job_step_stat_response_msg_t"]
        [::std::mem::align_of::<job_step_stat_response_msg_t>() - 8usize];
    ["Offset of field: job_step_stat_response_msg_t::stats_list"]
        [::std::mem::offset_of!(job_step_stat_response_msg_t, stats_list) - 0usize];
    ["Offset of field: job_step_stat_response_msg_t::step_id"]
        [::std::mem::offset_of!(job_step_stat_response_msg_t, step_id) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct node_info {
    pub arch: *mut ::std::os::raw::c_char,
    pub bcast_address: *mut ::std::os::raw::c_char,
    pub boards: u16,
    pub boot_time: time_t,
    pub cluster_name: *mut ::std::os::raw::c_char,
    pub cores: u16,
    pub core_spec_cnt: u16,
    pub cpu_bind: u32,
    pub cpu_load: u32,
    pub free_mem: u64,
    pub cpus: u16,
    pub cpus_efctv: u16,
    pub cpu_spec_list: *mut ::std::os::raw::c_char,
    pub energy: *mut acct_gather_energy_t,
    pub extra: *mut ::std::os::raw::c_char,
    pub features: *mut ::std::os::raw::c_char,
    pub features_act: *mut ::std::os::raw::c_char,
    pub gres: *mut ::std::os::raw::c_char,
    pub gres_drain: *mut ::std::os::raw::c_char,
    pub gres_used: *mut ::std::os::raw::c_char,
    pub instance_id: *mut ::std::os::raw::c_char,
    pub instance_type: *mut ::std::os::raw::c_char,
    pub last_busy: time_t,
    pub mcs_label: *mut ::std::os::raw::c_char,
    pub mem_spec_limit: u64,
    pub name: *mut ::std::os::raw::c_char,
    pub next_state: u32,
    pub node_addr: *mut ::std::os::raw::c_char,
    pub node_hostname: *mut ::std::os::raw::c_char,
    pub node_state: u32,
    pub os: *mut ::std::os::raw::c_char,
    pub owner: u32,
    pub partitions: *mut ::std::os::raw::c_char,
    pub port: u16,
    pub real_memory: u64,
    pub res_cores_per_gpu: u16,
    pub gpu_spec: *mut ::std::os::raw::c_char,
    pub comment: *mut ::std::os::raw::c_char,
    pub reason: *mut ::std::os::raw::c_char,
    pub reason_time: time_t,
    pub reason_uid: u32,
    pub resume_after: time_t,
    pub resv_name: *mut ::std::os::raw::c_char,
    pub select_nodeinfo: *mut dynamic_plugin_data_t,
    pub slurmd_start_time: time_t,
    pub sockets: u16,
    pub threads: u16,
    pub tmp_disk: u32,
    pub weight: u32,
    pub tres_fmt_str: *mut ::std::os::raw::c_char,
    pub version: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of node_info"][::std::mem::size_of::<node_info>() - 368usize];
    ["Alignment of node_info"][::std::mem::align_of::<node_info>() - 8usize];
    ["Offset of field: node_info::arch"][::std::mem::offset_of!(node_info, arch) - 0usize];
    ["Offset of field: node_info::bcast_address"]
        [::std::mem::offset_of!(node_info, bcast_address) - 8usize];
    ["Offset of field: node_info::boards"][::std::mem::offset_of!(node_info, boards) - 16usize];
    ["Offset of field: node_info::boot_time"]
        [::std::mem::offset_of!(node_info, boot_time) - 24usize];
    ["Offset of field: node_info::cluster_name"]
        [::std::mem::offset_of!(node_info, cluster_name) - 32usize];
    ["Offset of field: node_info::cores"][::std::mem::offset_of!(node_info, cores) - 40usize];
    ["Offset of field: node_info::core_spec_cnt"]
        [::std::mem::offset_of!(node_info, core_spec_cnt) - 42usize];
    ["Offset of field: node_info::cpu_bind"][::std::mem::offset_of!(node_info, cpu_bind) - 44usize];
    ["Offset of field: node_info::cpu_load"][::std::mem::offset_of!(node_info, cpu_load) - 48usize];
    ["Offset of field: node_info::free_mem"][::std::mem::offset_of!(node_info, free_mem) - 56usize];
    ["Offset of field: node_info::cpus"][::std::mem::offset_of!(node_info, cpus) - 64usize];
    ["Offset of field: node_info::cpus_efctv"]
        [::std::mem::offset_of!(node_info, cpus_efctv) - 66usize];
    ["Offset of field: node_info::cpu_spec_list"]
        [::std::mem::offset_of!(node_info, cpu_spec_list) - 72usize];
    ["Offset of field: node_info::energy"][::std::mem::offset_of!(node_info, energy) - 80usize];
    ["Offset of field: node_info::extra"][::std::mem::offset_of!(node_info, extra) - 88usize];
    ["Offset of field: node_info::features"][::std::mem::offset_of!(node_info, features) - 96usize];
    ["Offset of field: node_info::features_act"]
        [::std::mem::offset_of!(node_info, features_act) - 104usize];
    ["Offset of field: node_info::gres"][::std::mem::offset_of!(node_info, gres) - 112usize];
    ["Offset of field: node_info::gres_drain"]
        [::std::mem::offset_of!(node_info, gres_drain) - 120usize];
    ["Offset of field: node_info::gres_used"]
        [::std::mem::offset_of!(node_info, gres_used) - 128usize];
    ["Offset of field: node_info::instance_id"]
        [::std::mem::offset_of!(node_info, instance_id) - 136usize];
    ["Offset of field: node_info::instance_type"]
        [::std::mem::offset_of!(node_info, instance_type) - 144usize];
    ["Offset of field: node_info::last_busy"]
        [::std::mem::offset_of!(node_info, last_busy) - 152usize];
    ["Offset of field: node_info::mcs_label"]
        [::std::mem::offset_of!(node_info, mcs_label) - 160usize];
    ["Offset of field: node_info::mem_spec_limit"]
        [::std::mem::offset_of!(node_info, mem_spec_limit) - 168usize];
    ["Offset of field: node_info::name"][::std::mem::offset_of!(node_info, name) - 176usize];
    ["Offset of field: node_info::next_state"]
        [::std::mem::offset_of!(node_info, next_state) - 184usize];
    ["Offset of field: node_info::node_addr"]
        [::std::mem::offset_of!(node_info, node_addr) - 192usize];
    ["Offset of field: node_info::node_hostname"]
        [::std::mem::offset_of!(node_info, node_hostname) - 200usize];
    ["Offset of field: node_info::node_state"]
        [::std::mem::offset_of!(node_info, node_state) - 208usize];
    ["Offset of field: node_info::os"][::std::mem::offset_of!(node_info, os) - 216usize];
    ["Offset of field: node_info::owner"][::std::mem::offset_of!(node_info, owner) - 224usize];
    ["Offset of field: node_info::partitions"]
        [::std::mem::offset_of!(node_info, partitions) - 232usize];
    ["Offset of field: node_info::port"][::std::mem::offset_of!(node_info, port) - 240usize];
    ["Offset of field: node_info::real_memory"]
        [::std::mem::offset_of!(node_info, real_memory) - 248usize];
    ["Offset of field: node_info::res_cores_per_gpu"]
        [::std::mem::offset_of!(node_info, res_cores_per_gpu) - 256usize];
    ["Offset of field: node_info::gpu_spec"]
        [::std::mem::offset_of!(node_info, gpu_spec) - 264usize];
    ["Offset of field: node_info::comment"][::std::mem::offset_of!(node_info, comment) - 272usize];
    ["Offset of field: node_info::reason"][::std::mem::offset_of!(node_info, reason) - 280usize];
    ["Offset of field: node_info::reason_time"]
        [::std::mem::offset_of!(node_info, reason_time) - 288usize];
    ["Offset of field: node_info::reason_uid"]
        [::std::mem::offset_of!(node_info, reason_uid) - 296usize];
    ["Offset of field: node_info::resume_after"]
        [::std::mem::offset_of!(node_info, resume_after) - 304usize];
    ["Offset of field: node_info::resv_name"]
        [::std::mem::offset_of!(node_info, resv_name) - 312usize];
    ["Offset of field: node_info::select_nodeinfo"]
        [::std::mem::offset_of!(node_info, select_nodeinfo) - 320usize];
    ["Offset of field: node_info::slurmd_start_time"]
        [::std::mem::offset_of!(node_info, slurmd_start_time) - 328usize];
    ["Offset of field: node_info::sockets"][::std::mem::offset_of!(node_info, sockets) - 336usize];
    ["Offset of field: node_info::threads"][::std::mem::offset_of!(node_info, threads) - 338usize];
    ["Offset of field: node_info::tmp_disk"]
        [::std::mem::offset_of!(node_info, tmp_disk) - 340usize];
    ["Offset of field: node_info::weight"][::std::mem::offset_of!(node_info, weight) - 344usize];
    ["Offset of field: node_info::tres_fmt_str"]
        [::std::mem::offset_of!(node_info, tres_fmt_str) - 352usize];
    ["Offset of field: node_info::version"][::std::mem::offset_of!(node_info, version) - 360usize];
};
pub type node_info_t = node_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct node_info_msg {
    pub last_update: time_t,
    pub record_count: u32,
    pub node_array: *mut node_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of node_info_msg"][::std::mem::size_of::<node_info_msg>() - 24usize];
    ["Alignment of node_info_msg"][::std::mem::align_of::<node_info_msg>() - 8usize];
    ["Offset of field: node_info_msg::last_update"]
        [::std::mem::offset_of!(node_info_msg, last_update) - 0usize];
    ["Offset of field: node_info_msg::record_count"]
        [::std::mem::offset_of!(node_info_msg, record_count) - 8usize];
    ["Offset of field: node_info_msg::node_array"]
        [::std::mem::offset_of!(node_info_msg, node_array) - 16usize];
};
pub type node_info_msg_t = node_info_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct front_end_info {
    pub allow_groups: *mut ::std::os::raw::c_char,
    pub allow_users: *mut ::std::os::raw::c_char,
    pub boot_time: time_t,
    pub deny_groups: *mut ::std::os::raw::c_char,
    pub deny_users: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub node_state: u32,
    pub reason: *mut ::std::os::raw::c_char,
    pub reason_time: time_t,
    pub reason_uid: u32,
    pub slurmd_start_time: time_t,
    pub version: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of front_end_info"][::std::mem::size_of::<front_end_info>() - 96usize];
    ["Alignment of front_end_info"][::std::mem::align_of::<front_end_info>() - 8usize];
    ["Offset of field: front_end_info::allow_groups"]
        [::std::mem::offset_of!(front_end_info, allow_groups) - 0usize];
    ["Offset of field: front_end_info::allow_users"]
        [::std::mem::offset_of!(front_end_info, allow_users) - 8usize];
    ["Offset of field: front_end_info::boot_time"]
        [::std::mem::offset_of!(front_end_info, boot_time) - 16usize];
    ["Offset of field: front_end_info::deny_groups"]
        [::std::mem::offset_of!(front_end_info, deny_groups) - 24usize];
    ["Offset of field: front_end_info::deny_users"]
        [::std::mem::offset_of!(front_end_info, deny_users) - 32usize];
    ["Offset of field: front_end_info::name"]
        [::std::mem::offset_of!(front_end_info, name) - 40usize];
    ["Offset of field: front_end_info::node_state"]
        [::std::mem::offset_of!(front_end_info, node_state) - 48usize];
    ["Offset of field: front_end_info::reason"]
        [::std::mem::offset_of!(front_end_info, reason) - 56usize];
    ["Offset of field: front_end_info::reason_time"]
        [::std::mem::offset_of!(front_end_info, reason_time) - 64usize];
    ["Offset of field: front_end_info::reason_uid"]
        [::std::mem::offset_of!(front_end_info, reason_uid) - 72usize];
    ["Offset of field: front_end_info::slurmd_start_time"]
        [::std::mem::offset_of!(front_end_info, slurmd_start_time) - 80usize];
    ["Offset of field: front_end_info::version"]
        [::std::mem::offset_of!(front_end_info, version) - 88usize];
};
pub type front_end_info_t = front_end_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct front_end_info_msg {
    pub last_update: time_t,
    pub record_count: u32,
    pub front_end_array: *mut front_end_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of front_end_info_msg"][::std::mem::size_of::<front_end_info_msg>() - 24usize];
    ["Alignment of front_end_info_msg"][::std::mem::align_of::<front_end_info_msg>() - 8usize];
    ["Offset of field: front_end_info_msg::last_update"]
        [::std::mem::offset_of!(front_end_info_msg, last_update) - 0usize];
    ["Offset of field: front_end_info_msg::record_count"]
        [::std::mem::offset_of!(front_end_info_msg, record_count) - 8usize];
    ["Offset of field: front_end_info_msg::front_end_array"]
        [::std::mem::offset_of!(front_end_info_msg, front_end_array) - 16usize];
};
pub type front_end_info_msg_t = front_end_info_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct topo_info {
    pub level: u16,
    pub link_speed: u32,
    pub name: *mut ::std::os::raw::c_char,
    pub nodes: *mut ::std::os::raw::c_char,
    pub switches: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of topo_info"][::std::mem::size_of::<topo_info>() - 32usize];
    ["Alignment of topo_info"][::std::mem::align_of::<topo_info>() - 8usize];
    ["Offset of field: topo_info::level"][::std::mem::offset_of!(topo_info, level) - 0usize];
    ["Offset of field: topo_info::link_speed"]
        [::std::mem::offset_of!(topo_info, link_speed) - 4usize];
    ["Offset of field: topo_info::name"][::std::mem::offset_of!(topo_info, name) - 8usize];
    ["Offset of field: topo_info::nodes"][::std::mem::offset_of!(topo_info, nodes) - 16usize];
    ["Offset of field: topo_info::switches"][::std::mem::offset_of!(topo_info, switches) - 24usize];
};
pub type topo_info_t = topo_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct topo_info_response_msg {
    pub record_count: u32,
    pub topo_array: *mut topo_info_t,
    pub topo_info: *mut dynamic_plugin_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of topo_info_response_msg"][::std::mem::size_of::<topo_info_response_msg>() - 24usize];
    ["Alignment of topo_info_response_msg"]
        [::std::mem::align_of::<topo_info_response_msg>() - 8usize];
    ["Offset of field: topo_info_response_msg::record_count"]
        [::std::mem::offset_of!(topo_info_response_msg, record_count) - 0usize];
    ["Offset of field: topo_info_response_msg::topo_array"]
        [::std::mem::offset_of!(topo_info_response_msg, topo_array) - 8usize];
    ["Offset of field: topo_info_response_msg::topo_info"]
        [::std::mem::offset_of!(topo_info_response_msg, topo_info) - 16usize];
};
pub type topo_info_response_msg_t = topo_info_response_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_alloc_info_msg {
    pub job_id: u32,
    pub req_cluster: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_alloc_info_msg"][::std::mem::size_of::<job_alloc_info_msg>() - 16usize];
    ["Alignment of job_alloc_info_msg"][::std::mem::align_of::<job_alloc_info_msg>() - 8usize];
    ["Offset of field: job_alloc_info_msg::job_id"]
        [::std::mem::offset_of!(job_alloc_info_msg, job_id) - 0usize];
    ["Offset of field: job_alloc_info_msg::req_cluster"]
        [::std::mem::offset_of!(job_alloc_info_msg, req_cluster) - 8usize];
};
pub type job_alloc_info_msg_t = job_alloc_info_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_selected_step_t {
    pub array_bitmap: *mut bitstr_t,
    pub array_task_id: u32,
    pub het_job_offset: u32,
    pub step_id: slurm_step_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slurm_selected_step_t"][::std::mem::size_of::<slurm_selected_step_t>() - 40usize];
    ["Alignment of slurm_selected_step_t"]
        [::std::mem::align_of::<slurm_selected_step_t>() - 8usize];
    ["Offset of field: slurm_selected_step_t::array_bitmap"]
        [::std::mem::offset_of!(slurm_selected_step_t, array_bitmap) - 0usize];
    ["Offset of field: slurm_selected_step_t::array_task_id"]
        [::std::mem::offset_of!(slurm_selected_step_t, array_task_id) - 8usize];
    ["Offset of field: slurm_selected_step_t::het_job_offset"]
        [::std::mem::offset_of!(slurm_selected_step_t, het_job_offset) - 12usize];
    ["Offset of field: slurm_selected_step_t::step_id"]
        [::std::mem::offset_of!(slurm_selected_step_t, step_id) - 16usize];
};
pub type step_alloc_info_msg_t = slurm_selected_step_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acct_gather_node_resp_msg {
    pub energy: *mut acct_gather_energy_t,
    pub node_name: *mut ::std::os::raw::c_char,
    pub sensor_cnt: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acct_gather_node_resp_msg"]
        [::std::mem::size_of::<acct_gather_node_resp_msg>() - 24usize];
    ["Alignment of acct_gather_node_resp_msg"]
        [::std::mem::align_of::<acct_gather_node_resp_msg>() - 8usize];
    ["Offset of field: acct_gather_node_resp_msg::energy"]
        [::std::mem::offset_of!(acct_gather_node_resp_msg, energy) - 0usize];
    ["Offset of field: acct_gather_node_resp_msg::node_name"]
        [::std::mem::offset_of!(acct_gather_node_resp_msg, node_name) - 8usize];
    ["Offset of field: acct_gather_node_resp_msg::sensor_cnt"]
        [::std::mem::offset_of!(acct_gather_node_resp_msg, sensor_cnt) - 16usize];
};
pub type acct_gather_node_resp_msg_t = acct_gather_node_resp_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acct_gather_energy_req_msg {
    pub context_id: u16,
    pub delta: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acct_gather_energy_req_msg"]
        [::std::mem::size_of::<acct_gather_energy_req_msg>() - 4usize];
    ["Alignment of acct_gather_energy_req_msg"]
        [::std::mem::align_of::<acct_gather_energy_req_msg>() - 2usize];
    ["Offset of field: acct_gather_energy_req_msg::context_id"]
        [::std::mem::offset_of!(acct_gather_energy_req_msg, context_id) - 0usize];
    ["Offset of field: acct_gather_energy_req_msg::delta"]
        [::std::mem::offset_of!(acct_gather_energy_req_msg, delta) - 2usize];
};
pub type acct_gather_energy_req_msg_t = acct_gather_energy_req_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job_defaults {
    pub type_: u16,
    pub value: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of job_defaults"][::std::mem::size_of::<job_defaults>() - 16usize];
    ["Alignment of job_defaults"][::std::mem::align_of::<job_defaults>() - 8usize];
    ["Offset of field: job_defaults::type_"][::std::mem::offset_of!(job_defaults, type_) - 0usize];
    ["Offset of field: job_defaults::value"][::std::mem::offset_of!(job_defaults, value) - 8usize];
};
pub type job_defaults_t = job_defaults;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct partition_info {
    pub allow_alloc_nodes: *mut ::std::os::raw::c_char,
    pub allow_accounts: *mut ::std::os::raw::c_char,
    pub allow_groups: *mut ::std::os::raw::c_char,
    pub allow_qos: *mut ::std::os::raw::c_char,
    pub alternate: *mut ::std::os::raw::c_char,
    pub billing_weights_str: *mut ::std::os::raw::c_char,
    pub cluster_name: *mut ::std::os::raw::c_char,
    pub cr_type: u16,
    pub cpu_bind: u32,
    pub def_mem_per_cpu: u64,
    pub default_time: u32,
    pub deny_accounts: *mut ::std::os::raw::c_char,
    pub deny_qos: *mut ::std::os::raw::c_char,
    pub flags: u32,
    pub grace_time: u32,
    pub job_defaults_list: *mut list_t,
    pub job_defaults_str: *mut ::std::os::raw::c_char,
    pub max_cpus_per_node: u32,
    pub max_cpus_per_socket: u32,
    pub max_mem_per_cpu: u64,
    pub max_nodes: u32,
    pub max_share: u16,
    pub max_time: u32,
    pub min_nodes: u32,
    pub name: *mut ::std::os::raw::c_char,
    pub node_inx: *mut i32,
    pub nodes: *mut ::std::os::raw::c_char,
    pub nodesets: *mut ::std::os::raw::c_char,
    pub over_time_limit: u16,
    pub preempt_mode: u16,
    pub priority_job_factor: u16,
    pub priority_tier: u16,
    pub qos_char: *mut ::std::os::raw::c_char,
    pub resume_timeout: u16,
    pub state_up: u16,
    pub suspend_time: u32,
    pub suspend_timeout: u16,
    pub total_cpus: u32,
    pub total_nodes: u32,
    pub tres_fmt_str: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of partition_info"][::std::mem::size_of::<partition_info>() - 232usize];
    ["Alignment of partition_info"][::std::mem::align_of::<partition_info>() - 8usize];
    ["Offset of field: partition_info::allow_alloc_nodes"]
        [::std::mem::offset_of!(partition_info, allow_alloc_nodes) - 0usize];
    ["Offset of field: partition_info::allow_accounts"]
        [::std::mem::offset_of!(partition_info, allow_accounts) - 8usize];
    ["Offset of field: partition_info::allow_groups"]
        [::std::mem::offset_of!(partition_info, allow_groups) - 16usize];
    ["Offset of field: partition_info::allow_qos"]
        [::std::mem::offset_of!(partition_info, allow_qos) - 24usize];
    ["Offset of field: partition_info::alternate"]
        [::std::mem::offset_of!(partition_info, alternate) - 32usize];
    ["Offset of field: partition_info::billing_weights_str"]
        [::std::mem::offset_of!(partition_info, billing_weights_str) - 40usize];
    ["Offset of field: partition_info::cluster_name"]
        [::std::mem::offset_of!(partition_info, cluster_name) - 48usize];
    ["Offset of field: partition_info::cr_type"]
        [::std::mem::offset_of!(partition_info, cr_type) - 56usize];
    ["Offset of field: partition_info::cpu_bind"]
        [::std::mem::offset_of!(partition_info, cpu_bind) - 60usize];
    ["Offset of field: partition_info::def_mem_per_cpu"]
        [::std::mem::offset_of!(partition_info, def_mem_per_cpu) - 64usize];
    ["Offset of field: partition_info::default_time"]
        [::std::mem::offset_of!(partition_info, default_time) - 72usize];
    ["Offset of field: partition_info::deny_accounts"]
        [::std::mem::offset_of!(partition_info, deny_accounts) - 80usize];
    ["Offset of field: partition_info::deny_qos"]
        [::std::mem::offset_of!(partition_info, deny_qos) - 88usize];
    ["Offset of field: partition_info::flags"]
        [::std::mem::offset_of!(partition_info, flags) - 96usize];
    ["Offset of field: partition_info::grace_time"]
        [::std::mem::offset_of!(partition_info, grace_time) - 100usize];
    ["Offset of field: partition_info::job_defaults_list"]
        [::std::mem::offset_of!(partition_info, job_defaults_list) - 104usize];
    ["Offset of field: partition_info::job_defaults_str"]
        [::std::mem::offset_of!(partition_info, job_defaults_str) - 112usize];
    ["Offset of field: partition_info::max_cpus_per_node"]
        [::std::mem::offset_of!(partition_info, max_cpus_per_node) - 120usize];
    ["Offset of field: partition_info::max_cpus_per_socket"]
        [::std::mem::offset_of!(partition_info, max_cpus_per_socket) - 124usize];
    ["Offset of field: partition_info::max_mem_per_cpu"]
        [::std::mem::offset_of!(partition_info, max_mem_per_cpu) - 128usize];
    ["Offset of field: partition_info::max_nodes"]
        [::std::mem::offset_of!(partition_info, max_nodes) - 136usize];
    ["Offset of field: partition_info::max_share"]
        [::std::mem::offset_of!(partition_info, max_share) - 140usize];
    ["Offset of field: partition_info::max_time"]
        [::std::mem::offset_of!(partition_info, max_time) - 144usize];
    ["Offset of field: partition_info::min_nodes"]
        [::std::mem::offset_of!(partition_info, min_nodes) - 148usize];
    ["Offset of field: partition_info::name"]
        [::std::mem::offset_of!(partition_info, name) - 152usize];
    ["Offset of field: partition_info::node_inx"]
        [::std::mem::offset_of!(partition_info, node_inx) - 160usize];
    ["Offset of field: partition_info::nodes"]
        [::std::mem::offset_of!(partition_info, nodes) - 168usize];
    ["Offset of field: partition_info::nodesets"]
        [::std::mem::offset_of!(partition_info, nodesets) - 176usize];
    ["Offset of field: partition_info::over_time_limit"]
        [::std::mem::offset_of!(partition_info, over_time_limit) - 184usize];
    ["Offset of field: partition_info::preempt_mode"]
        [::std::mem::offset_of!(partition_info, preempt_mode) - 186usize];
    ["Offset of field: partition_info::priority_job_factor"]
        [::std::mem::offset_of!(partition_info, priority_job_factor) - 188usize];
    ["Offset of field: partition_info::priority_tier"]
        [::std::mem::offset_of!(partition_info, priority_tier) - 190usize];
    ["Offset of field: partition_info::qos_char"]
        [::std::mem::offset_of!(partition_info, qos_char) - 192usize];
    ["Offset of field: partition_info::resume_timeout"]
        [::std::mem::offset_of!(partition_info, resume_timeout) - 200usize];
    ["Offset of field: partition_info::state_up"]
        [::std::mem::offset_of!(partition_info, state_up) - 202usize];
    ["Offset of field: partition_info::suspend_time"]
        [::std::mem::offset_of!(partition_info, suspend_time) - 204usize];
    ["Offset of field: partition_info::suspend_timeout"]
        [::std::mem::offset_of!(partition_info, suspend_timeout) - 208usize];
    ["Offset of field: partition_info::total_cpus"]
        [::std::mem::offset_of!(partition_info, total_cpus) - 212usize];
    ["Offset of field: partition_info::total_nodes"]
        [::std::mem::offset_of!(partition_info, total_nodes) - 216usize];
    ["Offset of field: partition_info::tres_fmt_str"]
        [::std::mem::offset_of!(partition_info, tres_fmt_str) - 224usize];
};
pub type partition_info_t = partition_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct delete_partition_msg {
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of delete_partition_msg"][::std::mem::size_of::<delete_partition_msg>() - 8usize];
    ["Alignment of delete_partition_msg"][::std::mem::align_of::<delete_partition_msg>() - 8usize];
    ["Offset of field: delete_partition_msg::name"]
        [::std::mem::offset_of!(delete_partition_msg, name) - 0usize];
};
pub type delete_part_msg_t = delete_partition_msg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct resource_allocation_response_msg {
    pub account: *mut ::std::os::raw::c_char,
    pub job_id: u32,
